title: Code Signing (WINDOWS - security)
id: 646b99cb-452f-4db1-9654-0c4b329d96cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: Molerats
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.molerats
