title: Service Execution (WINDOWS - sysmon)
id: e2f83e08-f1a1-4df5-a840-03f21dfb22ef
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1569.002.
  Threat Actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1569.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' start '
    Image|endswith|contains:
      - '\csexec.exe'
    Description|contains:
      - 'csexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1569.002
  - actor.hunt-dharma-crysis
