title: Remote Desktop Protocol (M365 - entra_id)
id: 2b53ab22-d369-4bcb-8ead-d56d4b0b11d3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.001.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1021.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.001
  - actor.alphv-blackcat
