title: Domain Account (WINDOWS - security)
id: ed3f19e9-f1b1-443b-96a1-b296d7856bcc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.gallium
