title: Code Signing (WINDOWS - security)
id: a8a426b8-e90d-452f-a625-75f89de5d296
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.gallium
