title: Archive via Utility (WINDOWS - security)
id: d29cd5b8-448a-41b4-ac6f-1ac7b6a3a0a9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' user '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.gallium
