title: Domain Trust Discovery (GOOGLE - workspace)
id: c265d995-9acf-43c5-857a-acd3e1503cf1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1482.
  Threat Actor: Chimera
references:
  - https://attack.mitre.org/techniques/T1482/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1482
  - actor.chimera
