title: T1547.001 (M365)
id: cacf841a-5a80-4aeb-b05a-b440f271d3ae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.001.
references:
  - https://attack.mitre.org/techniques/T1547.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.001
