title: Data from Local System (WINDOWS - sysmon)
id: 9e2e0ba0-1a84-495d-bbe6-81d113c9aa93
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1005.
  Threat Actor: Stealth Falcon
references:
  - https://attack.mitre.org/techniques/T1005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-r'
    Image|endswith|contains:
      - '\sqlcmd.exe'
    CommandLine|contains|all|contains:
      - 'SELECT'
      - 'TOP'
      - '[VeeamBackup].[dbo].[Credentials]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1005
  - actor.stealth_falcon
