title: External Remote Services (WINDOWS - security)
id: 1d7235db-3ac6-4ea6-8d85-a14e6983ac3c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Repellent Scorpius Cicada3301
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.repellent_scorpius_cicada3301
