title: Screen Capture - Brain Cipher (unified_logging)
id: 25828af8-6b78-4ad0-9030-7d3fcf12b8a5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_screencapture.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.brain_cipher
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/usr/sbin/screencapture'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
