title: Process Discovery (LINUX - auditd)
id: f9116c3c-e147-47d4-b611-bed2cdd2f9d8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.bianlian
