title: Local Account (LINUX - auditd)
id: 0b3c4af7-7c39-49f9-829a-1f47b13fe2be
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|endswith|contains:
      - '/useradd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.bianlian
