title: Develop Capabilities (LINUX - auditd)
id: ace44326-f752-4579-b936-bafd72f21a47
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1587.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1587/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|startswith|contains:
      - '/tmp/'
      - '/var/www/'
      - '/home/*/public_html/'
    Image|endswith|contains:
      - '/crackmapexec'
      - '/havoc'
      - '/merlin-agent'
    Image|contains|contains:
      - '/cobaltstrike'
      - '/teamserver'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1587
  - actor.bianlian
