title: Data Transfer Size Limits - SafeLocker (auditd)
id: 52c1691d-2db5-4403-9de1-d7ce294cb0b4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1030 (Data Transfer Size Limits).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1030/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_split_file_into_pieces.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1030
  - actor.safelocker
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'SYSCALL'
    comm|contains: 'split'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
