title: Command and Scripting Interpreter - SafeLocker (auditd)
id: 1b53bba0-a351-49c0-b556-aba90ad54ff8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059 (Command and Scripting Interpreter).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_bpfdoor_file_accessed.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059
  - actor.safelocker
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/var/run/haldrund.pid'
      - '/var/run/xinetd.lock'
      - '/var/run/kdevrund.pid'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
