title: Non-Application Layer Protocol - SafeLocker (auditd)
id: 7366e859-519a-4ffa-9aa8-c342f353c267
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1095 (Non-Application Layer Protocol).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_susp_c2_commands.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1095
  - actor.safelocker
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    key|contains: 'susp_activity'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
