title: Screen Capture (LINUX - auditd)
id: c9e285ba-8a42-4cfe-ab33-90682483fd43
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1113.
  Threat Actor: Group5
references:
  - https://attack.mitre.org/techniques/T1113/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'xwd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1113
  - actor.group5
