title: Software Deployment Tools (WINDOWS - security)
id: 06f33294-3944-427d-9513-aa234502451b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Threat Group-1314
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.threat_group-1314
