title: Command and Scripting Interpreter (WINDOWS - defender)
id: 48262e29-a0b3-4596-b929-ca67dc2f9189
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
  Threat Actor: APT19
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\csrss.exe'
      - '\ctfmon.exe'
      - '\dllhost.exe'
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '^^'
      - '^|^'
      - ',;,'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
  - actor.apt19
