title: Local Groups - Rhysida (auditd)
id: 5a9222db-d4bd-44fb-b7a7-11b266b1c0c2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.001 (Local Groups).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_groups.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.001
  - actor.rhysida
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains:
      - '/groups'
      - '/cat'
      - '/ed'
      - '/head'
      - '/less'
    cmd|contains: '/etc/group'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
