title: Security Software Discovery - Rhysida (auditd)
id: 91ee4aee-a182-4030-b33d-4e2bd72422d3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1518.001 (Security Software Discovery).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1518/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_security_software_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1518.001
  - actor.rhysida
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.name|contains: 'grep'
    process.parent.executable|contains:
      - '/Library/Application Support/*'
      - '/opt/McAfee/agent/scripts/ma'
    process.args|contains: 'Passwords'
    process.parent.args|contains: 'checkhealth'
    process.command_line|contains:
      - 'grep ESET Command-line scanner, version %s -A2'
      - 'grep --color=auto ESET Command-line scanner, version %s -A2'
    version|contains: ',
       '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
