title: Develop Capabilities - Rhysida (auditd)
id: 1db82689-1fd1-4c19-886b-2d0d2f81986c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1587 (Develop Capabilities).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1587/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_susp_exe_folders.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1587
  - actor.rhysida
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - '/tmp/'
      - '/var/lib/pgsql/data/'
      - '/usr/local/mysql/data/'
      - '/var/lib/mysql/'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
