title: Indicator Removal - INC Ransom (sysmon)
id: 3552256f-c1fb-40aa-ae52-d7497fe8dc5e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070 (Indicator Removal).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1070/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_deleting_websvr_access_logs.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070
  - actor.inc_ransom
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.path|contains:
      - 'C:\\inetpub\\logs\\LogFiles\\*.log'
      - '/var/www/*/logs/access.log'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
