title: Domain Account - INC Ransom (sysmon)
id: 19591cf5-1036-4543-8adb-3d5b3e1516e3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.002 (Domain Account).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1087/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_ad_explorer_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.002
  - actor.inc_ransom
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'ADExplorer*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
