title: Malicious Link - INC Ransom (sysmon)
id: fc19ca19-abcc-4bd1-b9fc-204cecb0d2be
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1204.001 (Malicious Link).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1204/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_clickfix_filefix_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1204.001
  - actor.inc_ransom
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    ParentImage|contains: '\explorer.exe'
    CommandLine|contains:
      - '#'
      - 'account'
      - 'anti-bot'
      - 'botcheck'
      - 'captcha'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
