title: DLL - INC Ransom (sysmon)
id: 808b3482-b016-47b4-b393-61f30639debc
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574.001 (DLL).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_amsi_bypass_dllhijack.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574.001
  - actor.inc_ransom
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.name|contains:
      - 'amsi.dll'
      - 'amsi'
    file.path|contains:
      - '?:\\$SysReset\\CloudImage\\Package_for_RollupFix*\\amsi.dll'
      - '\\\\?\\Volume{*}\\Windows\\syswow64\\amsi.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
