title: Data Manipulation - Benzona (entra_id)
id: 65485aa3-8123-4b46-a75a-a0db81c77de1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1565 (Data Manipulation).
  Associated threat actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1565/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/impact_hosts_file_modified.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1565
  - actor.benzona
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    file.path|contains:
      - '/private/etc/hosts'
      - '?:\\Windows\\System32\\drivers\\etc\\hosts'
    process.executable|contains:
      - 'C:\\Program Files\\Fortinet\\FortiClient\\FCDBLog.exe'
      - '/usr/local/demisto/server'
    process.args|contains: '/etc/hosts'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
