title: System Network Configuration Discovery (WINDOWS - security)
id: ecf2d07b-7743-46a2-b2d2-ecc0edf0962b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Darkhotel
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.darkhotel
