title: Dynamic-link Library Injection (M365 - entra_id)
id: 7559cff4-f62b-47c4-a89a-22191b00aea1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.001.
  Threat Actor: Tropic Trooper
references:
  - https://attack.mitre.org/techniques/T1055.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.001
  - actor.tropic_trooper
