title: OS Credential Dumping - Cactus Ransomware (security)
id: d37a605a-b667-476a-9f6b-606db47dc639
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_wceaux_dll.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.cactus_ransomware
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectName|contains: '\wceaux.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
