title: SSH - Cactus Ransomware (security)
id: f69c4024-6466-4603-95c5-0b6f96099c96
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.004 (SSH).
  Associated threat actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1021/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.004
  - actor.cactus_ransomware
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
