title: Command and Scripting Interpreter (WINDOWS - security)
id: c4c3bf9a-20c5-479a-ac49-ab02931de88c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
  Threat Actor: Generic
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    ParentImage|endswith|contains:
      - '\ArcSOC.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\cscript.exe'
      - '\mshta.exe'
    CommandLine|contains|contains:
      - '^^'
      - '^|^'
      - ',;,'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
  - actor.generic
