title: 232b7f21-adf9-4b42-b936-b9d6f7df856e (WINDOWS)
id: 42e9f3db-289f-43b6-bc0c-2c9251664b87
description: >
  Detects techniques consistent with MITRE ATT&CK technique 232b7f21-adf9-4b42-b936-b9d6f7df856e.
references:
  - https://attack.mitre.org/techniques/232b7f21-adf9-4b42-b936-b9d6f7df856e/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.232b7f21-adf9-4b42-b936-b9d6f7df856e
