title: Local Account (WINDOWS - defender)
id: 72fdaac6-d0d0-411d-88e0-68fe1ba109b3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'user'
      - 'add'
      - 'expires:never'
    CommandLine|contains|contains:
      - 'Remote Desktop Users'
      - 'Utilisateurs du Bureau à distance'
      - 'Usuarios de escritorio remoto'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.magic_hound
