title: Protocol Tunneling (WINDOWS - defender)
id: 1ca8f8de-bfbc-49d8-8f6e-f7ea4fe4cd0e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1572.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1572/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - ' -R '
    Description|contains:
      - 'Command-line SSH, Telnet, and Rlogin client'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1572
  - actor.magic_hound
