title: Spearphishing Link - BlackSuit (unified_logging)
id: 9c3b19f9-f2ae-4407-9892-72132ae541c5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.002 (Spearphishing Link).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.002
  - actor.blacksuit
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
