title: M365 SharePoint Malware File Detected
id: 20de5af1-20de-40de-a0de-20de5af10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1608
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/lateral_movement_sharepoint_malware_uploaded.toml
author: elastic (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1608
logsource:
  product: m365
  service: sharepoint
detection:
  selection:
    # Original elastic detection logic
    # event.dataset:o365.audit and event.provider:SharePoint and event.code:SharePointFileOperation and event.action:FileMalwareDetected
  condition: selection
level: medium
