title: Valid Accounts (MACOS - unified_logging)
id: 983580d3-edf2-4ace-be16-6d915d04d10d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: REvil
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/sysadminctl'
    CommandLine|contains|contains:
      - ' -d '
    CommandLine|contains|all|contains:
      - ' -guestAccount'
      - ' on'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.revil
