title: Masquerade Task or Service (WINDOWS - sysmon)
id: 7c6e03e1-88bc-4f85-b0d4-fadb2b5589eb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.magic_hound
