title: Domain Trust Discovery (WINDOWS - sysmon)
id: e1b0b117-9293-451a-a60b-3fc4a8fe6cfd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1482.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1482/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' -CollectionMethod All '
      - ' --CollectionMethods Session '
      - ' --Loop --Loopduration '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1482
  - actor.magic_hound
