title: Executable Installer File Permissions Weakness (WINDOWS - defender)
id: 92ced718-72e8-47e2-8107-80026161cf8f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.005.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1574.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ' -m '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.005
  - actor.mustang_panda
