title: System Information Discovery - Vect RaaS (workspace)
id: b7a579d1-5df3-4976-8a45-2e761f6e009f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_virtual_machine_fingerprinting_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.vect_raas
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.args|contains: 'Manufacturer*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
