title: Steal or Forge Kerberos Tickets - BlackBasta (entra_id)
id: f54a5107-08c8-4b29-86f8-1982f3440ef2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558 (Steal or Forge Kerberos Tickets).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1558/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558
  - actor.blackbasta
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
