title: Encrypted Channel - BlackBasta (entra_id)
id: a079ed65-0d23-4b37-9279-35a02f1d157b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1573 (Encrypted Channel).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_detection/microsoft365_from_susp_ip_addresses.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1573
  - actor.blackbasta
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    eventSource|contains: 'SecurityComplianceCenter'
    eventName|contains: 'Activity from suspicious IP addresses'
    status|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
