title: Automated Collection (WINDOWS - security)
id: f6c89c47-3336-4a9e-aef4-a1ea26d9304d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1119.
  Threat Actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1119/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.doc'
      - '.docx'
      - '.xls'
    CommandLine|contains|all|contains:
      - 'dir '
      - ' /b '
      - ' /s '
    ParentCommandLine|contains|contains:
      - ' > %TEMP%\'
      - ' > %TMP%\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1119
  - actor.donex
