title: Obfuscated Files or Information - GLOBAL (security)
id: 0f26b1e9-2f6f-42bd-be67-08124a666ac9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027 (Obfuscated Files or Information).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_invoke_obfuscation_clip_services_security.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027
  - actor.global
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cmd'
      - '&&'
      - 'clipboard]::'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
