title: Clear Windows Event Logs - GLOBAL (security)
id: 9aa40b8c-230b-473a-8dbc-9e1ad6b85f55
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070.001 (Clear Windows Event Logs).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1070/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_audit_log_cleared.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070.001
  - actor.global
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '517'
      - '1102'
    Provider_Name|contains:
      - 'Security'
      - 'Microsoft-Windows-Eventlog'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
