title: Service Execution - GLOBAL (security)
id: e8097c2e-7b33-41c2-accb-0acf525b7583
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1569.002 (Service Execution).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1569/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1569.002
  - actor.global
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'ADMIN$'
      - '.exe'
      - '%COMSPEC%'
      - 'start'
    ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
