title: Malicious Copy and Paste - Interlock (defender)
id: 67830f81-bb21-4cfc-a7f2-df22e46ea561
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1204.004 (Malicious Copy and Paste).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1204/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_clickfix_filefix_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1204.004
  - actor.interlock
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessParentFileName|contains: '\explorer.exe'
    ProcessCommandLine|contains:
      - '#'
      - 'account'
      - 'anti-bot'
      - 'botcheck'
      - 'captcha'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
