title: OS Credential Dumping (WINDOWS)
id: 54507a2a-9dda-40b3-a98a-0921d5f91516
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'lsass.exe'
      - 'mimikatz.exe'
    CommandLine|contains:
      - 'sekurlsa'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
