title: Account Manipulation (WINDOWS - sysmon)
id: c5e6923d-4745-4a6e-add6-84df302cdec3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1098.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1098/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Group Policy Creator Owners'
      - 'Schema Admins'
    CommandLine|contains|all|contains:
      - 'useraccount'
      - ' set '
      - 'passwordexpires'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1098
  - actor.bianlian
