title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: 2639fe84-2639-4639-a639-2639fe840000
status: stable
description: Detection rule for MITRE ATT&CK technique T1087
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: elastic (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1087
logsource:
  product: azure
  service: entra_id
detection:
  selection:
    # Original elastic detection logic
    # any where event.dataset : (
    #     "azure.activitylogs",
    #     "azure.graphactivitylogs",
    #     "azure.auditlogs",
    #     "azure.signinlogs",
    #     "o365.audit"
    # ) and user_agent.original regex~ "(azure|sharp|blood)(hound)/.*"
  condition: selection
level: medium
