title: LSA Secrets (WINDOWS - security)
id: 984c7b76-acbd-4bff-9ddf-ea9c35a3d0a6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.brain_cipher
