title: LSA Secrets (WINDOWS - security)
id: 1de82ca0-ba7b-4278-af33-d31d5bad5bcb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.brain_cipher
