title: Cached Domain Credentials (WINDOWS)
id: b86e3d1a-4ce4-4874-83e1-f27a30812b7a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.005.
references:
  - https://attack.mitre.org/techniques/T1003.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.005
