title: Command Obfuscation (WINDOWS - security)
id: b832352c-3744-4a05-8700-7505087f0cf1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.010.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1027.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '-ComObject'
      - 'InstallProduct('
      - '.Insert('
    CommandLine|contains|contains:
      - '#'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.010
  - actor.brain_cipher
