title: PowerShell (WINDOWS - security)
id: a41e4060-c8ca-4543-9e1f-dde925057e07
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'cmd'
      - '"set'
      - '-f'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.brain_cipher
