title: Python (WINDOWS - security)
id: b6a31372-7298-4d0c-864c-d4963e522d5e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.brain_cipher
