title: Web Protocols (WINDOWS - security)
id: 331e7960-171d-4ce3-a0c7-74e2bd031b8d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1071.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.exe tunnel'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|contains|contains:
      - '\servers\Stable-'
    ParentImage|endswith|contains:
      - '\server\node.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071.001
  - actor.brain_cipher
