title: Application Layer Protocol (WINDOWS - security)
id: 04cfb317-6537-4c49-99bf-8739aac07735
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.brain_cipher
