title: File and Directory Discovery (WINDOWS - security)
id: 9095ff01-1879-4116-bbee-8d3942e14543
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.brain_cipher
