title: Email Collection (WINDOWS - security)
id: e1d7180a-a99b-4daf-a606-7db3a9509c3f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1114.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1114/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - 'Add-PSSnapin'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1114
  - actor.brain_cipher
