title: Access Token Manipulation (WINDOWS - security)
id: 412f1b94-0e57-4625-990f-333ed8340b22
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    FilterName|contains|contains:
      - 'RonPolicy'
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.brain_cipher
