title: Browser Session Hijacking (WINDOWS - security)
id: f82179c9-60ea-4e81-8098-895dc4ac75c3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1185.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1185/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '--remote-debugging-'
      - '--user-data-dir'
      - '--headless'
    CommandLine|contains|contains:
      - ' --remote-debugging-'
    Image|endswith|contains:
      - '\firefox.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1185
  - actor.brain_cipher
