title: Indirect Command Execution (WINDOWS - security)
id: 04dc0600-5f6f-462b-a719-7cee1d6adb68
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1202.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1202/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'bash.exe -'
      - 'bash -'
    ParentImage|endswith|contains:
      - '\bginfo.exe'
      - '\bginfo64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1202
  - actor.brain_cipher
