title: Exploitation for Client Execution (WINDOWS - security)
id: d69b38c4-2204-40ef-8708-4bebe90d7403
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\Hwp.exe'
    Image|endswith|contains:
      - '\gbb.exe'
    CommandLine|contains|contains:
      - 'jre1.'
      - 'jdk1.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
  - actor.brain_cipher
