title: Create Process with Token (WINDOWS - sysmon)
id: e3328aee-050d-4eaf-8d25-406ac3a773c7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.002.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1134.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\services.exe'
    CommandLine|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
    CommandLine|contains|contains:
      - '/EXEFilename'
      - '/CommandLine'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.002
  - actor.lazarus_group
