title: Standard Encoding (WINDOWS - sysmon)
id: 51ba78b6-0694-4627-a685-50f965e08bc8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1132.001.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1132.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'FromBase64String'
      - 'MemoryStream'
      - 'H4sI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1132.001
  - actor.lazarus_group
