title: LLMNR/NBT-NS Poisoning and SMB Relay (WINDOWS - sysmon)
id: 9cab9ccc-718c-4595-9e72-9c829dbd1a3c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1557.001.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1557.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' --adcs '
      - ' --port '
    Image|contains|contains:
      - 'PetitPotam'
      - 'RottenPotato'
      - 'HotPotato'
    CommandLine|contains|contains:
      - 'Invoke-Tater'
      - ' smbrelay'
      - ' ntlmrelay'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1557.001
  - actor.lazarus_group
