title: Clear Windows Event Logs - Kazu (defender)
id: 68e703a5-4b4e-48cc-8078-1dde62704111
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070.001 (Clear Windows Event Logs).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1070/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_audit_policy_disabled_winlog.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070.001
  - actor.kazu
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.code|contains: '4719'
    host.os.type|contains: 'windows'
    winlog.event_data.AuditPolicyChangesDescription|contains: 'Success removed'
    winlog.event_data.SubCategory|contains: 'Logon'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
