title: Command Obfuscation - Lynx (sysmon)
id: 944e5578-14dc-4b3b-a504-91a87d6f3400
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.010 (Command Obfuscation).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1027/010/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_obf_args_unicode_modified_letters.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.010
  - actor.lynx
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'reg.exe'
      - 'wevtutil.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
