title: Bidirectional Communication - Lynx (sysmon)
id: 774eed0a-ad4f-439b-9473-3cae9fd246ae
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1102.002 (Bidirectional Communication).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1102/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/beaconing/command_and_control_beaconing.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1102.002
  - actor.lynx
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'WaAppAgent.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
