title: Video Capture - Lynx (sysmon)
id: 55ba58d8-ead6-484b-93f2-7a6cf414f4b8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1125 (Video Capture).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_webcam_video_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1125
  - actor.lynx
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'NewFrameEventHandler'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
