title: Remote Desktop Protocol (WINDOWS - defender)
id: 4dc177bb-5e87-4632-826e-43a6f5f7f1b7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.001.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1021.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /v:'
    Description|contains:
      - 'Command-line SSH, Telnet, and Rlogin client'
    CommandLine|contains|contains:
      - 'rdtoggle'
      - 'Win32_TerminalServiceSetting'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.001
  - actor.alphv-blackcat
