title: Software Deployment Tools (WINDOWS - defender)
id: b0c11a8e-19c6-4c81-9dd8-1d8d49c4eb34
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.alphv-blackcat
