title: Deobfuscate/Decode Files or Information (WINDOWS - defender)
id: 6ba3fb33-3f4c-449c-b2fe-9d2e4023abb1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1140.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1140/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.7z'
      - '.avi'
      - '.bat'
    Image|endswith|contains:
      - '\ping.exe'
    CommandLine|re|contains:
      - '0x[a-fA-F0-9]{8}'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1140
  - actor.alphv-blackcat
