title: Lateral Tool Transfer (WINDOWS - defender)
id: a5e47a32-5738-4201-acc0-eff9ec96fcfb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.alphv-blackcat
