title: Masquerade Task or Service (WINDOWS - sysmon)
id: d598d8ff-abeb-496f-8eca-a2e21715b42c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Higaisa
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.higaisa
