title: Deobfuscate/Decode Files or Information (WINDOWS - sysmon)
id: 17e4382c-aa0c-42bc-a4c9-7ed9a91d34de
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1140.
  Threat Actor: Higaisa
references:
  - https://attack.mitre.org/techniques/T1140/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.7z'
      - '.avi'
      - '.bat'
    Image|endswith|contains:
      - '\ping.exe'
    CommandLine|re|contains:
      - '0x[a-fA-F0-9]{8}'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1140
  - actor.higaisa
