title: Systemd Service - Kazu (unified_logging)
id: 0e4ddf90-fed5-47f4-8453-6e6e0c433c47
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1543.002 (Systemd Service).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1543/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_etc_file_creation.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1543.002
  - actor.kazu
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/etc/ld.so.conf.d/*'
      - '/usr/lib/systemd/system/*'
    process.name|contains:
      - 'chef-client'
      - 'rhn_check'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
