title: Security Account Manager - Akira (security)
id: 4846e865-5c24-4e14-9f48-ea7db3d8a013
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.002 (Security Account Manager).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.002
  - actor.akira
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5145'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$'
      - 'SYSTEM32\'
      - '.tmp'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
