title: Domain Accounts - Akira (security)
id: 3703062d-97c0-4656-9fad-879fca89be63
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.002 (Domain Accounts).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1078/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.002
  - actor.akira
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '10'
    AuthenticationPackageName|contains: 'Negotiate'
    TargetUserName|contains: 'Admin'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
