title: Windows File and Directory Permissions Modification - Akira (security)
id: e5c7dc84-c701-4678-b6b5-75015fe634b7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1222.001 (Windows File and Directory Permissions Modification).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1222/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_ad_object_writedac_access.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1222.001
  - actor.akira
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4662'
    ObjectServer|contains: 'DS'
    AccessMask|contains:
      - '0x40000'
      - '19195a5b-6da0-11d0-afd3-00c04fd930c9'
      - 'domainDNS'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
