title: Pass the Hash - Akira (security)
id: 42b66021-e18a-45cf-a047-221c426427e7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1550.002 (Pass the Hash).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1550/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_overpass_the_hash.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1550.002
  - actor.akira
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '9'
    LogonProcessName|contains: 'seclogo'
    AuthenticationPackageName|contains: 'Negotiate'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
