title: System Services - Akira (security)
id: 3a3a31a2-88a9-4b80-80d5-6718c1e117b1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1569 (System Services).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1569/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_psexec_lateral_movement_command.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1569
  - actor.akira
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'PsExec.exe'
    process.args|contains: '-accepteula'
    process.executable|contains:
      - '?:\\ProgramData\\Docusnap\\Discovery\\discovery\\plugins\\17\\Bin\\psexec.exe'
      - '?:\\Program Files\\Docusnap X\\Tools\\dsDNS.exe'
    process.parent.executable|contains: '?:\\Program Files (x86)\\Cynet\\Cynet Scanner\\CynetScanner.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
