title: Command Obfuscation (WINDOWS - defender)
id: 8f34166d-ca07-4a7b-9aff-1064801e5c1f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.010.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1027.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '-ComObject'
      - 'InstallProduct('
      - '.Insert('
    CommandLine|contains|contains:
      - '#'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.010
  - actor.brain_cipher
