title: File Deletion (WINDOWS - defender)
id: 5f1a464f-3564-4fe4-9f73-2e84fe06f5d6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.004.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1070.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'del '
      - 'erase '
    CommandLine|contains|all|contains:
      - 'ping'
      - 'copy '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.004
  - actor.brain_cipher
