title: Internal Defacement (WINDOWS - defender)
id: 7d959a2f-ffcd-42e9-b03c-1ac1d34c6fae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1491.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1491.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1491.001
  - actor.brain_cipher
