title: DLL (WINDOWS - defender)
id: 118b5991-3ee0-46ee-9a23-1565559bc4e0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/PhoneDeepLink'
    Image|endswith|contains:
      - '\dnscmd.exe'
    Image|startswith|contains:
      - 'C:\Program Files\VMware\'
    CommandLine|contains|all|contains:
      - '/config'
      - '/serverlevelplugindll'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.brain_cipher
