title: System Network Connections Discovery (LINUX - auditd)
id: 258603f1-e022-48ff-b049-ab2808c1cab7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
    ParentCommandLine|contains|contains:
      - '/usr/bin/landscape-sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.gallium
