title: NTDS.DIT Created
id: 36ed0fb4-36ed-46ed-a6ed-36ed0fb40000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_ntds_dit_creation.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1003.003
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|endswith: 'ntds.dit'
    #     condition: selection
    # 
  condition: selection
level: medium
