title: New Outlook Macro Created
id: 41c1e361-41c1-41c1-a1c1-41c1e3610000
status: stable
description: Detection rule for MITRE ATT&CK technique T1008
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_office_outlook_macro_creation.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1008
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '\outlook.exe'
    #         TargetFilename|endswith: '\Microsoft\Outlook\VbaProject.OTM'
    #     condition: selection
    # 
  condition: selection
level: medium
