title: Credential Manager Access By Uncommon Applications
id: 1c18a179-1c18-4c18-ac18-1c18a1790000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_access/file_access_win_susp_credential_manager_access.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1003
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         FileName|contains:
    #             - '\AppData\Local\Microsoft\Credentials\'
    #             - '\AppData\Roaming\Microsoft\Credentials\'
    #             - '\AppData\Local\Microsoft\Vault\'
    #             - '\ProgramData\Microsoft\Vault\'
    #     filter_system_folders:
    #         Image|startswith:
    #             - 'C:\Program Files\'
    #             - 'C:\Program Files (x86)\'
    #             - 'C:\Windows\system32\'
    #             - 'C:\Windows\SysWOW64\'
    #     condition: selection and not 1 of filter_*
    # 
  condition: selection
level: medium
