title: Outbound RDP Connections Over Non-Standard Tools
id: 53cc3657-53cc-43cc-a3cc-53cc36570000
status: stable
description: Detection rule for MITRE ATT&CK technique T1021.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_rdp_outbound_over_non_standard_tools.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1021.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         DestinationPort: 3389
    #         Initiated: 'true'
    #     filter_main_mstsc:
    #         Image:
    #             - 'C:\Windows\System32\mstsc.exe'
    #             - 'C:\Windows\SysWOW64\mstsc.exe'
    #     filter_optional_dns:
    #         # Note: https://github.com/SigmaHQ/sigma/pull/2249
    #         Image: 'C:\Windows\System32\dns.exe'
    #         SourcePort: 53
    #         Protocol: 'udp'
    #     filter_optional_avast:
    #         Image|endswith:
    #             - '\Avast Software\Avast\AvastSvc.exe'
    #             - '\Avast\AvastSvc.exe'
    #     filter_optional_sysinternals_rdcman:
    #         Image|endswith: '\RDCMan.exe'
    #     filter_optional_chrome:
    #         Image: 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    #     filter_optional_third_party:
    #         Image|endswith:
    #             - '\FSAssessment.exe'
    #             - '\FSDiscovery.exe'
    #             - '\MobaRTE.exe'
    #             - '\mRemote.exe'
    #             - '\mRemoteNG.exe'
    #             - '\Passwordstate.exe'
    #             - '\RemoteDesktopManager.exe'
    #             - '\RemoteDesktopManager64.exe'
    #             - '\RemoteDesktopManagerFree.exe'
    #             - '\RSSensor.exe'
    #             - '\RTS2App.exe'
    #             - '\RTSApp.exe'
    #             - '\spiceworks-finder.exe'
    #             - '\Terminals.exe'
    #             - '\ws_TunnelService.exe'
    #     filter_optional_thor:
    #         Image|endswith:
    #             - '\thor.exe'
    #             - '\thor64.exe'
    #     filter_optional_splunk:
    #         Image|startswith: 'C:\Program Files\SplunkUniversalForwarder\bin\'
    #     filter_optional_sentinel_one:
    #         Image|endswith: '\Ranger\SentinelRanger.exe'
    #     filter_optional_firefox:
    #         Image: 'C:\Program Files\Mozilla Firefox\firefox.exe'
    #     filter_optional_tsplus:  # Some RAS
    #         Image:
    #             - 'C:\Program Files\TSplus\Java\bin\HTML5service.exe'
    #             - 'C:\Program Files (x86)\TSplus\Java\bin\HTML5service.exe'
    #     filter_optional_null:
    #         Image: null
    #     filter_optional_empty:
    #         Image: ''
    #     filter_optional_unknown:
    #         Image: '<unknown process>'
    # ... [truncated]
  condition: selection
level: medium
