title: Suspicious Outbound SMTP Connections
id: 062704ef-0627-4627-a627-062704ef0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1048.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_susp_outbound_smtp_connections.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1048.003
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         DestinationPort:
    #             - 25
    #             - 587
    #             - 465
    #             - 2525
    #         Initiated: 'true'
    #     filter_clients:
    #         Image|endswith:
    #             - \thunderbird.exe
    #             - \outlook.exe
    #     filter_mailserver:
    #         Image|startswith: 'C:\Program Files\Microsoft\Exchange Server\'
    #     filter_outlook:
    #         Image|startswith: 'C:\Program Files\WindowsApps\microsoft.windowscommunicationsapps_'
    #         Image|endswith: '\HxTsr.exe'
    #     condition: selection and not 1 of filter_*
    # 
  condition: selection
level: medium
