title: Advanced IP Scanner - File Event
id: 0820ab76-0820-4820-a820-0820ab760000
status: stable
description: Detection rule for MITRE ATT&CK technique T1046
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_advanced_ip_scanner.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1046
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|contains: '\AppData\Local\Temp\Advanced IP Scanner 2'
    #     condition: selection
    # 
  condition: selection
level: medium
