title: First Time Seen Removable Device
id: 05f98745-05f9-45f9-a5f9-05f987450000
status: stable
description: Detection rule for MITRE ATT&CK technique T1052.001
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/initial_access_exfiltration_first_time_seen_usb.toml
author: elastic (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1052.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original elastic detection logic
    # event.category:"registry" and host.os.type:"windows" and registry.value:"FriendlyName" and registry.path:*USBSTOR*
  condition: selection
level: medium
