title: BloodHound Collection Files
id: 06199db3-0619-4619-a619-06199db30000
status: stable
description: Detection rule for MITRE ATT&CK technique T1069.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_bloodhound_collection.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1069.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|endswith:
    #             - 'BloodHound.zip'
    #             - '_computers.json'
    #             - '_containers.json'
    #             - '_domains.json'
    #             - '_gpos.json'
    #             - '_groups.json'
    #             - '_ous.json'
    #             - '_users.json'
    #     filter_optional_ms_winapps:
    #         Image|endswith: '\svchost.exe'
    #         TargetFilename|startswith: 'C:\Program Files\WindowsApps\Microsoft.'
    #         TargetFilename|endswith: '\pocket_containers.json'
    #     condition: selection and not 1 of filter_optional_*
    # 
  condition: selection
level: medium
