title: File Creation Date Changed to Another Year
id: 3fcb5273-3fcb-4fcb-afcb-3fcb52730000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.006
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_change/file_change_win_2022_timestomping.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1070.006
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection1:
    #         PreviousCreationUtcTime|startswith: '2022'
    #     filter1:
    #         CreationUtcTime|startswith: '2022'
    #     selection2:
    #         PreviousCreationUtcTime|startswith: '202'
    #     filter2:
    #         CreationUtcTime|startswith: '202'
    #     gen_filter_updates:
    #         - Image:
    #               - 'C:\Windows\system32\ProvTool.exe'
    #               - 'C:\Windows\System32\usocoreworker.exe'
    #               - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
    #         - TargetFilename|startswith: 'C:\ProgramData\USOPrivate\UpdateStore\'
    #         - TargetFilename|endswith:
    #               - '.tmp'
    #               - '.temp'
    #     gen_filter_tiworker:
    #         Image|startswith: 'C:\WINDOWS\'
    #         Image|endswith: '\TiWorker.exe'
    #         TargetFilename|endswith: '.cab'
    #     condition: (( selection1 and not filter1 ) or ( selection2 and not filter2 )) and not 1 of gen_filter*
    # 
  condition: selection
level: medium
