title: Remove Exported Mailbox from Exchange Webserver
id: 6814d242-6814-4814-a814-6814d2420000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/msexchange/win_exchange_proxyshell_remove_mailbox_export.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1070
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     keywords:
    #         '|all':
    #             - 'Remove-MailboxExportRequest'
    #             - ' -Identity '
    #             - ' -Confirm "False"'
    #     condition: keywords
    # 
  condition: selection
level: medium
