title: Unmount Share Via Net.EXE
id: 47ef66aa-47ef-47ef-a7ef-47ef66aa0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.005
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_unmount.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1070.005
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - Image|endswith:
    #               - '\net.exe'
    #               - '\net1.exe'
    #         - OriginalFileName:
    #               - 'net.exe'
    #               - 'net1.exe'
    #     selection_cli:
    #         CommandLine|contains|all:
    #             - 'share'
    #             - '/delete'
    #     condition: all of selection*
    # 
  condition: selection
level: medium
