title: HackTool - SOAPHound Execution
id: 3793431c-3793-4793-a793-3793431c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1087
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_soaphound_execution.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1087
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_1:
    #         CommandLine|contains:
    #             - ' --buildcache '
    #             - ' --bhdump '
    #             - ' --certdump '
    #             - ' --dnsdump '
    #     selection_2:
    #         CommandLine|contains:
    #             - ' -c '
    #             - ' --cachefilename '
    #             - ' -o '
    #             - ' --outputdirectory'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
