title: AppX Package Installation Attempts Via AppInstaller.EXE
id: 6b4ec416-6b4e-4b4e-ab4e-6b4ec4160000
status: stable
description: Detection rule for MITRE ATT&CK technique T1105
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_appinstaller.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1105
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|startswith: 'C:\Program Files\WindowsApps\Microsoft.DesktopAppInstaller_'
    #         Image|endswith: '\AppInstaller.exe'
    #     condition: selection
    # 
  condition: selection
level: medium
