title: HackTool - WinPwn Execution - ScriptBlock
id: 536d0b0d-536d-436d-a36d-536d0b0d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1106
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_hktl_winpwn.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1106
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains:
    #             - 'Offline_Winpwn'
    #             - 'WinPwn '
    #             - 'WinPwn.exe'
    #             - 'WinPwn.ps1'
    #     condition: selection
    # 
  condition: selection
level: medium
