title: New DNS ServerLevelPluginDll Installed Via Dnscmd.EXE
id: 34c30454-34c3-44c3-a4c3-34c304540000
status: stable
description: Detection rule for MITRE ATT&CK technique T1112
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dnscmd_install_new_server_level_plugin_dll.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1112
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '\dnscmd.exe'
    #         CommandLine|contains|all:
    #             - '/config'
    #             - '/serverlevelplugindll'
    #     condition: selection
    # 
  condition: selection
level: medium
