title: HackTool - Hashcat Password Cracker Execution
id: 49ef94d0-49ef-49ef-a9ef-49ef94d00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_hashcat.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1110.002
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         Image|endswith: '\hashcat.exe'
    #     selection_cli:
    #         CommandLine|contains|all:
    #             - '-a '
    #             - '-m 1000 '
    #             - '-r '
    #     condition: 1 of selection_*
    # 
  condition: selection
level: medium
