title: Data Copied To Clipboard Via Clip.EXE
id: 698a6cce-698a-498a-a98a-698a6cce0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1115
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_clip_execution.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1115
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         - Image|endswith: '\clip.exe'
    #         - OriginalFileName: clip.exe
    #     condition: selection
    # 
  condition: selection
level: medium
