title: Chromium Browser Instance Executed With Custom Extension
id: 14b39fd3-14b3-44b3-a4b3-14b39fd30000
status: stable
description: Detection rule for MITRE ATT&CK technique T1176.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_load_extension.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1176.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith:
    #             - '\brave.exe'
    #             - '\chrome.exe'
    #             - '\msedge.exe'
    #             - '\opera.exe'
    #             - '\vivaldi.exe'
    #         CommandLine|contains: '--load-extension='
    #     condition: selection
    # 
  condition: selection
level: medium
