title: Potential Data Stealing Via Chromium Headless Debugging
id: 65b995d0-65b9-45b9-a5b9-65b995d00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1185
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_debugging.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1185
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         CommandLine|contains|all:
    #             - '--remote-debugging-' # Covers: --remote-debugging-address, --remote-debugging-port, --remote-debugging-socket-name, --remote-debugging-pipe....etc
    #             - '--user-data-dir'
    #             - '--headless'
    #     condition: selection
    # 
  condition: selection
level: medium
