title: Octopus Scanner Malware
id: 25ce0726-25ce-45ce-a5ce-25ce07260000
status: stable
description: Detection rule for MITRE ATT&CK technique T1195.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_mal_octopus_scanner.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1195.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|endswith:
    #             - '\AppData\Local\Microsoft\Cache134.dat'
    #             - '\AppData\Local\Microsoft\ExplorerSync.db'
    #     condition: selection
    # 
  condition: selection
level: medium
