title: Potential Remote Desktop Connection to Non-Domain Host
id: 42fc24df-42fc-42fc-a2fc-42fc24df0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1219.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/ntlm/win_susp_ntlm_rdp.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1219.002
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 8001
    #         TargetName|startswith: 'TERMSRV'
    #     condition: selection
    # 
  condition: selection
level: medium
