title: AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl - File
id: 40fc7d09-40fc-40fc-a0fc-40fc7d090000
status: stable
description: Detection rule for MITRE ATT&CK technique T1216
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_winrm_awl_bypass.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1216
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     system_files:
    #         TargetFilename|endswith:
    #             - 'WsmPty.xsl'
    #             - 'WsmTxt.xsl'
    #     in_system_folder:
    #         TargetFilename|startswith:
    #             - 'C:\Windows\System32\'
    #             - 'C:\Windows\SysWOW64\'
    #     condition: system_files and not in_system_folder
    # 
  condition: selection
level: medium
