title: DNS Query To Remote Access Software Domain From Non-Browser App
id: 291d538c-291d-491d-a91d-291d538c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1219
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_remote_access_software_domains_non_browsers.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1219
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_generic:
    #         QueryName|endswith:
    #             - 'agent.jumpcloud.com'
    #             - 'agentreporting.atera.com'
    #             - 'ammyy.com'
    #             - 'api.parsec.app'
    #             - 'api.playanext.com'
    #             - 'api.splashtop.com'
    #             - 'app.atera.com'
    #             - 'assist.zoho.com'
    #             - 'authentication.logmeininc.com'
    #             - 'beyondtrustcloud.com'
    #             - 'cdn.kaseya.net'
    #             - 'client.teamviewer.com'
    #             - 'comserver.corporate.beanywhere.com'
    #             - 'control.connectwise.com'
    #             - 'downloads.zohocdn.com'
    #             - 'dwservice.net'
    #             - 'express.gotoassist.com'
    #             - 'getgo.com'
    #             - 'getscreen.me'  # https://x.com/malmoeb/status/1868757130624614860?s=12&t=C0_T_re0wRP_NfKa27Xw9w
    #             - 'integratedchat.teamviewer.com'
    #             - 'join.zoho.com'
    #             - 'kickstart.jumpcloud.com'
    #             - 'license.bomgar.com'
    #             - 'logmein-gateway.com'
    #             - 'logmein.com'
    #             - 'logmeincdn.http.internapcdn.net'
    #             - 'n-able.com'
    #             - 'net.anydesk.com'
    #             - 'netsupportsoftware.com' # For NetSupport Manager RAT
    #             - 'parsecusercontent.com'
    #             - 'pubsub.atera.com'
    #             - 'relay.kaseya.net'
    #             - 'relay.screenconnect.com'
    #             - 'relay.splashtop.com'
    #             - 'remoteassistance.support.services.microsoft.com' # Quick Assist Application
    #             - 'remotedesktop-pa.googleapis.com'
    #             - 'remoteutilities.com' # Usage of Remote Utilities RAT
    #             - 'secure.logmeinrescue.com'
    #             - 'services.vnc.com'
    #             - 'static.remotepc.com'
    #             - 'swi-rc.com'
    #             - 'swi-tc.com'
    #             - 'tailscale.com' # Scattered Spider threat group used this RMM tool
    #             - 'telemetry.servers.qetqo.com'
    #             - 'tmate.io'
    #             - 'twingate.com'  # Scattered Spider threat group used this RMM tool
    #             - 'zohoassist.
    # ... [truncated]
  condition: selection
level: medium
