title: Deleted Data Overwritten Via Cipher.EXE
id: 22f40a34-22f4-42f4-a2f4-22f40a340000
status: stable
description: Detection rule for MITRE ATT&CK technique T1485
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cipher_overwrite_deleted_data.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1485
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - OriginalFileName: 'CIPHER.EXE'
    #         - Image|endswith: '\cipher.exe'
    #     selection_cli:
    #         CommandLine|contains: ' /w:'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
