title: SQLite Chromium Profile Data DB Access
id: 37ccd7ea-37cc-47cc-a7cc-37ccd7ea0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1539
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sqlite_chromium_profile_data.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1539
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_sql:
    #         - Product: SQLite
    #         - Image|endswith:
    #               - '\sqlite.exe'
    #               - '\sqlite3.exe'
    #     selection_chromium:
    #         CommandLine|contains:
    #             - '\User Data\' # Most common folder for user profile data among Chromium browsers
    #             - '\Opera Software\' # Opera
    #             - '\ChromiumViewer\' # Sleipnir (Fenrir)
    #     selection_data:
    #         CommandLine|contains:
    #             - 'Login Data' # Passwords
    #             - 'Cookies'
    #             - 'Web Data' # Credit cards, autofill data
    #             - 'History'
    #             - 'Bookmarks'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
