title: File Creation In Suspicious Directory By Msdt.EXE
id: 3f9a9eb8-3f9a-4f9a-af9a-3f9a9eb80000
status: stable
description: Detection rule for MITRE ATT&CK technique T1547.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_msdt_susp_directories.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1547.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '\msdt.exe'
    #         TargetFilename|contains:
    #             - '\Desktop\'
    #             - '\Start Menu\Programs\Startup\'
    #             - 'C:\PerfLogs\'
    #             - 'C:\ProgramData\'
    #             - 'C:\Users\Public\'
    #     condition: selection
    # 
  condition: selection
level: medium
