title: Access To Windows Credential History File By Uncommon Applications
id: 16230d04-1623-4623-a623-16230d040000
status: stable
description: Detection rule for MITRE ATT&CK technique T1555.004
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_access/file_access_win_susp_credhist.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1555.004
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         FileName|endswith: '\Microsoft\Protect\CREDHIST'
    #     filter_main_system_folders:
    #         Image|startswith:
    #             - 'C:\Program Files\'
    #             - 'C:\Program Files (x86)\'
    #             - 'C:\Windows\system32\'
    #             - 'C:\Windows\SysWOW64\'
    #     filter_main_explorer:
    #         Image: 'C:\Windows\explorer.exe'
    #     condition: selection and not 1 of filter_main_*
    # 
  condition: selection
level: medium
