title: RDP Connection Allowed Via Netsh.EXE
id: 235d04c1-235d-435d-a35d-235d04c10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1562.004
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_allow_rdp.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1562.004
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - Image|endswith: '\netsh.exe'
    #         - OriginalFileName: 'netsh.exe'
    #     selection_cli:
    #         # Example:
    #         #   Old: netsh firewall add portopening TCP 3389 "Open Port 3389"
    #         #   New: netsh advfirewall firewall add rule name= "Open Port 3389" dir=in action=allow protocol=TCP localport=3389
    #         CommandLine|contains|all:
    #             - 'firewall '
    #             - 'add '
    #             - 'tcp '
    #             - '3389'
    #         CommandLine|contains:
    #             - 'portopening'
    #             - 'allow'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
