title: Potentially Suspicious Malware Callback Communication
id: 5d97febd-5d97-4d97-ad97-5d97febd0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1571
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_susp_malware_callback_port.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1571
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Initiated: 'true'
    #         DestinationPort:
    #             - 100
    #             - 198
    #             - 200
    #             - 243
    #             - 473
    #             - 666
    #             - 700
    #             - 743
    #             - 777
    #             - 1443
    #             - 1515
    #             - 1777
    #             - 1817
    #             - 1904
    #             - 1960
    #             - 2443
    #             - 2448
    #             - 3360
    #             - 3675
    #             - 3939
    #             - 4040
    #             - 4433
    #             - 4438
    #             - 4443
    #             - 4444
    #             - 4455
    #             - 5445
    #             - 5552
    #             - 5649
    #             - 6625
    #             - 7210
    #             - 7777
    #             - 8143
    #             - 8843
    #             - 9631
    #             - 9943
    #             - 10101
    #             - 12102
    #             - 12103
    #             - 12322
    #             - 13145
    #             - 13394
    #             - 13504
    #             - 13505
    #             - 13506
    #             - 13507
    #             - 14102
    #             - 14103
    #             - 14154
    #             - 49180
    #             - 65520
    #             - 65535
    #     filter_main_local_ranges:
    #         DestinationIp|cidr:
    #             - '127.0.0.0/8'
    #             - '10.0.0.0/8'
    #             - '172.16.0.0/12'
    #             - '192.168.0.0/16'
    #             - '169.254.0.0/16'
    #             - '::1/128'  # IPv6 loopback
    #             - 'fe80::/10'  # IPv6 link-local addresses
    #             - 'fc00::/7'  # IPv6 private addresses
    #     filter_optional_sys_directories:
    #         Image|startswith:
    #             - 'C:\Program Files\'
    #             - 'C:\Program Files (x86)\'
    #     condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
    # 
  condition: selection
level: medium
