title: Using SettingSyncHost.exe as LOLBin
id: 07091e9d-0709-4709-a709-07091e9d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1574.008
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_settingsynchost.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1574.008
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     system_utility:
    #         Image|startswith:
    #             - 'C:\Windows\System32\'
    #             - 'C:\Windows\SysWOW64\'
    #     parent_is_settingsynchost:
    #         ParentCommandLine|contains|all:
    #             - 'cmd.exe /c'
    #             - 'RoamDiag.cmd'
    #             - '-outputpath'
    #     condition: not system_utility and parent_is_settingsynchost
    # 
  condition: selection
level: medium
