title: PSEXEC Remote Execution File Artefact
id: 67191f1a-6719-4719-a719-67191f1a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1570
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_sysinternals_psexec_service_key.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1570
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|startswith: 'C:\Windows\PSEXEC-'
    #         TargetFilename|endswith: '.key'
    #     condition: selection
    # 
  condition: selection
level: medium
