title: HackTool - PurpleSharp Execution
id: 4d572122-4d57-4d57-ad57-4d5721220000
status: stable
description: Detection rule for MITRE ATT&CK technique T1587
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_purplesharp_indicators.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1587
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - Image|contains: '\purplesharp'
    #         - OriginalFileName: 'PurpleSharp.exe'
    #     selection_cli:
    #         CommandLine|contains:
    #             - 'xyz123456.exe'
    #             - 'PurpleSharp'
    #     condition: 1 of selection_*
    # 
  condition: selection
level: medium
