title: Console CodePage Lookup Via CHCP
id: 3fac6f17-3fac-4fac-afac-3fac6f170000
status: stable
description: Detection rule for MITRE ATT&CK technique T1614.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_chcp_codepage_lookup.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1614.001
logsource:
  product: windows
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ParentImage|endswith: '\cmd.exe'
    #         ParentCommandLine|contains|windash:
    #             - ' -c '
    #             - ' -r '
    #             - ' -k '
    #         Image|endswith: '\chcp.com'
    #         CommandLine|endswith:
    #             - 'chcp'
    #             - 'chcp '
    #             - 'chcp  '
    #     condition: selection
    # 
  condition: selection
level: medium
