title: Windows Service (LINUX - auditd)
id: 8fa46101-5c90-49e0-8b96-e2b6b0c1f37b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.apt32
