title: DLL (LINUX - auditd)
id: 0425fb93-ec8d-4d5c-b77a-6467f9803e64
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains|contains:
      - '/.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.apt32
