title: OS Credential Dumping (LINUX - auditd)
id: 28c09674-9905-4a2c-96d2-094924e883df
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains:
      - '/etc/pam.d/system-auth'
      - '/etc/pam.d/password-auth'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.safepay
