title: Windows Management Instrumentation (LINUX - auditd)
id: d4794214-280d-4e50-a0c3-d0fa0cbe8dbd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1047.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1047/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1047
  - actor.safepay
