title: Exploit Public-Facing Application (LINUX - auditd)
id: a317f3db-00ca-416f-a5df-b68d7c85b0bb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    User|contains:
      - 'root'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.safepay
