title: T1218.004 (LINUX - auditd)
id: 7b20e46c-f82d-463d-a2fa-4ab499ac8aee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.004.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1218.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.004
  - actor.safepay
