title: T1573.001 (LINUX - auditd)
id: d111a691-d95b-46de-b2fa-6431151ef109
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1573.001.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1573.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1573.001
  - actor.safepay
