title: System Owner/User Discovery (WINDOWS - security)
id: 5c89a9bc-977f-412e-906e-e230b6528b57
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: Sidewinder
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SharpLdapWhoami.exe'
    CommandLine|contains|all|contains:
      - 'Get-ADComputer '
      - ' -Filter \*'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.sidewinder
