title: Valid Accounts (WINDOWS - security)
id: 4ba77b8b-ff59-481d-9f55-fa0cb7ae9658
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Royal
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.royal
