title: System Information Discovery (LINUX - auditd)
id: e90677ac-6901-485d-b943-3ea5dc185602
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1082.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1082/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1082
  - actor.brain_cipher
