title: Ingress Tool Transfer (LINUX - auditd)
id: 4ebd1bde-755d-48e4-bf23-911c3f064d58
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1105.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1105/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/wget'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1105
  - actor.brain_cipher
