title: T1036 (M365)
id: 714cfb25-2895-4edf-9797-e789a07bfad4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.
references:
  - https://attack.mitre.org/techniques/T1036/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036
