title: Query Registry (WINDOWS - sysmon)
id: 6371ceb3-b121-49d7-ae19-5df72aec3725
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\PCHunter64.exe'
      - '\PCHunter32.exe'
    CommandLine|contains|contains:
      - 'query'
    CommandLine|contains|windash|contains:
      - ' -E '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.coosea
