title: Masquerading (WINDOWS - sysmon)
id: 45873f9f-e125-4691-97e8-8ac2a4db58f4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1036/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' -u '
      - ' --full '
      - ' -f '
    Image|endswith|contains:
      - '\chcp.com'
    CommandLine|endswith|contains:
      - ' 936'
      - ' 1258'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036
  - actor.coosea
