title: Hide Artifacts (WINDOWS - sysmon)
id: 8e4686a9-135b-424a-b755-00f9963d7c13
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.coosea
