title: Encrypted Channel - Vect RaaS (entra_id)
id: 098013d4-ab15-4a3c-9373-0c4e2595d82b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1573 (Encrypted Channel).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_detection/microsoft365_from_susp_ip_addresses.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1573
  - actor.vect_raas
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    eventSource|contains: 'SecurityComplianceCenter'
    eventName|contains: 'Activity from suspicious IP addresses'
    status|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
