title: Data Transfer Size Limits - ALPHV-BlackCat (unified_logging)
id: 21aa4671-6e07-47fc-b44e-8ec3b0ad881b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1030 (Data Transfer Size Limits).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1030/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_split_file_into_pieces.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1030
  - actor.alphv-blackcat
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/split'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
