title: Cron - ALPHV-BlackCat (unified_logging)
id: 9dacae57-8d5e-4a23-af3e-51fb713c2a99
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053.003 (Cron).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_cron_jobs_creation_and_runtime.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053.003
  - actor.alphv-blackcat
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.args|contains: '-l'
    process.name|contains: 'running job'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
