title: Local Groups - ALPHV-BlackCat (unified_logging)
id: f1b8841e-c261-4825-81f1-082c185ec0ab
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.001 (Local Groups).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.001
  - actor.alphv-blackcat
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name|contains: '.*'
    process.parent.name|contains: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
