title: Local Account - ALPHV-BlackCat (unified_logging)
id: 5557d4f2-7c0a-49f8-bbf2-3fdbe2029c6f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.001 (Local Account).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.001
  - actor.alphv-blackcat
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name|contains: '.*'
    process.parent.name|contains: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
