title: Disable or Modify Tools (WINDOWS - security)
id: 1b50361e-91ae-4cd8-be9a-a950d04b0c04
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    OldUacValue|endswith|contains:
      - '8???'
      - '9???'
      - 'A???'
    ObjectName|contains|all|contains:
      - '\REGISTRY\MACHINE\SYSTEM'
      - 'ControlSet'
      - '\Control\Lsa'
    PrivilegeList|contains:
      - 'SeLoadDriverPrivilege'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.cactus_ransomware
