title: Binary Padding (LINUX - auditd)
id: f32bf0eb-ea34-4cff-99f2-4fbe0e24b5b3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.001.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1027.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    |all|contains:
      - 'truncate'
      - '-s'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.001
  - actor.leviathan
