title: Data Destruction (WINDOWS - defender)
id: c9f0d93f-e45e-48cf-ad90-bda9178f98a7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1485.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1485/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'deletejournal'
      - 'createjournal'
      - 'setZeroData'
    OriginalFileName|contains:
      - 'sdelete.exe'
    Image|endswith|contains:
      - '\sdelete.exe'
      - '\sdelete64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1485
  - actor.shinra
