title: Abuse Elevation Control Mechanism (WINDOWS - defender)
id: 5e7011f0-298a-4dea-816b-68243fbcb1a6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\mmc.exe'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
    ParentCommandLine|contains|contains:
      - 'WF.msc'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.shinra
