title: Boot or Logon Autostart Execution (WINDOWS - defender)
id: 287b383f-0e92-43c2-be6c-4edf53c9da48
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1547/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'grpconv.exe -o'
      - 'grpconv -o'
    Image|endswith|contains:
      - '\pnputil.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547
  - actor.shinra
