title: File and Directory Discovery (MACOS - unified_logging)
id: 36f862df-e3a4-4bf6-90f6-1d786a1edab0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Dark Caracal
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/usr/bin/file'
    CommandLine|re|contains:
      - '(.){200,}'
    Image|endswith|contains:
      - '/find'
    CommandLine|contains|contains:
      - '-perm -4000'
      - '-perm -2000'
      - '-perm 0777'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.dark_caracal
