title: Web Protocols (WINDOWS - defender)
id: d0fed0bd-c5f7-4a49-87b7-d2c8b0727f8c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.001.
  Threat Actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1071.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.exe tunnel'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|contains|contains:
      - '\servers\Stable-'
    ParentImage|endswith|contains:
      - '\server\node.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071.001
  - actor.nitrogen
