title: Abuse Elevation Control Mechanism (WINDOWS - defender)
id: 1a5b5fbe-7600-4b8c-8c03-b2b6e4378bc6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\mmc.exe'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
    ParentCommandLine|contains|contains:
      - 'WF.msc'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.nitrogen
