title: Native API - Cl0p (sysmon)
id: 75f01726-8628-4ad7-81c0-2e63f4755d8a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1106 (Native API).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1106/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_audio_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1106
  - actor.cl0p
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'sentinelbreakpoints'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
