title: Masquerading - Rincrypt (security)
id: 90e3c3b9-c1c8-4b11-8482-b02ed1f823ab
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1036 (Masquerading).
  Associated threat actor: Rincrypt
references:
  - https://attack.mitre.org/techniques/T1036/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_new_or_renamed_user_account_with_dollar_sign.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1036
  - actor.rincrypt
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4720 # create user'
      - '4781 # rename user'
      - '4720'
    SamAccountName|contains: '$'
    NewTargetUserName|contains: '$'
    TargetUserName|contains: 'HomeGroupUser$'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
