title: Ingress Tool Transfer (LINUX - auditd)
id: a6122981-0ae7-4ee8-addb-e52bb3ce42b3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1105.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1105/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/wget'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1105
  - actor.yashma-ator-vietnamita
