title: External Remote Services - Vice Society (workspace)
id: ec14d44e-27f9-42e4-a8fb-a3756bda6c17
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1133 (External Remote Services).
  Associated threat actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_ssh_connection_established_inside_a_container.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1133
  - actor.vice_society
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    container.id|contains: '*'
    process.entry_leader.entry_meta.type|contains: 'sshd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
