title: Shared Modules (GOOGLE - workspace)
id: cfa74a45-c2ec-43e5-8e7a-a4f3d5c8cade
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1129.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1129/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1129
  - actor.alphv-blackcat
