title: Impair Defenses (GOOGLE - workspace)
id: f2cf2520-49ef-4c9c-8141-b82c85c9812b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1562/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562
  - actor.alphv-blackcat
