title: Process Discovery (LINUX - auditd)
id: 7bdeb6f4-dcd8-490c-9d4c-e156f60c4ab2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: DORRRA
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.dorrra
