title: SSH (WINDOWS - sysmon)
id: 259a2396-0025-40e7-a8e4-6a20df701b84
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.ransomhub
