title: Python (WINDOWS - sysmon)
id: a363583a-14bf-40e0-8227-c679cad6fd97
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.ransomhub
