title: Group Policy Modification (WINDOWS - sysmon)
id: f5d55aa2-8c62-435c-9a2b-3f766cab85f8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'gpme.msc'
      - 'gpobject:'
    CommandLine|contains|contains:
      - '\SOFTWARE\Policies\Microsoft\Windows\System'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.ransomhub
