title: Hide Artifacts (WINDOWS - sysmon)
id: 0da17eb7-c3f9-4170-a0b5-249e47556564
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.ransomhub
