title: Lateral Tool Transfer (WINDOWS - sysmon)
id: a8be6e03-1cdd-4753-94f3-8d25583d0dd0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.ransomhub
