title: Obfuscated Files or Information (WINDOWS - defender)
id: 24b45854-b91a-4dd4-af3e-1ce8bca16209
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-decode '
      - '-decodehex '
    CommandLine|contains|contains:
      - 'urlcache '
      - 'verifyctl '
      - 'URL '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.lockbit
