title: Token Impersonation/Theft (WINDOWS - defender)
id: ae6694b7-0776-4257-b782-8e439fd5c9ab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1134.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' backupkey '
      - ' blob '
      - ' certificates '
    ParentImage|endswith|contains:
      - '\services.exe'
    CommandLine|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.001
  - actor.lockbit
