title: Hide Artifacts (WINDOWS - defender)
id: 2e1b6e79-162e-490d-9315-007958ddcc94
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.lockbit
