title: Windows Service (LINUX - auditd)
id: aabe6df2-0158-4985-85e8-a9adb36ec9aa
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Beast
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.beast
