title: PowerShell (GOOGLE - workspace)
id: 0bb49c49-0997-4094-b1f3-206331e28ba0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.brain_cipher
