title: Access Token Manipulation (GOOGLE - workspace)
id: e8227a77-80a7-4532-be7b-fb9c66c9306a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.brain_cipher
