title: LSA Secrets - Brain Cipher (security)
id: a58378d1-468c-445a-b03c-4d28721105cf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.004 (LSA Secrets).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1003/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_dpapi_domain_backupkey_extraction.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.004
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4662'
    ObjectType|contains: 'SecretObject'
    AccessMask|contains: '0x2'
    ObjectName|contains: 'BCKUPKEY'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
