title: OS Credential Dumping - Brain Cipher (security)
id: 52701978-b038-4468-b235-b84f252f6789
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_wceaux_dll.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectName|contains: '\wceaux.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
