title: Video Capture - Brain Cipher (security)
id: a9c5e6fa-8f75-4621-bda0-feab6dafca26
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1125 (Video Capture).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_webcam_video_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1125
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'NewFrameEventHandler'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
