title: Access Token Manipulation - Brain Cipher (security)
id: 1f4d052a-0666-4c07-96e1-a8ef1ea16ca2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134 (Access Token Manipulation).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1134/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hktl_nofilter.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '5447'
      - '5449'
    FilterName|contains: 'RonPolicy'
    ProviderContextName|contains: 'RonPolicy'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
