title: Indirect Command Execution - Brain Cipher (security)
id: 70e57e3e-be12-433e-9944-2360b1d210e8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1202 (Indirect Command Execution).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_indirect_exec_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1202
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'conhost.exe'
    process.args|contains: '--headless'
    process.command_line|contains:
      - '*powershell*'
      - '*mhsta*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
