title: Credentials from Web Browsers - Brain Cipher (security)
id: a79af80d-a215-44c0-a322-87b9b3a27a89
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1555.003 (Credentials from Web Browsers).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1555/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_browsers_unusual_parent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1555.003
  - actor.brain_cipher
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'chrome.exe'
      - 'msedge.exe'
    process.command_line|contains: '\'
    process.args|contains: '--window-position=-*,-*'
    process.parent.executable|contains:
      - 'C:\\Windows\\explorer.exe'
      - 'C:\\Windows\\System32\\SECOCL64.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
