title: T1078 (GOOGLE - workspace)
id: ac1ef298-0044-4580-a0e9-dcca276864a3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: BlackCatALPHV
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.blackcatalphv
