title: LSASS Process Crashed - Application
id: fe5d86bd-40fa-4fa4-b0d6-007186edac05
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/application_error/win_application_error_lsass_crash.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Provider_Name: 'Application Error'
          EventID: 1000
          AppName: 'lsass.exe'
          ExceptionCode: 'c0000001' # STATUS_UNSUCCESSFUL
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
