title: Suspicious IO.FileStream
id: dab62b54-3d81-491d-9cfd-03c0ef1a8b18
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_iofilestream.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - New-Object
              - IO.FileStream
              - '\\\\.\\'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
