title: Possible Impacket SecretDump Remote Activity
id: b09adae7-a57e-46f6-ba4c-e76251268eaf
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 5145
          ShareName: '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$
          RelativeTargetName|contains|all:
              - 'SYSTEM32\'
              - '.tmp'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
