title: Ntdsutil Abuse
id: 6f1a57c8-da4a-45c6-9372-b3b40dafe8d4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/esent/win_esent_ntdsutil_abuse.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Provider_Name: 'ESENT'
          EventID:
              - 216
              - 325
              - 326
              - 327
          Data|contains: 'ntds.dit'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
