title: DPAPI Domain Backup Key Extraction
id: 08ed2e76-8022-4d6e-9046-2941b7261bf9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_dpapi_domain_backupkey_extraction.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 4662
          ObjectType: 'SecretObject'
          AccessMask: '0x2'
          ObjectName|contains: 'BCKUPKEY'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
