title: DirectorySearcher Powershell Exploitation
id: 09ee28a1-460a-4f79-9d17-b4436369b126
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1018.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1018/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_directorysearcher.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1018
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - 'New-Object '
              - 'System.DirectoryServices.DirectorySearcher'
              - '.PropertiesToLoad.Add'
              - '.findall()'
              - 'Properties.name'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
