title: Windows Process Executed From Removable Media
id: 932a9f79-0218-4544-8554-b1b39c5e5226
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1025.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1025/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_process_executed_from_removable_media.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1025
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel:
      - 'Endpoint.Processes\'
      - 'Endpoint.Registry'
    process_current_directory: '*'
    field: 'process_current_directory'
    registry_value_data: '\'
    registry_path: '\'
    object_name: 'replace(mvindex(split(mvindex(split(registry_path,\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
