title: PowerShell WebRequest Using Memory Stream
id: f4d850cd-c9f8-4db4-9c5a-b141b63c32a7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.011.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1027/011/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/powershell_webrequest_using_memory_stream.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1027.011
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '4104'
    ScriptBlockText: '*IO.MemoryStream*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
