title: Dynamic CSharp Compile Artefact
id: 091c6ece-c43d-4a93-beac-7af761729496
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_csharp_compile_artefact.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|endswith: '.cmdline'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
