title: Python Image Load By Non-Python Process
id: 3d075f8b-3cd6-4183-b46c-42810fb6c7f9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/image_load/image_load_susp_python_image_load.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Description: 'Python Core'
      filter_main_generic:
          - Image|contains: 'Python'  # FPs with python38.dll, python.exe etc.
          - Image|startswith:
                - 'C:\Program Files\'
                - 'C:\Program Files (x86)\'
                - 'C:\ProgramData\Anaconda3\' # Comment out if you don't use Anaconda in your environment
      filter_optional_null_image:
          Image: null
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
