title: Suspicious HTML File Creation
id: 72fd0ab6-9095-4c9d-9c04-a169bd05864d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1027/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/initial_access_evasion_suspicious_htm_file_creation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1027.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.extension:
      - 'htm'
      - 'html'
    file.path:
      - '?:\\Users\\*\\Downloads\\*'
      - '?:\\Users\\*\\AppData\\Local\\Temp\\Rar$*'
    process.args:
      - '?:\\Users\\*\\Downloads\\*.htm*'
      - '?:\\Users\\*\\AppData\\Local\\Temp\\Rar$*.htm*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
