title: Suspicious UltraVNC Execution
id: e719b69b-7c2b-4740-8667-d59171d3fe81
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_ultravnc_susp_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021.005
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - '-autoreconnect '
              - '-connect '
              - '-id:'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
