title: Get-ADUser Enumeration Using UserAccountControl Flags
id: b4bd87b4-314c-4ae7-a9b9-2db3caeb58fc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1033.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1033/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_as_rep_roasting.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1033
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          # 4194304 DONT_REQ_PREAUTH
          ScriptBlockText|contains|all:
              - 'Get-ADUser'
              - '-Filter'
              - 'useraccountcontrol'
              - '-band'
              - '4194304'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
