title: Windows Svchost.exe Parent Process Anomaly
id: 4122937c-6256-496e-b8a8-bdca7607e43e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.009.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1036/009/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_svchost_exe_parent_process_anomaly.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1036.009
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'svchost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
