title: Potential Homoglyph Attack Using Lookalike Characters
id: 9bfe627b-82cc-4270-8094-b09b0f9b4763
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.008.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/008/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_homoglyph_cyrillic_lookalikes.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036.008
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_upper:
          CommandLine|contains:
              - "\u0410" # А/A
              - "\u0412" # В/B
              - "\u0415" # Е/E
              - "\u041a" # К/K
              - "\u041c" # М/M
              - "\u041d" # Н/H
              - "\u041e" # О/O
              - "\u0420" # Р/P
              - "\u0421" # С/C
              - "\u0422" # Т/T
              - "\u0425" # Х/X
              - "\u0405" # Ѕ/S
              - "\u0406" # І/I
              - "\u0408" # Ј/J
              - "\u04ae" # Ү/Y
              - "\u04c0" # Ӏ/I
              - "\u050C" # Ԍ/G
              - "\u051a" # Ԛ/Q
              - "\u051c" # Ԝ/W
              - "\u0391" # Α/A
              - "\u0392" # Β/B
              - "\u0395" # Ε/E
              - "\u0396" # Ζ/Z
              - "\u0397" # Η/H
              - "\u0399" # Ι/I
              - "\u039a" # Κ/K
              - "\u039c" # Μ/M
              - "\u039d" # Ν/N
              - "\u039f" # Ο/O
              - "\u03a1" # Ρ/P
              - "\u03a4" # Τ/T
              - "\u03a5" # Υ/Y
              - "\u03a7" # Χ/X
      selection_lower:
          CommandLine|contains:
              - "\u0430" # а/a
              - "\u0435" # е/e
              - "\u043e" # о/o
              - "\u0440" # р/p
              - "\u0441" # с/c
              - "\u0445" # х/x
              - "\u0455" # ѕ/s
              - "\u0456" # і/i
              - "\u04cf" # ӏ/l
              - "\u0458" # ј/j
              - "\u04bb" # һ/h
              - "\u0501" # ԁ/d
              - "\u051b" # ԛ/q
              - "\u051d" # ԝ/w
              - "\u03bf" # ο/o
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
