title: Suspicious Outbound SMTP Connections
id: 62e30f93-d613-4a29-b633-4eb506ba8b85
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_susp_outbound_smtp_connections.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          DestinationPort:
              - 25
              - 587
              - 465
              - 2525
          Initiated: 'true'
      filter_clients:
          Image|endswith:
              - \thunderbird.exe
              - \outlook.exe
      filter_mailserver:
          Image|startswith: 'C:\Program Files\Microsoft\Exchange Server\'
      filter_outlook:
          Image|startswith: 'C:\Program Files\WindowsApps\microsoft.windowscommunicationsapps_'
          Image|endswith: '\HxTsr.exe'
      condition: selection and not 1 of filter_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
