title: Network Communication Initiated To Portmap.IO Domain
id: 00c71c70-0aee-4b4e-9d95-e85577f946dd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1041.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1041/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_domain_portmap.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1041
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Initiated: 'true'
          DestinationHostname|endswith: '.portmap.io'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
