title: Potential Telegram API Request Via CommandLine
id: 846c576c-9b46-4432-960a-146f89ca6bc0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1041.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1041/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/potential_telegram_api_request_via_commandline.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1041
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process: '*api.telegram.org*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
