title: Suspicious Process Discovery With Get-Process
id: f48d0866-dc4b-40ad-b8e6-78c5972ceece
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1057.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1057/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_get_process.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1057
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains: Get-Process
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
