title: First Time Seen Removable Device
id: e81c866c-ab00-4339-b281-23ccc25f75f6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1052.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1052/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/initial_access_exfiltration_first_time_seen_usb.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1052
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.category: 'registry'
    host.os.type: 'windows'
    registry.value: 'FriendlyName'
    registry.path: 'USBSTOR*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
