title: Suspicious Scheduled Task Write to System32 Tasks
id: 0b351c48-8551-4b52-afff-d67423cf1e9d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_task_write.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|contains: '\Windows\System32\Tasks'
          Image|contains:
              - '\AppData\'
              - 'C:\PerfLogs'
              - '\Windows\System32\config\systemprofile'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
