title: Hacktool Ruler
id: 3769b623-40f5-49ee-a67a-37ced9fb6a12
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_alert_ruler.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection1:
          EventID: 4776
          Workstation: 'RULER'
      selection2:
          EventID:
              - 4624
              - 4625
          WorkstationName: 'RULER'
      condition: (1 of selection*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
