title: Dllhost.EXE Execution Anomaly
id: bd6e0398-2368-4b02-9440-44c6984e7199
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dllhost_no_cli_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Image|endswith: '\dllhost.exe'
          CommandLine:
              - 'dllhost.exe'
              - 'dllhost'
      filter_main_null:
          CommandLine: null
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
