title: Remote Thread Creation In Uncommon Target Image
id: ae2404cb-dd9d-49e8-b9da-e95e0c5e083c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_susp_uncommon_target_image.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetImage|endswith:
              - '\calc.exe'
              - '\calculator.exe'
              - '\mspaint.exe'
              - '\notepad.exe'
              - '\ping.exe'
              - '\sethc.exe'
              - '\spoolsv.exe'
              - '\wordpad.exe'
              - '\write.exe'
      filter_main_csrss:
          SourceImage: 'C:\Windows\System32\csrss.exe'
      filter_main_notepad:
          SourceImage:
              - 'C:\Windows\System32\explorer.exe'
              - 'C:\Windows\System32\OpenWith.exe'
          TargetImage: 'C:\Windows\System32\notepad.exe'
      filter_main_sethc:
          SourceImage: 'C:\Windows\System32\AtBroker.exe'
          TargetImage: 'C:\Windows\System32\Sethc.exe'
      filter_optional_aurora_1:
          StartFunction: 'EtwpNotificationThread'
      filter_optional_aurora_2:
          SourceImage|contains: 'unknown process'
      filter_optional_vmtoolsd:
          SourceImage: 'C:\Program Files\VMware\VMware Tools\vmtoolsd.exe'
          StartFunction: 'GetCommandLineW'
          TargetImage:
              - 'C:\Windows\System32\notepad.exe'
              - 'C:\Windows\System32\spoolsv.exe'
      filter_optional_xerox_pjems:
          SourceImage: 'C:\Program Files\Xerox\XeroxPrintExperience\CommonFiles\XeroxPrintJobEventManagerService.exe'
          StartFunction: 'LoadLibraryW'
          TargetImage: 'C:\Windows\System32\spoolsv.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
