title: AppLocker Prevented Application or Script from Running
id: ba4fad78-b1e4-4cc6-8c08-13ac69d9d80e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/applocker/win_applocker_application_was_prevented_from_running.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 8004 # EXE and DLL
              - 8007 # MSI and Script
              - 8022 # Packaged app execution
              - 8025 # Packaged app deployment
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
