title: Recon Command Output Piped To Findstr.EXE
id: ebf4daf5-be4f-425f-8962-f6c1c9c757ec
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1057.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1057/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_recon_pipe_output.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1057
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          CommandLine|contains:
              # Note: Add additional CLI to increase and enhance coverage
              # Note: We use wildcards in this instance to avoid writing a lot of variations that can be avoided easily. You can switch to regex if its supported by your backend.
              - 'ipconfig*|*find'
              - 'net*|*find'
              - 'netstat*|*find'
              - 'ping*|*find'
              - 'systeminfo*|*find'
              - 'tasklist*|*find'
              - 'whoami*|*find'
      filter_optional_xampp:
          CommandLine|contains|all:
              - 'cmd.exe /c TASKLIST /V |'
              - 'FIND /I'
              - '\xampp\'
              - '\catalina_start.bat'
      condition: selection and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
