title: HackTool - CACTUSTORCH Remote Thread Creation
id: ec91e747-9d11-4f3d-9a24-dbfac5707d8c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.012.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_hktl_cactustorch.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055.012
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          SourceImage|endswith:
              - '\System32\cscript.exe'
              - '\System32\wscript.exe'
              - '\System32\mshta.exe'
              - '\winword.exe'
              - '\excel.exe'
          TargetImage|contains: '\SysWOW64\'
          StartModule: null
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
