title: RunMRU Registry Key Deletion
id: 14037a6e-b1b6-478f-8f32-152d24d876dc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_delete_runmru.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\reg.exe'
          - OriginalFileName: 'reg.exe'
      selection_cli:
          CommandLine|contains|all:
              - ' del'
              - '\Software\Microsoft\Windows\CurrentVersion\Explorer\RunMRU'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
