title: Netcat The Powershell Version
id: 185ce517-567e-4943-8423-83f5d47aa808
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1095.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_classic/posh_pc_powercat.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1095
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Data|contains:
              - 'powercat '
              - 'powercat.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
