title: Screen Capture Activity Via Psr.EXE
id: 6bc57ee7-5b06-49a2-af55-394ea51fc8e9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1113.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_psr_capture_screenshots.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1113
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Image|endswith: '\Psr.exe'
          CommandLine|contains:
              - '/start'
              - '-start'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
