title: HackTool - Hashcat Password Cracker Execution
id: 1942bd2c-98c1-4831-af0f-f09bc72f7b89
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_hashcat.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          Image|endswith: '\hashcat.exe'
      selection_cli:
          CommandLine|contains|all:
              - '-a '
              - '-m 1000 '
              - '-r '
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
