title: Suspicious Inter-Process Communication via Outlook
id: b7c1ce8e-ccdf-4b0a-9eb8-34cf6af11c68
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1114/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_email_outlook_mailbox_via_com.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1114.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name:
      - 'rundll32.exe'
      - 'wscript.exe'
      - 'OUTLOOK.EXE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
