title: ETW Logging Disabled In .NET Processes - Registry
id: 1e8733c0-3407-4f85-b7f2-590f48296bd6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1112.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_dot_net_etw_tamper.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1112
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_etw_enabled:
          EventID: 4657
          ObjectName|endswith: '\SOFTWARE\Microsoft\.NETFramework'
          ObjectValueName: 'ETWEnabled'
          NewValue: 0
      selection_complus:
          EventID: 4657
          ObjectName|contains: '\Environment'
          ObjectValueName:
              - 'COMPlus_ETWEnabled'
              - 'COMPlus_ETWFlags'
          NewValue: 0
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
