title: Silenttrinity Stager Msbuild Activity
id: 4e0ab193-ae7b-457e-9093-41542b00cc15
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1127.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1127/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_silenttrinity_stager_msbuild_activity.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1127.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Image|endswith: '\msbuild.exe'
      filter:
          DestinationPort:
              - 80
              - 443
          Initiated: 'true'
      condition: selection and filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
