title: Powershell Suspicious Win32_PnPEntity
id: 453198f1-d7fd-4a8d-9ba3-023b76a441ef
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1120.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1120/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_win32_pnpentity.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1120
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains: Win32_PnPEntity
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
