title: HackTool - PPID Spoofing SelectMyParent Tool Execution
id: 368c74eb-9aeb-4434-9293-21030b92cc9b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1134.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1134/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_selectmyparent.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1134.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          - Image|endswith: '\SelectMyParent.exe'
          - CommandLine|contains:
                - 'PPID-spoof'
                - 'ppid_spoof'
                - 'spoof-ppid'
                - 'spoof_ppid'
                - 'ppidspoof'
                - 'spoofppid'
                - 'spoofedppid'
                - ' -spawnto '
          - OriginalFileName|contains:
                - 'PPID-spoof'
                - 'ppid_spoof'
                - 'spoof-ppid'
                - 'spoof_ppid'
                - 'ppidspoof'
                - 'spoofppid'
                - 'spoofedppid'
          - Description: 'SelectMyParent'
          - Hashes|contains:
                - 'IMPHASH=04D974875BD225F00902B4CAD9AF3FBC'
                - 'IMPHASH=A782AF154C9E743DDF3F3EB2B8F3D16E'
                - 'IMPHASH=89059503D7FBF470E68F7E63313DA3AD'
                - 'IMPHASH=CA28337632625C8281AB8A130B3D6BAD'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
