title: HackTool - Impersonate Execution
id: 93806f86-23ed-464d-8235-80d3395847d2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1134.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1134/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_impersonate.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1134.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_commandline_exe:
          CommandLine|contains: 'impersonate.exe'
      selection_commandline_opt:
          CommandLine|contains:
              - ' list '
              - ' exec '
              - ' adduser '
      selection_hash:
          Hashes|contains:
              - 'MD5=9520714AB576B0ED01D1513691377D01'
              - 'SHA256=E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A'
              - 'IMPHASH=0A358FFC1697B7A07D0E817AC740DF62'
      condition: all of selection_commandline_* or selection_hash
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
