title: Outlook Home Page Registry Modification
id: 7d116250-ef58-433e-bf8d-c36991c4ee06
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1137/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_outlook_home_page.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1137.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.value: 'URL'
    registry.path:
      - '*\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\*'
      - '*\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Today\\*'
    registry.data.strings:
      - '*://*'
      - '*:\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
