title: Potential Persistence Via Microsoft Office Add-In
id: 3f777bd3-874e-4a65-ae35-ea5ad9966b9e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1137/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_office_addin_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1137.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_wlldropped:
          TargetFilename|contains: '\Microsoft\Word\Startup\'
          TargetFilename|endswith: '.wll'
      selection_xlldropped:
          TargetFilename|contains: '\Microsoft\Excel\Startup\'
          TargetFilename|endswith: '.xll'
      selection_xladropped:
          TargetFilename|contains: 'Microsoft\Excel\XLSTART\'
          TargetFilename|endswith: '.xlam'
      selection_generic:
          TargetFilename|contains: '\Microsoft\Addins\'
          TargetFilename|endswith:
              - '.xlam'
              - '.xla'
              - '.ppam'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
