title: Creation of a Hidden Local User Account
id: e29237a3-243a-4493-8d82-84e089e5fb5e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1136/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_evasion_hidden_local_account_creation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1136
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.path:
      - 'HKLM\\SAM\\SAM\\Domains\\Account\\Users\\Names\\*$\\'
      - 'MACHINE\\SAM\\SAM\\Domains\\Account\\Users\\Names\\*$\\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
