title: Addition of SID History to Active Directory Object
id: 8f9d74a8-d374-408e-aa47-d7e66a5d650f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1134.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1134/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_add_sid_history.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1134.005
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection1:
          EventID:
              - 4765
              - 4766
      selection2:
          EventID: 4738
      selection3:
          SidHistory:
              - '-'
              - '%%1793'
      filter_null:
          SidHistory:
      condition: selection1 or (selection2 and not selection3 and not filter_null)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
