title: Octopus Scanner Malware
id: 5d752d6d-04dc-4090-a52b-cca2a8b3460a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1195.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1195/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_mal_octopus_scanner.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1195.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|endswith:
              - '\AppData\Local\Microsoft\Cache134.dat'
              - '\AppData\Local\Microsoft\ExplorerSync.db'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
