title: Failed Logon From Public IP
id: ed530ff8-c239-471d-9b49-5bd9fd3ce5f7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1190.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_failed_logon_source.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1190
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 4625
      filter_main_ip_unknown:
          IpAddress|contains: '-'
      filter_main_local_ranges:
          IpAddress|cidr:
              - '::1/128'  # IPv6 loopback
              - '10.0.0.0/8'
              - '127.0.0.0/8'
              - '172.16.0.0/12'
              - '192.168.0.0/16'
              - '169.254.0.0/16'
              - 'fc00::/7'  # IPv6 private addresses
              - 'fe80::/10'  # IPv6 link-local addresses
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
