title: USB Device Plugged
id: 26853dfb-def6-40b7-bc65-3c64d057bb6a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1200.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1200/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/driverframeworks/win_usb_device_plugged.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1200
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 2003  # Loading drivers
              - 2100  # Pnp or power management
              - 2102  # Pnp or power management
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
