title: Suspicious ClickFix/FileFix Execution Pattern
id: 713103f7-0e27-4cc9-b730-1f05890351c4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1204/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_clickfix_filefix_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1204.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_parent:
          ParentImage|endswith: '\explorer.exe'
          CommandLine|contains: '#'
      selection_cli_captcha:
          CommandLine|contains:
              - 'account'
              - 'anti-bot'
              - 'botcheck'
              - 'captcha'
              - 'challenge'
              - 'confirmation'
              - 'fraud'
              - 'human'
              - 'identification'
              - 'identificator'
              - 'identity'
              - 'robot'
              - 'validation'
              - 'verification'
              - 'verify'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
