title: Kerberoasting spn request with RC4 encryption
id: 11944754-e637-4060-a3e4-3bb725a16c9f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1208.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1208/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/kerberoasting_spn_request_with_rc4_encryption.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1208
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '4769'
    TicketOptions:
      - '0x40810000'
      - '0x40800000'
      - '0x40810010)'
    TicketEncryptionType: '0x17'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
