title: Add or Remove Computer from DC
id: 7ddb8b80-5178-4e71-9cf2-80a6ed03f8bb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1207.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1207/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_add_remove_computer.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1207
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 4741
              - 4743
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
