title: Suspicious Deno File Written from Remote Source
id: 2b33ab20-2e62-46c0-97f8-bbd631d83bae
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1204/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_creation_deno.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1204
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_path:
          TargetFilename|contains:
              - '\deno\gen\'
              - '\deno\remote\https\'
          TargetFilename|contains|all:
              - ':\Users\'
              - '\AppData\'
      condition: selection_path
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
