title: MSI Installation From Web
id: 685c27fb-1279-4427-b962-967560151084
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/msiinstaller/win_msi_install_from_web.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.007
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Provider_Name: 'MsiInstaller'
          EventID:
              - 1040
              - 1042
          Data|contains: '://'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
