title: Remote Thread Creation Via PowerShell In Uncommon Target
id: fe418b8b-e20d-498a-a6cd-faa99c45d1d2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.011.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_powershell_susp_targets.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.011
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          SourceImage|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
          TargetImage|endswith:
              # Note: Please add additional potential interesting targets to increase coverage
              - '\rundll32.exe'
              - '\regsvr32.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
