title: Audit CVE Event
id: 8af8274f-90e7-4a93-b476-c28731093778
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1212.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1212/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1212
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Provider_Name:
              - 'Microsoft-Windows-Audit-CVE'
              - 'Audit-CVE'
          EventID: 1
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
