title: RegAsm.EXE Initiating Network Connection To Public IP
id: 08668de0-479f-4633-9284-c694f3473d43
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_regasm_network_activity.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.009
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Initiated: 'true'
          Image|endswith: '\regasm.exe'
      filter_main_local_ranges:
          DestinationIp|cidr:
              - '127.0.0.0/8'
              - '10.0.0.0/8'
              - '172.16.0.0/12'
              - '192.168.0.0/16'
              - '169.254.0.0/16'
              - '::1/128'  # IPv6 loopback
              - 'fe80::/10'  # IPv6 link-local addresses
              - 'fc00::/7'  # IPv6 private addresses
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
