title: Delayed Execution via Ping
id: e356a746-6cf0-4769-b232-d36e3855eae6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1497.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1497/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_delayed_via_ping_lolbas_unsigned.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1497.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name:
      - 'ping.exe'
      - 'rundll32.exe'
      - 'RegAsm.exe'
      - 'openssl.exe'
      - 'certutil.exe'
      - 'powershell.exe'
      - 'wscript.exe'
      - 'regsvr32.exe'
      - 'wscript.exe'
    process.args:
      - '-n'
      - '?:\\Program Files\\*'
      - '?:\\Program Files (x86)\\*'
      - 'Write-Host ======*'
      - 'launchquiet_args.vbs'
      - '?:\\windows\\syswow64\\msxml?.dll'
      - '?:\\Windows\\SysWOW64\\mschrt20.ocx'
    process.parent.name:
      - 'cmd.exe'
      - 'cmd.exe'
    user.id: 'S-1-5-18'
    process.executable: '?:\\Users\\*\\AppData\\*.exe'
    process.parent.command_line: '*ScreenConnectConfigurator.cmd*'
    process.pe.original_file_name: 'DPInst.exe'
    process.command_line: 'driver\\DPInst_x64  /f '
    process.parent.args: '?:\\Windows\\TempInst\\7z*'
    process.working_directory:
      - '?:\\Windows\\TempInst\\*'
      - '?:\\Users\\*\\AppData\\Local\\Temp\\QBTools\\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
