title: MSExchange Transport Agent Installation - Builtin
id: 601f020c-93d0-4c34-bd9c-4f04ca260616
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1505/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/msexchange/win_exchange_transportagent.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1505.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          - 'Install-TransportAgent'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
