title: HackTool - WinPwn Execution - ScriptBlock
id: 26023562-c8d4-471b-94cd-99956d09eeab
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1518.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1518/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_hktl_winpwn.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1518
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains:
              - 'Offline_Winpwn'
              - 'WinPwn '
              - 'WinPwn.exe'
              - 'WinPwn.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
