title: User Logoff Event
id: 93508f5a-9a36-49ed-9fcb-e1673c2d1ddc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1531.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1531/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_user_logoff.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 4634
              - 4647
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
