title: Linux File Created In Kernel Driver Directory
id: 2f5611c7-26fa-4c9c-84c8-db4c7980ad10
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.006.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1547/006/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_file_created_in_kernel_driver_directory.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1547.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Filesystem'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
