title: Suspicious PlistBuddy Usage
id: 63f1f432-8edc-4cbb-a2ba-0cfc73a57803
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1543.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1543/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/suspicious_plistbuddy_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1543.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'PlistBuddy'
    process:
      - '*LaunchAgents*'
      - '*RunAtLoad*'
      - '*true*)'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
