title: Persistence via PowerShell profile
id: 04f1eea7-2cdb-4b78-ba00-37f58c7d956c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.013.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_powershell_profiles.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546.013
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.name:
      - 'profile.ps1'
      - 'Microsoft.Powershell_profile.ps1'
    file.path:
      - '?:\\Users\\*\\Documents\\WindowsPowerShell\\*.ps1'
      - '\\Device\\HarddiskVolume*\\Windows\\System32\\WindowsPowerShell\\*.ps1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
