title: Suspicious Autorun Registry Modified via WMI
id: a60bf618-ccc8-4f36-bef0-15e6bdd16168
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_autorun_registry_modified_via_wmic.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_execution_img:
          - Image|endswith: '\wmic.exe'
          - OriginalFileName: 'wmic.exe' # wmic process call create 'reg.exe add HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run /v Desktops /t REG_SZ /d "\"C:\Users\user\AppData\Roaming\Microsoft\tre\Desktops.exe\" random" /f'
          - ParentImage|endswith: '\wmiprvse.exe'
      selection_execution_cmd:
          CommandLine|contains|all:
              - 'reg'
              - ' add '
          CommandLine|contains:
              - '\Software\Microsoft\Windows\CurrentVersion\Run'
              - '\Software\WOW6432Node\Microsoft\Windows\CurrentVersion\Run'
              - '\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
      selection_suspicious_paths_1:
          CommandLine|contains:
              - ':\Perflogs'
              - :\ProgramData'
              - ':\Windows\Temp'
              - ':\Temp'
              - '\AppData\Local\Temp'
              - '\AppData\Roaming'
              - ':\$Recycle.bin'
              - ':\Users\Default'
              - ':\Users\public'
              - '%temp%'
              - '%tmp%'
              - '%Public%'
              - '%AppData%'
      selection_suspicious_paths_user_1:
          CommandLine|contains: ':\Users\'
      selection_suspicious_paths_user_2:
          CommandLine|contains:
              - '\Favorites'
              - '\Favourites'
              - '\Contacts'
              - '\Music'
              - '\Pictures'
              - '\Documents'
              - '\Photos'
      condition: all of selection_execution_* and (selection_suspicious_paths_1 or (all of selection_suspicious_paths_user_*))
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
