title: Potential Persistence via Time Provider Modification
id: 43b2e221-17c1-4b9f-b086-a348e82f0224
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1547/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_time_provider_mod.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1547.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.path: '*\\SYSTEM\\*ControlSet*\\Services\\W32Time\\TimeProviders\\*'
    registry.data.strings:
      - '*.dll'
      - '?:\\Program Files\\VMware\\VMware Tools\\vmwTimeProvider\\vmwTimeProvider.dll'
      - 'C:\\Windows\\SYSTEM32\\w32time.DLL'
    process.executable:
      - '?:\\Windows\\System32\\msiexec.exe'
      - '\\Device\\HarddiskVolume*\\Windows\\System32\\msiexec.exe'
    C: '\\Windows\\SYSTEM32\\w32time.DLL'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
