title: Rundll32 Registered COM Objects
id: d60e5ba5-3325-44c8-bae3-3dc2dc42fc85
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.015.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/015/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_registered_com_objects.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.015
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\rundll32.exe'
          - OriginalFileName: 'RUNDLL32.EXE'
      selection_cli:
          CommandLine|contains:
              - '-sta '
              - '-localserver '
          CommandLine|contains|all:
              - '{'
              - '}'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
