title: Potential Persistence Via Netsh Helper DLL
id: df0f6282-f1a2-4081-9b01-6be9054f6d08
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_helper_dll_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.007
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          - OriginalFileName: 'netsh.exe'
          - Image|endswith: '\netsh.exe'
      selection_cli:
          CommandLine|contains|all:
              - 'add'
              - 'helper'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
