title: Linux Change File Owner To Root
id: 816a66c3-e926-45aa-9961-ce2353f058c7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1548/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_change_file_owner_to_root.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1548.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'chown'
    process:
      - '*chown'
      - '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
