title: UAC Bypass Using Consent and Comctl32 - File
id: 59425f64-5ede-4d25-90be-4722eda45238
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_uac_bypass_consent_comctl32.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|startswith: 'C:\Windows\System32\consent.exe.@'
          TargetFilename|endswith: '\comctl32.dll'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
