title: New TimeProviders Registered With Uncommon DLL Name
id: ae99e8f9-96bc-4555-aa0c-e159df96c917
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_timeproviders_dllname.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetObject|contains: '\Services\W32Time\TimeProviders'
          TargetObject|endswith: '\DllName'
      filter_main_w32time:
          Details:
              - '%SystemRoot%\System32\vmictimeprovider.dll'
              - '%systemroot%\system32\w32time.dll'
              - 'C:\Windows\SYSTEM32\w32time.DLL'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
