title: Suspicious Screensaver Binary File Creation
id: e94ab6f7-efa8-4400-8d9f-2c5e3d8e464b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_creation_scr_binary_file.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|endswith: '.scr'
      filter_generic:
          Image|endswith:
              - '\Kindle.exe'
              - '\Bin\ccSvcHst.exe' # Symantec Endpoint Protection
      filter_tiworker:
          # ParentCommandLine: C:\WINDOWS\system32\svchost.exe -k DcomLaunch -p
          Image|endswith: '\TiWorker.exe'
          TargetFilename|endswith: '\uwfservicingscr.scr'
      condition: selection and not 1 of filter_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
