title: New Outlook Macro Created
id: f18250e6-3cc9-4742-8da6-a52e336f18ef
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_office_outlook_macro_creation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Image|endswith: '\outlook.exe'
          TargetFilename|endswith: '\Microsoft\Outlook\VbaProject.OTM'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
