title: Windows Network Access Suspicious desktop.ini Action
id: 06c79912-29f3-4abe-9602-e58fee0f8b1a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_net_share_obj_susp_desktop_ini.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.009
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 5145
          ObjectType: File
          RelativeTargetName|endswith: '\desktop.ini'
          AccessList|contains:
              - 'WriteData'
              - 'DELETE'
              - 'WriteDAC'
              - 'AppendData'
              - 'AddSubdirectory'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
