title: Windows Terminal Profile Settings Modification By Uncommon Process
id: 88f76357-93b8-43c5-b2c3-d1527a9c06de
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.015.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/015/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_windows_terminal_profile.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.015
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Image|endswith:
              # Note: Add other potential common applications
              - '\cmd.exe'
              - '\cscript.exe'
              - '\mshta.exe'
              - '\powershell.exe'
              - '\pwsh.exe'
              - '\wscript.exe'
          TargetFilename|endswith: '\AppData\Local\Packages\Microsoft.WindowsTerminal_8wekyb3d8bbwe\LocalState\settings.json'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
