title: New DLL Added to AppCertDlls Registry Key
id: 395be9b6-2839-44a6-977f-26bd0b37ee09
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_event/registry_event_new_dll_added_to_appcertdlls_registry_key.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.009
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          # Sysmon gives us HKLM\SYSTEM\CurrentControlSet\.. if ControlSetXX is the selected one
          - TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\AppCertDlls'
          # key rename
          - NewName: 'HKLM\SYSTEM\CurentControlSet\Control\Session Manager\AppCertDlls'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
