title: Active Directory Certificate Services Denied Certificate Enrollment Request
id: 274cff84-9ba6-4e96-a76b-c39385386594
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/system/microsoft_windows_certification_authority/win_system_adcs_enrollment_request_denied.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Provider_Name: 'Microsoft-Windows-CertificationAuthority'
          EventID: 53
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
