title: Access To Windows Credential History File By Uncommon Applications
id: 41d5753c-0518-42a9-8f34-dbae4b0502fd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_access/file_access_win_susp_credhist.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          FileName|endswith: '\Microsoft\Protect\CREDHIST'
      filter_main_system_folders:
          Image|startswith:
              - 'C:\Program Files\'
              - 'C:\Program Files (x86)\'
              - 'C:\Windows\system32\'
              - 'C:\Windows\SysWOW64\'
      filter_main_explorer:
          Image: 'C:\Windows\explorer.exe'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
