title: Remote Thread Created In KeePass.EXE
id: 2bb5dbb5-551c-4240-a557-1d058291e7fb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_keepass.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555.005
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetImage|endswith: '\KeePass.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
