title: SIP Provider Modification
id: 54ece3a3-da54-409b-bb93-87a39e1c869a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1553/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_sip_provider_mod.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1553.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.value:
      - 'Dll'
      - '$Dll'
    registry.path:
      - '*\\SOFTWARE\\Microsoft\\Cryptography\\OID\\EncodingType 0\\CryptSIPDllPutSignedDataMsg\\{*}\\Dll'
      - '*\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\Providers\\Trust\\FinalPolicy\\{*}\\$Dll'
    registry.data.strings:
      - '*.dll'
      - 'mso.dll'
    process.name:
      - 'msiexec.exe'
      - 'regsvr32.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
