title: Code Signing Policy Modification Through Built-in tools
id: 8676869d-516f-4c60-9d7f-db4e6018ef27
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1553/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_code_signing_policy_modification_builtin_tools.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1553.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name: 'bcdedit.exe'
    process.args:
      - '-set'
      - '/set'
      - 'TESTSIGNING'
      - 'DISABLE_INTEGRITY_CHECKS'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
