title: Potential Secure Deletion with SDelete
id: 520813d6-3508-4cd0-b2c8-654ca72be5e6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_sdelete_potential_secure_deletion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 4656
              - 4663
              - 4658
          ObjectName|endswith:
              - '.AAA'
              - '.ZZZ'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
