title: Enable Microsoft Dynamic Data Exchange
id: 3b6d60e3-fa2a-46d0-90cb-d40a99838b5a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1559.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1559/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_office_enable_dde.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1559.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_word:
          TargetObject|endswith: '\Word\Security\AllowDDE'
          Details:
              - 'DWORD (0x00000001)'
              - 'DWORD (0x00000002)'
      selection_excel:
          TargetObject|endswith:
              - '\Excel\Security\DisableDDEServerLaunch'
              - '\Excel\Security\DisableDDEServerLookup'
          Details: 'DWORD (0x00000000)'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
