title: Dropping Of Password Filter DLL
id: fde1144c-ec6e-4be3-811a-61d161609229
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1556/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_credential_access_via_password_filter.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1556.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_cmdline:
          CommandLine|contains|all:
              - 'HKLM\SYSTEM\CurrentControlSet\Control\Lsa'
              - 'scecli\0*'
              - 'reg add'
      condition: selection_cmdline
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
