title: HackTool - WinPwn Execution
id: bac7c9a9-2514-4675-a393-b837bfa34612
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_winpwn.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          CommandLine|contains:
              - 'Offline_Winpwn'
              - 'WinPwn '
              - 'WinPwn.exe'
              - 'WinPwn.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
