title: Kerberos Service Ticket Request Using RC4 Encryption
id: a4a5f0e4-b721-477c-8150-71f77e8d1592
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1558.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1558/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/kerberos_service_ticket_request_using_rc4_encryption.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1558.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '4769'
    ServiceName: '*$'
    TicketOptions:
      - '0x40810000'
      - '0x40800000'
      - '0x40810010)'
    TicketEncryptionType: '0x17'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
