title: NTLM Logon
id: 11804819-7f5f-4181-b207-be5048a82b22
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1550/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/ntlm/win_susp_ntlm_auth.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1550.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 8002
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
