title: Windows AppX Deployment Full Trust Package Installation
id: 61104cf5-a23b-4995-8daa-2d421a3abc99
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/appxdeployment_server/win_appxpackaging_server_full_trust_package_installation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.005
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 400
          HasFullTrust: true
      filter_main_legitpath:
          PackageSourceUri|startswith:
              - 'file:///C:/Program%20Files/'
              - 'file:///C:/Program%20Files%20(x86)/'
      filter_main_microsoft:
          - PackageSourceUri|startswith: 'https://go.microsoft.com/fwlink/?linkid'
          - PackageSourceUri|contains:
                - '.cdn.microsoft.com'
                - '.cdn.office.net/'
      filter_main_callerprocess:
          CallingProcess|startswith:
              - 'sysprep.exe'
              - 'svchost.exe,AppReadiness'
      filter_optional_x_update:
          PackageSourceUri|startswith: 'x-windowsupdate://'
      filter_optional_microsoftclient:
          PackageFullName|startswith: 'MicrosoftWindows.Client.'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
