title: DPAPI Backup Keys And Certificate Export Activity IOC
id: f3239661-f2ca-4718-a0b3-3f642ee695c4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_dpapi_backup_and_cert_export_ioc.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          TargetFilename|contains:
              - 'ntds_capi_'
              - 'ntds_legacy_'
              - 'ntds_unknown_'
          TargetFilename|endswith:
              - '.cer'
              - '.key'
              - '.pfx'
              - '.pvk'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
