title: ETW Logging/Processing Option Disabled On IIS Server
id: 550b2256-b5af-4c9d-9ce5-9f38c30aa355
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/iis-configuration/win_iis_logging_etw_disabled.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID: 29
          Configuration|endswith: '@logTargetW3C'
          OldValue|contains: 'ETW'
      filter_main_etw_added:
          NewValue|contains: 'ETW'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
