title: Hidden Executable In NTFS Alternate Data Stream
id: 53958986-a5fb-4c65-b21a-21434e80a7be
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_stream_hash/create_stream_hash_ads_executable.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.004
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          Hash|contains: 'IMPHASH='
      filter_main_null:
          Hash|contains: 'IMPHASH=00000000000000000000000000000000'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
