title: LSA PPL Protection Disabled Via Reg.EXE
id: 77755151-2d99-4869-a318-16f85804791b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.010.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/010/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_lsa_ppl_protection_disabled.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.010
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\reg.exe'
          - OriginalFileName: 'reg.exe'
      selection_cli:
          CommandLine|contains: 'SYSTEM\CurrentControlSet\Control\Lsa'
          CommandLine|contains|all:
              - ' add '
              - ' /d 0'
              - ' /v RunAsPPL '
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
