title: Disable of ETW Trace - Powershell
id: b197f072-0f47-4d91-9b94-afe615d6817e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_etw_trace_evasion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_pwsh_remove:   # Autologger provider removal
          ScriptBlockText|contains: 'Remove-EtwTraceProvider '
      selection_pwsh_set:   # Provider “Enable” property modification
          ScriptBlockText|contains|all:
              - 'Set-EtwTraceProvider '
              - '0x11'
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
