title: Virtualbox Driver Installation or Starting of VMs
id: a78a7f1d-bd10-485f-bd22-6702c3c77c54
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_virtualbox_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.006
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_1:
          CommandLine|contains:
              - 'VBoxRT.dll,RTR3Init'
              - 'VBoxC.dll'
              - 'VBoxDrv.sys'
      selection_2:
          CommandLine|contains:
              - 'startvm'
              - 'controlvm'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
