title: Allow File And Printing Sharing In Firewall
id: 2638488e-78e4-4eb7-b115-a2eee05e8665
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.007.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1562/007/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/allow_file_and_printing_sharing_in_firewall.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1562.007
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process:
      - '*firewall*'
      - '*group=\'
      - '*enable=Yes*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
