title: Communication To Ngrok Tunneling Service Initiated
id: a03991d6-a335-4988-a778-37393464181c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1568.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1568/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_domain_ngrok_tunnel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1568.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          DestinationHostname|contains:
              - 'tunnel.us.ngrok.com'
              - 'tunnel.eu.ngrok.com'
              - 'tunnel.ap.ngrok.com'
              - 'tunnel.au.ngrok.com'
              - 'tunnel.sa.ngrok.com'
              - 'tunnel.jp.ngrok.com'
              - 'tunnel.in.ngrok.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
