title: Cloudflared Tunnels Related DNS Requests
id: cb749e36-e681-412a-9aef-cc8b54d5ffb0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1572.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1572/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_cloudflared_communication.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1572
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          QueryName|endswith:
              - '.v2.argotunnel.com'
              - 'protocol-v2.argotunnel.com'
              - 'trycloudflare.com'
              - 'update.argotunnel.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
