title: MSI Module Loaded by Non-System Binary
id: bd6c0eb4-c64a-4d48-98ad-b43aaa41362c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1574/002/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/msi_module_loaded_by_non_system_binary.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1574.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '7'
    ImageLoaded: '*\\msi.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
