title: DNS Server Error Failed Loading the ServerLevelPluginDLL
id: ea52d43d-043b-4d6f-bf80-7686fdb84622
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/dns_server/win_dns_server_susp_server_level_plugin_dll.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          EventID:
              - 150
              - 770
              - 771
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
