title: Suspicious SSL Connection
id: be55ad63-3c61-488b-a6bb-42bd99009553
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1573.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_ssl_keyword.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1573
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - System.Net.Security.SslStream
              - Net.Security.RemoteCertificateValidationCallback
              - '.AuthenticateAsClient'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
