title: HackTool - PurpleSharp Execution
id: d400f833-b8f0-4509-9d65-30f1f1678d8e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1587.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1587/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_purplesharp_indicators.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1587
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection_img:
          - Image|contains: '\purplesharp'
          - OriginalFileName: 'PurpleSharp.exe'
      selection_cli:
          CommandLine|contains:
              - 'xyz123456.exe'
              - 'PurpleSharp'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
