title: Windows Certutil Root Certificate Addition
id: 0295ae24-cfa6-4f11-af54-93ea75b76ed0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1587.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1587/003/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_certutil_root_certificate_addition.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1587.003
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process:
      - '*-addstore*'
      - '*root*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
