title: Windows Gather Victim Host Information Camera
id: a6993d2c-ac00-4434-a44e-200a0e74a9ac
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1592.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1592/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_gather_victim_host_information_camera.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1592.001
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '4104'
    ScriptBlockText:
      - '*'
      - '*SELECT*'
      - '*WHERE*'
      - '*PNPClass*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
