title: Local LLM Framework DNS Query
id: 02910ad6-39fd-4c6b-a6ea-f219ff7f5db7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1590.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1590/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/local_llm_framework_dns_query.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1590
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventCode: '22'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
