title: Windows Detect Network Scanner Behavior
id: aea046bd-c449-4972-a3ea-469993bc4855
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1595/002/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_detect_network_scanner_behavior.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1595.002
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    datamodel: 'Network_Traffic.All_Traffic'
    sourcetype: 'XmlWinEventLog'
    app: '*\\*'
    span: '5m'
    field: 'app'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
