title: Cisco Isovalent - Potential Escape to Host
id: aaa3751a-4f01-4287-bf9a-f312626d268d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1611.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1611/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cisco_isovalent___potential_escape_to_host.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1611
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    span: '5m'
    duration_s: 'round(lastTime'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
