title: Potential In-Memory Execution Using Reflection.Assembly
id: 835d6a09-c5d4-4062-80c9-a0bd3c7c203d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1620.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1620/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_dotnet_assembly_from_file.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1620
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains: '[Reflection.Assembly]::load'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
