title: Rootkit - COOSEA (defender)
id: c9291f66-eb64-4b92-a001-edcda29826ae
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1014 (Rootkit).
  Associated threat actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1014
  - actor.coosea
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
