title: Input Capture - COOSEA (defender)
id: 9bb6c698-d528-4730-9a43-fe14f7e62b47
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1056 (Input Capture).
  Associated threat actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1056/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_keylogger.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1056
  - actor.coosea
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
    powershell.file.script_block_text|contains: 'sentinelbreakpoints'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
