title: Clipboard Data - COOSEA (defender)
id: 57f60368-f924-41f4-b6b1-3eb308d11abd
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1115 (Clipboard Data).
  Associated threat actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_clipboard_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1115
  - actor.coosea
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Set-Alias -Name \'
    user.id|contains: 'S-1-5-18'
    file.name|contains: 'Convert-ExcelRangeToImage.ps1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
