title: Non-Standard Port - COOSEA (defender)
id: 670bd772-6174-4046-a109-af5c91efbb6f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1571 (Non-Standard Port).
  Associated threat actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1571/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_linux_port_knocking_reverse_connection.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1571
  - actor.coosea
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'python*'
      - 'ksh'
    process.executable|contains:
      - '/usr/bin/*'
      - '/bin/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
