title: T1486 (M365 - entra_id)
id: 7b3ad15d-c9b8-4259-8064-3c6f54852966
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1486.
  Threat Actor: Nefilim
references:
  - https://attack.mitre.org/techniques/T1486/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1486
  - actor.nefilim
