title: Azure Kubernetes Admission Controller
id: 751b6f1d-751b-451b-a51b-751b6f1d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1078
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_kubernetes_admission_controller.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1078
logsource:
  product: azure
  service: activity_logs
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         operationName|startswith:
    #             - 'MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/ADMISSIONREGISTRATION.K8S.IO'
    #             - 'MICROSOFT.CONTAINERSERVICE/MANAGEDCLUSTERS/ADMISSIONREGISTRATION.K8S.IO'
    #         operationName|endswith:
    #             - '/MUTATINGWEBHOOKCONFIGURATIONS/WRITE'
    #             - '/VALIDATINGWEBHOOKCONFIGURATIONS/WRITE'
    #     condition: selection
    # 
  condition: selection
level: medium
