title: Network Connection Initiated To AzureWebsites.NET By Non-Browser Process
id: 15b21fac-15b2-45b2-a5b2-15b21fac0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1102.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_domain_azurewebsites.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1102.001
logsource:
  product: azure
  service: activity_logs
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Initiated: 'true'
    #         DestinationHostname|endswith: 'azurewebsites.net'
    #     # Note: Add/Remove browsers/applications that you don't use or those that have custom install locations
    #     # Note: To avoid complex conditions the filters for some apps are generic by name only. A custom tuning is recommended for best results
    #     filter_main_chrome:
    #         Image:
    #             - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
    #             - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
    #     filter_main_chrome_appdata:
    #         Image|startswith: 'C:\Users\'
    #         Image|endswith: '\AppData\Local\Google\Chrome\Application\chrome.exe'
    #     filter_main_firefox:
    #         Image:
    #             - 'C:\Program Files\Mozilla Firefox\firefox.exe'
    #             - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
    #     filter_main_firefox_appdata:
    #         Image|startswith: 'C:\Users\'
    #         Image|endswith: '\AppData\Local\Mozilla Firefox\firefox.exe'
    #     filter_main_ie:
    #         Image:
    #             - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
    #             - 'C:\Program Files\Internet Explorer\iexplore.exe'
    #     filter_main_edge_1:
    #         - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
    #         - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
    #         - Image:
    #               - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
    #               - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
    #     filter_main_edge_2:
    #         Image|startswith:
    #             - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
    #             - 'C:\Program Files\Microsoft\EdgeCore\'
    #         Image|endswith:
    #             - '\msedge.exe'
    #             - '\msedgewebview2.exe'
    #     filter_main_safari:
    #         Image|contains:
    #             - 'C:\Program Files (x86)\Safari\'
    #             - 'C:\Program Files\Safari\'
    #         Image|endswith: '\safari.exe'
    #     filter_main_defender:
    #         Image|contains:
    #             - 'C:\Program Fil
    # ... [truncated]
  condition: selection
level: medium
