title: High Number of Login Failures from a single source
id: 52b97f87-52b9-42b9-a2b9-52b97f870000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/high_number_of_login_failures_from_a_single_source.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1110.001
logsource:
  product: azure
  service: activity_logs
detection:
  selection:
    # Original splunk detection logic
    # `o365_management_activity` Workload=AzureActiveDirectory Operation=UserLoginFailed
    #   record_type=AzureActiveDirectoryStsLogon 
    #   | bucket span=5m _time 
    #   | stats dc(_raw) AS failed_attempts values(user) as user values(LogonError) as LogonError values(signature)
    #   as signature values(UserAgent) as UserAgent values(dest) as dest values(vendor_account) as vendor_account values(vendor_product) as vendor_product 
    #   by _time, src_ip 
    #   | where failed_attempts > 10 
    #   | `high_number_of_login_failures_from_a_single_source_filter`
  condition: selection
level: medium
