title: Azure Automation Account Created
id: 719edfdc-719e-419e-a19e-719edfdc0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1136.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_automation_account_created.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1136.003
logsource:
  product: azure
  service: activity_logs
detection:
  selection:
    # Original splunk detection logic
    # `azure_audit` operationName.value="Microsoft.Automation/automationAccounts/write" status.value=Succeeded 
    #   | dedup object 
    #   | rename claims.ipaddr as src, subscriptionId as vendor_account, operationName.value as signature
    #   | stats count min(_time) as firstTime max(_time) as lastTime by dest user src vendor_account vendor_product object object_path signature
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `azure_automation_account_created_filter`
  condition: selection
level: medium
