title: Spike in Azure Activity Logs Failed Messages
id: 677747e8-6777-4777-a777-677747e80000
status: stable
description: Detection rule for MITRE ATT&CK technique T1580
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/ml_azure_event_failures.toml
author: elastic (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1580
logsource:
  product: azure
  service: activity_logs
detection:
  selection:
    # Original elastic detection logic
    # No detection logic available
  condition: selection
level: medium
