title: Exploit Public-Facing Application (WINDOWS - sysmon)
id: 11e56392-751f-4578-be89-2093e2ca28be
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: Volatile Cedar
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\ScreenConnect.Service.exe'
    Image|endswith|contains:
      - '\rdpclip.exe'
      - ':\Windows\System32\csrss.exe'
      - ':\Windows\System32\wininit.exe'
    ParentCommandLine|contains|all|contains:
      - '\svchost.exe'
      - 'termsvcs'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.volatile_cedar
