title: Process Injection (M365 - entra_id)
id: a65ab4f7-d8cb-444c-ac0f-6342b72a759f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.
  Threat Actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1055/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055
  - actor.bqtlock
