title: Steganography (WINDOWS - security)
id: 0f1af8f5-fd60-40d5-93a9-b4b19a8ec5de
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.qilin
