title: Binary Padding (WINDOWS - security)
id: a01dc3eb-87f7-4a93-a082-89c4fb6dc397
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.001.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    param1|contains|contains:
      - '\CSFalconServiceUninstallTool_'
      - '\Program Files\CrowdStrike\'
      - '\Windows\System32\ScriptControl64_'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.001
  - actor.qilin
