title: Data from Network Shared Drive (WINDOWS - security)
id: 7341df8f-50fe-4f2f-99a4-38d09dcfa7f9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1039.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1039/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    RelativeTargetName|endswith|contains:
      - '.bak'
      - '.dmp'
      - '.edb'
    CommandLine|contains|contains:
      - '\\\\*\\*$'
      - '\Sysvol\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1039
  - actor.qilin
