title: At (WINDOWS - security)
id: d8b1bb73-8fd8-4365-bbdd-7758e93d2916
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.002.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1053.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\IPC$'
    Image|endswith|contains:
      - '\at.exe'
    CommandLine|contains|contains:
      - 'interactive'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.002
  - actor.qilin
