title: Visual Basic (WINDOWS - security)
id: 44aa39be-cb28-4da4-b17c-00352a1bcad2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.005.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1059.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cscript.exe'
      - '\excel.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.005
  - actor.qilin
