title: Security Software Discovery (WINDOWS - security)
id: 4c652afc-efd6-4a6f-9634-5c67a7958c24
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.qilin
