title: Windows Defender ASR Audit Events
id: 66847f7a-6684-4684-a684-66847f7a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1566.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_defender_asr_audit_events.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: defender
  service: xdr
detection:
  selection:
    # Original splunk detection logic
    # `ms_defender` EventCode IN (1122, 1125, 1126, 1132, 1134) | stats count min(_time)
    #   as firstTime max(_time) as lastTime by host, Process_Name, Target_Commandline, Path,
    #   ID, EventCode | lookup asr_rules ID OUTPUT ASR_Rule | fillnull value=NULL | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`| rename host as dest | `windows_defender_asr_audit_events_filter`
  condition: selection
level: medium
