title: Exploit Public-Facing Application (LINUX - auditd)
id: 6a184d0b-8b07-4828-9fbe-769774c74c12
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    User|contains:
      - 'root'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.blacksuit
