title: Obfuscated Files or Information (MACOS - unified_logging)
id: 197d3b3e-06c1-4d89-85d0-17979e067ba6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/usr/bin/base64'
    CommandLine|contains|contains:
      - '-d'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.hive
