title: Exploitation for Client Execution (LINUX - auditd)
id: 950c0252-8c36-4bcd-bf84-58bb941ccecf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
  Threat Actor: Andariel
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
  - actor.andariel
