title: Scheduled Task - Cactus Ransomware (defender)
id: 224a7f90-dceb-4918-a486-24af9dd000fe
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053.005 (Scheduled Task).
  Associated threat actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1053/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_scheduled_task_powershell_source.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053.005
  - actor.cactus_ransomware
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.action|contains: 'Image loaded*'
    dll.name|contains: 'taskschd.dll'
    file.name|contains: 'taskschd.dll'
    process.name|contains:
      - 'powershell.exe'
      - 'powershell_ise.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
