title: PowerShell (WINDOWS)
id: fe824bea-1e22-49fb-ae7f-aa2ed99e5cd8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'powershell.exe'
      - 'pwsh.exe'
      - 'cmd.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
