title: Input Capture (WINDOWS - defender)
id: 98dabec6-dd0f-4a26-abe1-4de7965942e7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1056.
  Threat Actor: KageNoHitobito
references:
  - https://attack.mitre.org/techniques/T1056/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1056
  - actor.kagenohitobito
