title: Local Storage Discovery (M365 - entra_id)
id: baff38ca-637c-4479-9675-e53b3ec55c8d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1680.
  Threat Actor: Patchwork
references:
  - https://attack.mitre.org/techniques/T1680/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1680
  - actor.patchwork
