title: Rootkit (LINUX - auditd)
id: e5a96c27-2dc6-4b6f-8a2b-44b0d68be5ce
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1014.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1014/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/sudo'
    CommandLine|contains|all|contains:
      - ' tc '
      - ' enp0s3 '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1014
  - actor.apt28
