title: Hidden Window (LINUX - auditd)
id: c212cd27-4499-4843-8424-b87acc544d9c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.003.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1564.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.003
  - actor.apt28
