title: DCSync (WINDOWS - security)
id: 968e9f51-937e-44b7-9db3-054c15cbac57
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.006.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    AccessMask|contains:
      - '0x100'
    Properties|contains|contains:
      - 'Replicating Directory Changes All'
      - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
      - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.006
  - actor.ignoble_scorpius
