title: Masquerading (WINDOWS - security)
id: e96d8328-c3eb-4785-abaf-37aa4411ea3a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1036/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|contains:
      - '$'
    TargetName|contains|contains:
      - 'Microsoft_Windows_Shell_ZipFolder:filename'
    CommandLine|contains|contains:
      - '\calc.exe '
    Image|endswith|contains:
      - '\calc.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036
  - actor.ignoble_scorpius
