title: Hide Artifacts (WINDOWS - security)
id: bed1cf92-65e2-484e-a1ee-6a566856aa2c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.ignoble_scorpius
