title: Dynamic Linker Hijacking (LINUX - auditd)
id: f00c55cd-16a7-4e5e-ac9e-337da1965284
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.006.
  Threat Actor: Aquatic Panda
references:
  - https://attack.mitre.org/techniques/T1574.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains:
      - '/etc/ld.so.preload'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.006
  - actor.aquatic_panda
