title: System Shutdown/Reboot (MACOS - unified_logging)
id: 1ebdc262-132e-4b30-bb5c-c70e7e38f07a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1529.
  Threat Actor: Trigona
references:
  - https://attack.mitre.org/techniques/T1529/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/shutdown'
      - '/reboot'
      - '/halt'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1529
  - actor.trigona
