title: Registry Run Keys / Startup Folder (MACOS - unified_logging)
id: b994df6a-dfa3-416a-a6c2-b14974ca6de9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.001.
  Threat Actor: Trigona
references:
  - https://attack.mitre.org/techniques/T1547.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.001
  - actor.trigona
