title: Indirect Command Execution - Spectra (defender)
id: a29639d5-52db-4cb5-8842-150039b43c05
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1202 (Indirect Command Execution).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_indirect_exec_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1202
  - actor.spectra
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'conhost.exe'
    process.args|contains: '--headless'
    process.command_line|contains:
      - '*powershell*'
      - '*mhsta*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
