title: SMB/Windows Admin Shares (WINDOWS - defender)
id: 0c04888f-e4d3-4434-a188-65bcff17f3d0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.002.
  Threat Actor: Threat Group-1314
references:
  - https://attack.mitre.org/techniques/T1021.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'computername='
    CommandLine|contains|all|contains:
      - ' use '
      - ' http'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.002
  - actor.threat_group-1314
