title: System Service Discovery - Shinra (auditd)
id: c319e87e-4330-4c1c-b327-026a25218abe
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1007 (System Service Discovery).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1007
  - actor.shinra
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains: '/crontab'
    cmd|contains: ' -l'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
