title: Network Share Discovery (WINDOWS - security)
id: 7f061f4e-61ce-41a0-824f-aa41aedb4753
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1135.
  Threat Actor: 3AM
references:
  - https://attack.mitre.org/techniques/T1135/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cmd.exe'
      - '\powershell.exe'
      - '\pwsh.exe'
    Image|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|all|contains:
      - '/portable'
      - '/lng'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1135
  - actor.3am
