title: Create Account (WINDOWS)
id: a6c189ac-6166-4919-a4e6-e4a6766b1b48
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.
references:
  - https://attack.mitre.org/techniques/T1136/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136
