title: Keylogging (M365 - entra_id)
id: 12171ad1-c6a9-4a5c-acf4-c3e1987bacf7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1056.001.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1056.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1056.001
  - actor.coosea
