title: Local Groups - Rhysida (unified_logging)
id: b8eb9a68-276a-40ff-90f1-1827fb0f6538
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.001 (Local Groups).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.001
  - actor.rhysida
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name|contains: '.*'
    process.parent.name|contains: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
