title: Disable or Modify Tools (MACOS - unified_logging)
id: 2bc42f5f-dd1e-406c-8746-5d89d150e58e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/bin/launchctl'
    CommandLine|contains|contains:
      - 'unload'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.8base
