title: Registry Run Keys / Startup Folder - Trigona (sysmon)
id: 4482ccd7-d6c8-4c43-8635-840689b6322f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1547.001 (Registry Run Keys / Startup Folder).
  Associated threat actor: Trigona
references:
  - https://attack.mitre.org/techniques/T1547/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/lateral_movement_via_startup_folder_rdp_smb.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1547.001
  - actor.trigona
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'mstsc.exe'
    file.path|contains:
      - '?:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*'
      - '?:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
