title: Steganography (LINUX - auditd)
id: 6ebad15c-63b8-4b1d-af72-f9f9c35e009f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'steghide'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.lynx
