title: Clipboard Data (LINUX - auditd)
id: 42091158-53f7-4ccf-bb01-dbe99df6e6f1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1115.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1115/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'xclip'
    Image|contains|contains:
      - 'xclip'
    CommandLine|contains|all|contains:
      - '-sel'
      - 'clip'
      - '-o'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1115
  - actor.lynx
