title: T1114 (LINUX - auditd)
id: 164abd6c-23ef-42a9-8b35-ea762f0a4401
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1114.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1114/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1114
  - actor.lynx
