title: DLL (LINUX - auditd)
id: 3944d5fd-65ed-4c3d-a732-9b688db38e48
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains|contains:
      - '/.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.lynx
