title: Network Share Discovery (GOOGLE - workspace)
id: 63b3d99b-ae8f-4002-921f-180f42c1e2e7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1135.
  Threat Actor: APT39
references:
  - https://attack.mitre.org/techniques/T1135/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1135
  - actor.apt39
