title: Web Shell (GOOGLE - workspace)
id: a617d428-9d55-4156-b2d6-6f9049524877
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: APT39
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.apt39
