title: Access Token Manipulation - Vect RaaS (security)
id: f01126c2-354f-42a7-86e9-f1518dee50b2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134 (Access Token Manipulation).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1134/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hktl_nofilter.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134
  - actor.vect_raas
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '5447'
      - '5449'
    FilterName|contains: 'RonPolicy'
    ProviderContextName|contains: 'RonPolicy'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
