title: System Information Discovery (WINDOWS - security)
id: adfedfdc-bad4-469d-a9c1-cc8be98878a5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1082.
  Threat Actor: Sowbug
references:
  - https://attack.mitre.org/techniques/T1082/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\PCHunter64.exe'
      - '\PCHunter32.exe'
    CommandLine|contains|contains:
      - 'lkd(0)'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1082
  - actor.sowbug
