title: Lateral Tool Transfer (WINDOWS - sysmon)
id: bd9b8750-a8d7-4282-9237-404ca294b3f3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.play
