title: System Service Discovery (LINUX - auditd)
id: 7e7707e9-d44e-4b68-a8a7-cb64b0f60b42
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1007.
  Threat Actor: Chimera
references:
  - https://attack.mitre.org/techniques/T1007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/esxcli'
    CommandLine|contains|contains:
      - 'storage'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1007
  - actor.chimera
