title: Command and Scripting Interpreter (WINDOWS)
id: 0a8f24b8-ecc4-410d-89ca-41b545f664cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'powershell.exe'
      - 'pwsh.exe'
      - 'cmd.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
