title: Active Scanning (WINDOWS - sysmon)
id: 0eaf6c14-bff8-424d-a9d6-e82a71582f47
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: WannaCry
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.wannacry
