title: Match Legitimate Resource Name or Location (GOOGLE - workspace)
id: 491d5b61-ed62-4acb-a9bc-cad7397d47ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.lynx
