title: Application Window Discovery (LINUX - auditd)
id: cbd260b6-1bbf-4e9a-9713-8f83607e0fec
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1010.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1010
  - actor.lazarus_group
