title: Native API (LINUX - auditd)
id: 988db8ff-91b4-409f-9eb5-59ae577df076
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1106.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1106/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains:
      - '/var/run/haldrund.pid'
      - '/var/run/xinetd.lock'
      - '/var/run/kdevrund.pid'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1106
  - actor.lazarus_group
