title: Deobfuscate/Decode Files or Information (LINUX - auditd)
id: 62406f9a-ed3f-435f-a4b1-f49e395558ba
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1140.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1140/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'IyEvYmluL2Jhc2'
      - 'IyEvYmluL2Rhc2'
      - 'IyEvYmluL3pza'
    CommandLine|startswith|contains:
      - 'sh -c '
      - 'bash -c '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1140
  - actor.lazarus_group
