title: DLL (LINUX - auditd)
id: b8388236-b763-4400-b9e4-308f0a98f62f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains|contains:
      - '/.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.lazarus_group
