title: Disable or Modify System Firewall - 3AM (sysmon)
id: d3336732-d224-4fc9-a0d3-e92573bd8bf8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.004 (Disable or Modify System Firewall).
  Associated threat actor: 3AM
references:
  - https://attack.mitre.org/techniques/T1562/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_disable_windows_firewall_rules_with_netsh.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.004
  - actor.3am
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'netsh.exe'
    process.args|contains: 'state'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
