title: SSH (WINDOWS - sysmon)
id: 844e4b4e-f44c-4b9c-9ca4-bd398fa2d3ab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: Rocke
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.rocke
