title: Google Drive Ownership Transferred via Google Workspace
id: ead87f75-3fa4-4ab3-a306-2c773452e4a0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1074.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1074/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1074.002
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.action: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category: 'iam'
    google_workspace.admin.application.name: 'Drive*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
