title: GCP Authentication Failed During MFA Challenge
id: eed9330b-8aca-4135-a44a-4b4a9a1075a4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
