title: GCP Authentication Failed During MFA Challenge
id: 84c4ab04-e567-440a-b5b3-e806244bb52b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
