title: First Time Seen Google Workspace OAuth Login from Third-Party Application
id: 3c3364ac-73aa-47d3-ad0d-e3e4b50a856f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.token'
    event.action: 'authorize'
    google_workspace.token.scope.data: 'Login'
    google_workspace.token.client.id: 'apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
