title: Google Workspace User Group Access Modified to Allow External Access
id: a8578fd7-e2c6-4226-959f-9d1f00cc8946
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_google_workspace_user_group_access_modified_to_allow_external_access.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1098
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.action: 'CHANGE_GROUP_SETTING'
    event.category: 'iam'
    google_workspace.admin.setting.name:
      - 'ALLOW_EXTERNAL_MEMBERS'
      - 'WHO_CAN_JOIN'
    google_workspace.admin.new_value:
      - 'true'
      - 'INVITED_CAN_JOIN'
      - 'CAN_REQUEST_TO_JOIN'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
