title: Google Workspace Application Access Level Modified
id: ea077397-319c-4df6-80da-d99e0b3276ae
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/gworkspace/gcp_gworkspace_application_access_levels_modified.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098.003
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
      selection:
          eventService: 'admin.googleapis.com'
          eventName: 'CHANGE_APPLICATION_SETTING'
          setting_name|startswith: 'ContextAwareAccess'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
