title: GCP Access Policy Deleted
id: fe593b74-342a-462a-b88d-1c8cf5097b7a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_access_policy_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
      selection:
          data.protoPayload.authorizationInfo.permission:
              - 'accesscontextmanager.accessPolicies.delete'
              - 'accesscontextmanager.accessPolicies.accessLevels.delete'
              - 'accesscontextmanager.accessPolicies.accessZones.delete'
              - 'accesscontextmanager.accessPolicies.authorizedOrgsDescs.delete'
          data.protoPayload.authorizationInfo.granted: 'true'
          data.protoPayload.serviceName: 'accesscontextmanager.googleapis.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
