title: Google Workspace Custom Gmail Route Created or Modified
id: 11c6eeb8-0a63-43d8-9c26-de1237ed76be
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_workspace_custom_gmail_route_created_or_modified.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1114
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.action: 'CREATE_GMAIL_SETTING'
    google_workspace.event.type: 'EMAIL_SETTINGS'
    google_workspace.admin.setting.name: 'EMAIL_ROUTE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
