title: GCP Multiple Users Failing To Authenticate From Ip
id: 1c6bd3d2-1c2f-4e86-9370-cf67e9d2e694
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_multiple_users_failing_to_authenticate_from_ip.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    type: 'login'
    name: 'login_failure'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
