title: Google Workspace Admin Role Deletion
id: c2c2cb0f-75ac-426e-9d58-c9ee01399eca
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1531.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1531/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/impact_google_workspace_admin_role_deletion.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.provider: 'admin'
    event.category: 'iam'
    event.action: 'DELETE_ROLE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
