title: Google Cloud Kubernetes Admission Controller
id: d785186e-9507-49df-99ad-3b4723aa05b8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_kubernetes_admission_controller.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
      selection:
          gcp.audit.method_name|startswith: 'admissionregistration.k8s.io.v'
          gcp.audit.method_name|contains:
              - '.mutatingwebhookconfigurations.'
              - '.validatingwebhookconfigurations.'
          gcp.audit.method_name|endswith:
              - 'create'
              - 'patch'
              - 'replace'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
