title: Google Workspace Drive Encryption Key(s) Accessed from Anonymous User
id: 23b6655f-30cc-4573-9a87-334394e6850e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1552/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/credential_access_google_workspace_drive_encryption_key_accessed_by_anonymous_user.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1552.004
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.action:
      - 'copy'
      - 'download'
    google_workspace.drive.visibility: 'people_with_link'
    file.extension:
      - 'token'
      - 'ps2xml'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
