title: First Time Seen Google Workspace OAuth Login from Third-Party Application
id: 84f25d10-9dc7-414f-adfb-c071f0463fad
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1550/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1550.001
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.token'
    event.action: 'authorize'
    google_workspace.token.scope.data: 'Login'
    google_workspace.token.client.id: 'apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
