title: Google Workspace 2SV Policy Disabled
id: 87976f6e-b6fa-48d8-bc5e-1acb1c225cbc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1556/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/persistence_google_workspace_2sv_policy_disabled.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1556
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.login'
    event.action: '2sv_disable'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
