title: Domain Added to Google Workspace Trusted Domains
id: 6dd6bf7a-d2ad-407a-9a84-260b722e1ec3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.007.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1562/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_domain_added_to_google_workspace_trusted_domains.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1562.007
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.provider: 'admin'
    event.category: 'iam'
    event.action: 'ADD_TRUSTED_DOMAINS'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
