title: Google Cloud Re-identifies Sensitive Information
id: 825ab11a-aa04-4685-8f7a-876d5febae24
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1565.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1565/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_dlp_re_identifies_sensitive_information.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1565
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
      selection:
          gcp.audit.method_name: projects.content.reidentify
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
