title: Google Cloud Firewall Modified or Deleted
id: 4764c042-9ba5-4bdc-98a8-9bf23e779346
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_firewall_rule_modified_or_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
      selection:
          gcp.audit.method_name:
              - v*.Compute.Firewalls.Delete
              - v*.Compute.Firewalls.Patch
              - v*.Compute.Firewalls.Update
              - v*.Compute.Firewalls.Insert
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
