title: Application Removed from Blocklist in Google Workspace
id: dc4efe54-8d4f-458a-8401-9b4afb5970ea
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_application_removed_from_blocklist_in_google_workspace.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1562.001
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset: 'google_workspace.admin'
    event.category: 'iam'
    event.type: 'change'
    event.action: 'CHANGE_APPLICATION_SETTING'
    google_workspace.admin.application.name: 'Google Workspace Marketplace'
    google_workspace.admin.old_value: 'allowed*false*'
    google_workspace.admin.new_value: 'allowed*true*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
