title: GCP Authentication Failed During MFA Challenge
id: 928b3842-dbde-423c-9b2c-fd177078ffd1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1621.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1621
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
