title: SSH (WINDOWS - defender)
id: 0bb2512e-b2df-46f5-99b4-df2580028c1a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: Fox Kitten
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.fox_kitten
