title: Accessibility Features (WINDOWS - defender)
id: 99c975a3-5d6c-447c-9f9e-aec891d105be
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.008.
  Threat Actor: Fox Kitten
references:
  - https://attack.mitre.org/techniques/T1546.008/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'copy '
      - '/y '
    ParentImage|endswith|contains:
      - '\winlogon.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\cscript.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.008
  - actor.fox_kitten
