title: Encrypted/Encoded File - Medusa (workspace)
id: 50b45e01-f16d-40c4-aa16-03f5a972e895
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.013 (Encrypted/Encoded File).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1027/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_encoding_rot13_python_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.013
  - actor.medusa
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains: 'python*'
    file.name|contains: 'rot_??.cpython-*.pyc*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
