title: Scheduled Task/Job - Yashma-Ator-Vietnamita (sysmon)
id: e11fd311-3959-47ea-b0a6-4ec78e944c36
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053 (Scheduled Task/Job).
  Associated threat actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_cron_jobs_creation_and_runtime.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053
  - actor.yashma-ator-vietnamita
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.args|contains: '-l'
    process.name|contains: 'running job'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
