title: Clipboard Data - Yashma-Ator-Vietnamita (sysmon)
id: 675a58f7-7d68-4048-93fe-4404f2dee33c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1115 (Clipboard Data).
  Associated threat actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_clipboard_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1115
  - actor.yashma-ator-vietnamita
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Set-Alias -Name \'
    user.id|contains: 'S-1-5-18'
    file.name|contains: 'Convert-ExcelRangeToImage.ps1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
