title: Windows Management Instrumentation Event Subscription (WINDOWS - sysmon)
id: 7f5b1f40-d22b-41b1-9d15-7eac43d45583
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.003.
  Threat Actor: APT33
references:
  - https://attack.mitre.org/techniques/T1546.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\EdgeTransport.exe'
    CommandLine|contains|all|contains:
      - 'ActiveScriptEventConsumer'
      - ' CREATE '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.003
  - actor.apt33
