title: At (LINUX - auditd)
id: df239690-267b-4fb0-976c-f8ea7c070b6b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.002.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1053.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/at'
      - '/atd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.002
  - actor.qilin
