title: Ingress Tool Transfer (LINUX - auditd)
id: 1c2fd2e7-79d9-483e-a26a-6de212237cec
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1105.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1105/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/wget'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1105
  - actor.qilin
