title: System Time Discovery (LINUX - auditd)
id: ead21950-1192-4e23-be16-957822c97253
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1124.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1124/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1124
  - actor.qilin
