title: Query Registry (WINDOWS - security)
id: e9ad4fdb-2bbe-4a2d-902d-159b61920c0f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'Key'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.coosea
