title: Indicator Removal from Tools (WINDOWS - security)
id: 071f236a-e338-4ff8-b785-dc4499af2d40
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.005.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1027.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
    CommandLine|contains|contains:
      - 'join*split'
      - '( $ShellId[1]+$ShellId[13]+'x')'
      - '( $PSHome[*]+$PSHOME[*]+'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.005
  - actor.coosea
