title: Application Layer Protocol (WINDOWS - security)
id: 079ab4c6-2cb1-4844-b7a2-1a4d335103fa
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.coosea
