title: Hide Artifacts (WINDOWS - security)
id: 2b5baefe-f86c-46b8-8277-8a1b1b8866e9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.coosea
