title: File and Directory Discovery (LINUX - auditd)
id: ad547c72-d5a1-4672-bd67-95b8bc40163c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'getcap'
    Image|endswith|contains:
      - '/getcap'
    CommandLine|contains|contains:
      - ' -r '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.8base
