title: Windows Remote Management - Vect RaaS (sysmon)
id: eab90621-3136-431a-899d-1ae8c32d1b71
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.006 (Windows Remote Management).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1021/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/lateral_movement_incoming_winrm_shell_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.006
  - actor.vect_raas
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    network.direction|contains:
      - 'incoming'
      - 'ingress'
    process.parent.name|contains: 'winrshost.exe'
    process.executable|contains: '?:\\Windows\\System32\\conhost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
