title: SMB/Windows Admin Shares - Vect RaaS (sysmon)
id: 75a2bfd9-a0c0-425d-9612-78276baf84b9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.002 (SMB/Windows Admin Shares).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_moving_registry_hive_via_smb.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.002
  - actor.vect_raas
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.Ext.header_bytes|contains: '72656766*'
    user.id|contains:
      - 'S-1-5-21*'
      - 'S-1-12-1-*'
    file.path|contains:
      - '?:\\*\\UPM_Profile\\NTUSER.DAT'
      - '?:\\*\\AppData\\Local\\Packages\\Microsoft.*\\Settings\\settings.dat*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
