title: Automated Collection - Vect RaaS (sysmon)
id: ee1a9659-2a7e-4ecf-b5ea-c67cfb24a4e8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1119 (Automated Collection).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1119
  - actor.vect_raas
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    OriginalFileName|contains:
      - 'FINDSTR.EXE'
      - ' /e '
      - ' /si '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
