title: LSASS Memory - Hive (security)
id: 1d961c55-d8f1-4e66-b9b7-b72665dbfefa
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.001 (LSASS Memory).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_lsass_access_non_system_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.001
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectType|contains: 'Process'
    ObjectName|contains: '\lsass.exe'
    SubjectUserName|contains:
      - '$'
      - ':\Program Files\'
      - ':\Program Files (x86)\'
    ProcessName|contains:
      - 'C:\Windows\System32\wbem\WmiPrvSE.exe'
      - '\SteamLibrary\steamapps\'
    AccessMask|contains: '0x1410'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
