title: Valid Accounts - Hive (security)
id: e68cac51-da8b-4cf1-8105-78426d4b3748
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078 (Valid Accounts).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_successful_external_remote_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains:
      - '10'
      - '10.0.0.0/8'
      - '127.0.0.0/8'
      - '172.16.0.0/12'
      - '192.168.0.0/16'
    IpAddress|contains: '-'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
