title: Account Discovery - Hive (security)
id: 85a91490-dc38-4d37-a332-e3ed1796ed5a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087 (Account Discovery).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1087/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_alert_ruler.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4776'
    Workstation|contains:
      - 'RULER'
      - '4624'
      - '4625'
    WorkstationName|contains: 'RULER'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
