title: Access Token Manipulation - Hive (security)
id: 2eb213c9-f911-4e37-9343-ea9c287844cb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134 (Access Token Manipulation).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1134/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hktl_nofilter.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '5447'
      - '5449'
    FilterName|contains: 'RonPolicy'
    ProviderContextName|contains: 'RonPolicy'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
