title: Use Alternate Authentication Material - Hive (security)
id: d7cfe35b-07d0-413b-8cd1-0fa1aecf9d57
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1550 (Use Alternate Authentication Material).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1550/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_logon_newcredentials.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1550
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '9'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
