title: Tool - Hive (security)
id: 4dae3324-3ffe-456a-9b5a-e0982f999647
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1588.002 (Tool).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1588/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_execution_via_imphashes.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1588.002
  - actor.hive
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    Hashes|contains:
      - '# Sysmon field hashes contains all types'
      - 'IMPHASH=BCCA3C247B619DCD13C8CDFF5F123932 # PetitPotam'
      - 'IMPHASH=3A19059BD7688CB88E70005F18EFC439 # PetitPotam'
      - 'IMPHASH=bf6223a49e45d99094406777eb6004ba # PetitPotam'
      - 'IMPHASH=23867A89C2B8FC733BE6CF5EF902F2D1 # JuicyPotato'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
