title: Local Account - BQTLock (entra_id)
id: c916de3e-c1b8-407d-b565-c98b39d3a95d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1136.001 (Local Account).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1136.001
  - actor.bqtlock
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
