title: Data from Local System (WINDOWS - defender)
id: 66e2eb77-0767-429e-9cb1-4ba9ecf3c70e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1005.
  Threat Actor: BRONZE BUTLER
references:
  - https://attack.mitre.org/techniques/T1005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-r'
    Image|endswith|contains:
      - '\sqlcmd.exe'
    CommandLine|contains|all|contains:
      - 'SELECT'
      - 'TOP'
      - '[VeeamBackup].[dbo].[Credentials]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1005
  - actor.bronze_butler
