title: Visual Basic (WINDOWS - defender)
id: 164be319-4331-41cb-8ad3-ed3f78247519
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.005.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1059.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cscript.exe'
      - '\excel.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.005
  - actor.safepay
