title: Malicious Link (WINDOWS - defender)
id: fb831063-b79e-4642-8f36-b26d5e6982bd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.001.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1204.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|contains:
      - '#'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.001
  - actor.safepay
