title: Msiexec (WINDOWS - defender)
id: fbccd281-0a5e-46db-9c81-780948bf6e2d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.007.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1218.007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -y'
    Image|endswith|contains:
      - '\msiexec.exe'
    ParentCommandLine|contains|all|contains:
      - 'MsiExec.exe'
      - '-Embedding '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.007
  - actor.safepay
