title: Remote Desktop Software (WINDOWS - defender)
id: fafd0e9b-24ea-419c-a9e5-f9f118fbd655
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.002.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1219.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.rdp'
      - '.rdp"'
    Image|endswith|contains:
      - '\QuickAssist.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219.002
  - actor.safepay
