title: System Owner/User Discovery (WINDOWS - sysmon)
id: 39506b66-7d59-437b-9885-31acea958499
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: Ke3chang
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SharpLdapWhoami.exe'
    CommandLine|contains|all|contains:
      - 'Get-ADComputer '
      - ' -Filter \*'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.ke3chang
