title: T1027.002 (GOOGLE - workspace)
id: 5def0df1-0d68-48e9-adfa-7ebbc1d4473b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.002.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1027.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.002
  - actor.bianlian
