title: Spearphishing Link (M365)
id: 7f6b6a87-2759-457b-ad45-8d797ef4a399
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1598.003.
references:
  - https://attack.mitre.org/techniques/T1598.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    AttachmentExtension|in:
      - 'exe'
      - 'dll'
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1598.003
