title: Clear Windows Event Logs (LINUX - auditd)
id: cc8b1ee7-a222-4ed7-a378-cc92d6f21b10
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
  - actor.shinra
