title: Data Destruction (LINUX - auditd)
id: 48e2473a-dead-4f3f-9156-a51577c999c0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1485.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1485/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains|contains:
      - 'dd'
    Image|contains:
      - '/bin/dd'
      - '/usr/bin/dd'
    CommandLine|contains|contains:
      - 'of='
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1485
  - actor.shinra
