title: Windows Service (LINUX - auditd)
id: 922f33a5-5e17-4f73-b929-cb020b53982c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.shinra
