title: File and Directory Discovery (WINDOWS - defender)
id: 8947f1d9-7ff3-4467-aa14-db53314dcde7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.hunt-dharma-crysis
