title: ESXi Sensitive Files Accessed
id: ddc90151-952e-4f81-87a8-9b1afde357fe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.008.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1003/008/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_sensitive_files_accessed.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1003.008
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    Message: '*shell[*'
    field:
      - '_raw'
      - '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
