title: OpenCanary - SMB File Open Request
id: 36aa6959-36aa-46aa-a6aa-36aa69590000
status: stable
description: Detection rule for MITRE ATT&CK technique T1005
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/application/opencanary/opencanary_smb_file_open.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1005
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         logtype: 5000
    #     condition: selection
    # 
  condition: selection
level: medium
