title: Cisco ASA - Device File Copy Activity
id: 569b51d8-321d-4be7-9940-7bf30416ecd8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1005/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___device_file_copy_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1005
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'copy'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
