title: ESXi Shell Access Enabled
id: fe6b2f9b-7b4a-4e0b-b556-7d4c94b99039
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1021/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_shell_access_enabled.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1021
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    Message:
      - '*ESXi'
      - '*has'
    field:
      - '_raw'
      - '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
