title: ESXi SSH Enabled
id: a900687b-060e-4896-8743-96e0ddcdafcb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1021/004/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_ssh_enabled.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1021.004
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    Message: '*SSH'
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
