title: Cisco ASA - Device File Copy to Remote Location
id: 2ef47b90-d79a-4533-a087-828358a4c919
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___device_file_copy_to_remote_location.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'copy'
    remote_protocol: 'mvappend('
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
