title: Ollama Possible Model Exfiltration Data Leakage
id: 563ce80e-e99b-47b4-9a04-216bf53c0127
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/
  - https://github.com/splunk/security_content/blob/develop/detections/application/ollama_possible_model_exfiltration_data_leakage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    1: '1,'
    field: '_raw'
    src: 'src_ip'
    dest: 'uri_path'
    span: '15m'
    avg_response_time: 'round(avg_response_time,'
    max_response_time: 'round(max_response_time,'
    severity: 'case('
    attack_type: 'Potential'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
