title: Cisco ASA - Device File Copy to Remote Location
id: 747271a9-7472-4472-a472-747271a90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1048.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___device_file_copy_to_remote_location.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # `cisco_asa`
    #   message_id IN (111008, 111010)
    #   command = "copy *"
    #   command IN (
    #       "*running-config*",
    #       "*startup-config*",
    #       "*/pcap capture:*",
    #       "* disk0:*",
    #       "* flash:*",
    #       "* system:*"
    #   )
    #   command IN (
    #       "*ftp:*",
    #       "*http:*",
    #       "*https:*",
    #       "*smb:*",
    #       "*scp:*"
    #   )
    # 
    #   | eval remote_protocol = mvappend(
    #     if(match(command, "tftp:"), "TFTP", null()),
    #     if(match(command, "ftp:"), "FTP", null()),
    #     if(match(command, "http:"), "HTTP", null()),
    #     if(match(command, "https:"), "HTTPS", null()),
    #     if(match(command, "smb:"), "SMB", null()),
    #     if(match(command, "scp:"), "SCP", null())
    #     )
    #   | fillnull
    #   | stats earliest(_time) as firstTime
    #           latest(_time) as lastTime
    #           values(user) as user
    #           values(action) as action
    #           values(message_id) as message_id
    #           values(command) as command
    #           values(remote_protocol) as remote_protocol
    #           values(src_ip) as src_ip
    #           values(dest) as dest
    #           values(process_name) as process_name
    #     by host
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_asa___device_file_copy_to_remote_location_filter`
  condition: selection
level: medium
