title: Cisco ASA - Device File Copy to Remote Location
id: aae82f77-26d1-4012-8d6a-5b5422427873
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1041.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1041/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___device_file_copy_to_remote_location.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1041
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'copy'
    remote_protocol: 'mvappend('
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
