title: Multiple Archive Files Http Post Traffic
id: 3feaa800-c7fa-4b83-822e-b8418e182064
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/splunk/security_content/blob/develop/detections/web/multiple_archive_files_http_post_traffic.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    http_method: 'POST'
    archive_hdr1:
      - 'substr(form_data,1,2)'
      - '7z'
      - 'PK'
    archive_hdr2:
      - 'substr(form_data,1,4)'
      - 'Rar!'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
