title: CrushFTP Authentication Bypass Exploitation
id: a793daa3-27bc-4651-9dc6-1cbe9006e6a5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/splunk/security_content/blob/develop/detections/web/crushftp_authentication_bypass_exploitation.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1059.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field:
      - '_raw'
      - '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
