title: Microsoft SharePoint Server Elevation of Privilege
id: d738bd4b-5faa-4cea-9c39-9e4347cf9381
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1068.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1068/
  - https://github.com/splunk/security_content/blob/develop/detections/web/microsoft_sharepoint_server_elevation_of_privilege.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1068
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    status: '200'
    http_method: 'GET'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
