title: ESXi System Clock Manipulation
id: 3f29000a-3f29-4f29-af29-3f29000a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.006
references:
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_system_clock_manipulation.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1070.006
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # `esxi_syslog` Message="*NTPClock*" AND Message="*system clock stepped*"
    #   | rex field=_raw "stepped to (?<epoch_time>\d+\.\d+),.+delta\s(?<delta>\d+)\s"
    #   | rex field=_raw "Z (?<dest>[\w\.]+)\s"
    #   | eval epoch_time=tonumber(epoch_time)
    #   | eval delta=tonumber(delta)
    #   | eval event_time=round(_time, 0)
    #   | eval direction=if(epoch_time < event_time, "backward", "forward")
    #   | eval original_time=if(direction=="backward", epoch_time + delta, epoch_time - delta)
    #   | eval stepped_to_str=strftime(epoch_time, "%Y-%m-%d %H:%M:%S")
    #   | eval original_time_str=strftime(original_time, "%Y-%m-%d %H:%M:%S")
    #   | stats min(_time) as firstTime max(_time) as lastTime count by dest direction original_time_str stepped_to_str epoch_time delta
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `esxi_system_clock_manipulation_filter`
  condition: selection
level: medium
