title: Cisco ASA - Logging Message Suppression
id: 7733743b-e27e-4309-94ec-1dcf326409b4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1070/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___logging_message_suppression.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1070
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'no'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
