title: Okta Authentication Failed During MFA Challenge
id: 7d6696a0-a28d-4dc5-b840-f4b799dc10bc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Authentication'
    signature: 'user.authentication.auth_via_mfa'
    action: 'failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
