title: Okta New API Token Created
id: 9086aa3c-642f-4612-953f-5ebeac2c06a9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_new_api_token_created.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1078.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Change'
    action: 'created'
    command: 'system.api_token.create'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
