title: Windows WebDAV User Agent
id: 5d6cb1f9-5d6c-4d6c-ad6c-5d6cb1f90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1071.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_downloadcradle_webdav.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1071.001
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         c-useragent|startswith: 'Microsoft-WebDAV-MiniRedir/'
    #         cs-method: 'GET'
    #     condition: selection
    # 
  condition: selection
level: medium
