title: Detect attackers scanning for vulnerable JBoss servers
id: 44ddd758-9dc4-4585-a984-bc766d089abc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1082.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/splunk/security_content/blob/develop/detections/web/detect_attackers_scanning_for_vulnerable_jboss_servers.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    http_method:
      - 'GET'
      - 'HEAD'
    url:
      - '*/web-console/ServerInfo.jsp*'
      - '*web-console*'
      - '*jmx-console*'
      - '*invoker*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
