title: Cisco ASA - Reconnaissance Command Activity
id: 93ea6cce-9bf6-4f54-84d2-add090b2027b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1082.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___reconnaissance_command_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command_type: 'case('
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
