title: Linux Proxy Socks Curl
id: 5755398d-5755-4755-a755-5755398d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1095
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_proxy_socks_curl.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1095
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process_name=curl
    #   Processes.process IN ("*-x *", "*socks4a://*", "*socks5h://*", "*socks4://*","*socks5://*",
    #   "*--preproxy *", "--proxy*") by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | where
    #   match(process, "-x\s") OR match(process, "(?i)socks\d\w?:\/\/|--(pre)?proxy") |
    #   `linux_proxy_socks_curl_filter`
  condition: selection
level: medium
