title: Windows Proxy Via Netsh
id: 6bc8c7f9-6bc8-4bc8-abc8-6bc8c7f90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1090.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_proxy_via_netsh.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1090.001
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where `process_netsh` Processes.process
    #   = "* portproxy *" Processes.process = "* v4tov4 *" by Processes.action Processes.dest
    #   Processes.original_file_name Processes.parent_process Processes.parent_process_exec
    #   Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
    #   Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
    #   Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
    #   Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    #   |`drop_dm_object_name("Processes")` |`security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
    #   | `windows_proxy_via_netsh_filter`
  condition: selection
level: medium
