title: Okta New Device Enrolled on Account
id: 11c9d1f5-7b4b-404a-a51f-ec5a6c55824a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1098/005/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_new_device_enrolled_on_account.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1098.005
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Change'
    action: 'created'
    command: 'device.enrollment.create'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
