title: PwnDrp Access
id: 18d1a289-18d1-48d1-a8d1-18d1a2890000
status: stable
description: Detection rule for MITRE ATT&CK technique T1102.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_pwndrop.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1102.003
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         c-uri|contains: '/pwndrop/'
    #     condition: selection
    # 
  condition: selection
level: medium
