title: Cisco ASA - User Account Lockout Threshold Exceeded
id: 73ce1830-3d05-487e-a996-3aca42fef24c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___user_account_lockout_threshold_exceeded.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.003
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    failure_description: 'locked'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
