title: Cisco ASA - User Account Lockout Threshold Exceeded
id: 0023f674-e710-4dca-8de4-0e4c74358269
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___user_account_lockout_threshold_exceeded.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    failure_description: 'locked'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
