title: ESXi SSH Brute Force
id: 655a7dcc-8aa1-43dd-9595-b358b15c0065
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_ssh_brute_force.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    Message: '*Authentication'
    field: '_raw'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
