title: Email servers sending high volume traffic to hosts
id: 07c6acf5-6a33-4f7b-98c5-b0f4e49b19a9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://github.com/splunk/security_content/blob/develop/detections/application/email_servers_sending_high_volume_traffic_to_hosts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1114.002
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Network_Traffic'
    src_category: 'email_server'
    span: '1d'
    minimum_data_samples: '4,'
    deviation_threshold: '3'
    num_standard_deviations_away_from_server_average: 'round(abs(bytes_out'
    num_standard_deviations_away_from_client_average: 'round(abs(bytes_out'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
