title: Cisco ASA - User Account Lockout Threshold Exceeded
id: 7f6d94b1-7f6d-4f6d-af6d-7f6d94b10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___user_account_lockout_threshold_exceeded.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1110.001
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # `cisco_asa`
    #   message_id IN (113006)
    #   | rex "locked out on exceeding '(?<attempts_count>\d+)' successive failed authentication attempts"
    #   | rex "User '(?<user>[^']+)' locked out"
    #   | eval failure_description="locked out on exceeding " . attempts_count . " successive failed authentication attempts"
    #   | fillnull
    #   | stats earliest(_time) as firstTime
    #           latest(_time) as lastTime
    #           values(message_id) as message_id
    #           values(failure_description) as failure_description
    #     by host user
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_asa___user_account_lockout_threshold_exceeded_filter`
  condition: selection
level: medium
