title: CrushFTP Max Simultaneous Users From IP
id: 583c0eab-2039-448e-8034-8eb4a9254205
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://github.com/splunk/security_content/blob/develop/detections/web/crushftp_max_simultaneous_users_from_ip.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.004
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
