title: CrushFTP Max Simultaneous Users From IP
id: 7ad52ce0-17d7-4b16-a917-96ddf2508002
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://github.com/splunk/security_content/blob/develop/detections/web/crushftp_max_simultaneous_users_from_ip.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
