title: Remote Thread Creation Ttdinject.exe Proxy
id: 725a164a-725a-425a-a25a-725a164a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1127
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_ttdinjec.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1127
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         SourceImage|endswith: '\ttdinject.exe'
    #     condition: selection
    # 
  condition: selection
level: medium
