title: Zoom Rare Audio Devices
id: b29298aa-6ba0-4bc4-a256-083bb82fed5b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1123.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1123/
  - https://github.com/splunk/security_content/blob/develop/detections/application/zoom_rare_audio_devices.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1123
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    speaker:
      - '*'
      - '*AirPods*'
    camera:
      - '*iPhone*'
      - '*FaceTime*'
      - '*MacBook*'
    microphone: '*MacBook'
    limit: '50'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
