title: Confluence Unauthenticated Remote Code Execution CVE-2022-26134
id: 36eb9ea4-dc82-4a8b-9b43-7f8bc83a2376
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1133.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/splunk/security_content/blob/develop/detections/web/confluence_unauthenticated_remote_code_execution_cve_2022_26134.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1133
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    url:
      - '*org.apache.commons.io.IOUtils*'
      - '*java.lang.Runtime@getRuntime().exec*'
      - '*java.lang.Runtime%40getRuntime%28%29.exec*'
      - '*getEngineByName*'
      - '*nashorn*'
      - '*ProcessBuilder*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
