title: Bitsadmin to Uncommon IP Server Address
id: 24eb8dcb-24eb-44eb-a4eb-24eb8dcb0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1197
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_ua_bitsadmin_susp_ip.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1197
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         c-useragent|startswith: 'Microsoft BITS/'
    #         cs-host|endswith:
    #             - '1'
    #             - '2'
    #             - '3'
    #             - '4'
    #             - '5'
    #             - '6'
    #             - '7'
    #             - '8'
    #             - '9'
    #     condition: selection
    # 
  condition: selection
level: medium
