title: Access to Vulnerable Ivanti Connect Secure Bookmark Endpoint
id: 47893793-5c83-4880-86c2-4243a824f7fb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1190.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/splunk/security_content/blob/develop/detections/web/access_to_vulnerable_ivanti_connect_secure_bookmark_endpoint.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1190
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    url: '*/api/v1/configuration/users/user-roles/user-role/rest-userrole1/web/web-bookmarks/bookmark*'
    http_method: 'GET'
    status: '403'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
