title: Detect Remote Access Software Usage URL
id: 769e26dc-769e-469e-a69e-769e26dc0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1219
references:
  - https://github.com/splunk/security_content/blob/develop/detections/web/detect_remote_access_software_usage_url.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1219
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # | tstats count min(_time) as firstTime
    #                  max(_time) as lastTime
    #                  latest(Web.http_method) as http_method
    #                  latest(Web.http_user_agent) as http_user_agent
    #                  latest(Web.url) as url
    #                  latest(Web.user) as user
    #                  latest(Web.dest) as dest
    #   from datamodel=Web where
    #   Web.url_domain=*
    #   NOT Web.url_domain IN ("-", "unknown")
    #   by Web.action Web.src Web.category Web.url_domain Web.url_length
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `drop_dm_object_name("Web")`
    #   | lookup remote_access_software remote_domain AS url_domain OUTPUT isutility, description as signature, comment_reference
    #   as desc, category
    #   | search isutility = True
    #   | `remote_access_software_usage_exceptions`
    #   | `detect_remote_access_software_usage_url_filter`
  condition: selection
level: medium
