title: VMWare Aria Operations Exploit Attempt
id: d35fe233-3509-48ba-9cef-634e19234a5c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1210.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1210/
  - https://github.com/splunk/security_content/blob/develop/detections/web/vmware_aria_operations_exploit_attempt.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1210
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    http_method: 'POST'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
