title: ESXi Bulk VM Termination
id: d2e6d2d6-1d76-4bb2-9073-4aa8e18e8a6f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1499.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1499/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_bulk_vm_termination.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1499
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field:
      - '_raw'
      - '_raw'
    command:
      - 'mvappend(esxicli_Command,'
      - 'pkill'
      - '*esxcli*'
      - '*--format-param*'
      - '*vm'
      - '*awk*'
      - '*esxcli'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
