title: Exploit Public Facing Application via Apache Commons Text
id: 3e8e848e-b880-4043-a52b-1e4b584b7b92
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/splunk/security_content/blob/develop/detections/web/exploit_public_facing_application_via_apache_commons_text.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1505.003
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    utf: 'if(like(lower(uri_query),'
    lookup: 'if(like(lower(uri_query),'
    other_lookups: 'if(like(lower(uri_query),'
    fieldname: 'Score'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
