title: ESXi Malicious VIB Forced Install
id: 11a9fcf3-2c34-4b99-8de4-21cdb9e32d0d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.006.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1505/006/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_malicious_vib_forced_install.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1505.006
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    Message:
      - '*'
      - '*'
      - '*'
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
