title: ESXi Bulk VM Termination
id: 7e881f37-f3aa-4566-be5d-1ae6520a3153
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1529.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_bulk_vm_termination.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1529
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field:
      - '_raw'
      - '_raw'
    command:
      - 'mvappend(esxicli_Command,'
      - 'pkill'
      - '*esxcli*'
      - '*--format-param*'
      - '*vm'
      - '*awk*'
      - '*esxcli'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
