title: Cisco ASA - User Account Deleted From Local Database
id: 6e5d8ddb-6e5d-4e5d-ae5d-6e5d8ddb0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1531
references:
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___user_account_deleted_from_local_database.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # `cisco_asa`
    #   message_id IN (502102)
    #   | fillnull
    #   | stats count earliest(_time) as firstTime
    #           latest(_time) as lastTime
    #           values(action) as action
    #           values(message_id) as message_id
    #           values(result) as result
    #           values(privilege_level) as privilege_level
    #     by host user
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_asa___user_account_deleted_from_local_database_filter`
  condition: selection
level: medium
