title: Cisco ASA - Device File Copy Activity
id: 8f126025-579a-4c9c-9b99-d2ae3aa52795
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1530.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1530/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___device_file_copy_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1530
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'copy'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
