title: Windows SharePoint Spinstall0 GET Request
id: 781ea8c7-f48b-4176-b91f-c08d9935e313
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/splunk/security_content/blob/develop/detections/web/windows_sharepoint_spinstall0_get_request.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    url: '*/_layouts/15/spinstall0.aspx*'
    http_method: 'GET'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
