title: Okta Multiple Failed Requests to Access Applications
id: a31e78a0-e043-4e9c-913f-f548bae73667
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1550/004/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_multiple_failed_requests_to_access_applications.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1550.004
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    type: 'AppInstance'
    eventType:
      - 'policy.evaluate_sign_on'
      - 'user.authentication.sso'
      - '\'
      - '\'
    result:
      - 'CHALLENGE)'
      - 'SUCCESS)'
    targets:
      - 'mvzip('
      - 'mvfilter(targets'
    ratio: 'round(total_successes/total_challenges,2),'
    severity: '\'
    mitre_technique_id: '\'
    description: '\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
