title: Suspicious Email Attachment Extensions
id: 496baa38-496b-496b-a96b-496baa380000
status: stable
description: Detection rule for MITRE ATT&CK technique T1566.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/application/suspicious_email_attachment_extensions.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1566.001
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Email.All_Email where All_Email.file_name="*"
    #   
    #   by All_Email.src_user All_Email.file_name All_Email.file_size All_Email.message_id
    #      All_Email.message_info All_Email.process All_Email.process_id All_Email.orig_dest
    #      All_Email.orig_recipient
    # 
    #   | `drop_dm_object_name(All_Email)`
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | lookup update=true is_suspicious_file_extension_lookup file_name OUTPUT suspicious
    #   | search suspicious=true
    #   | `suspicious_email_attachment_extensions_filter`
  condition: selection
level: medium
