title: High Volume of Bytes Out to Url
id: ae82eda0-6db0-437d-a44a-82e12588c090
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1567.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1567/
  - https://github.com/splunk/security_content/blob/develop/detections/web/high_volume_of_bytes_out_to_url.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1567
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Web'
    span: '2m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
