title: ESXi Download Errors
id: 2ca7f0b6-ca87-43e3-9f8f-379623eafef5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_download_errors.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1562.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
