title: Cisco ASA - Logging Message Suppression
id: 35e0ae53-fb40-4de7-a454-4fe980c53e79
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1562/002/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___logging_message_suppression.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1562.002
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command: 'no'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
