title: Zscaler Adware Activities Threat Blocked
id: 37b28287-fe5e-4c7b-b875-e18f7c989572
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1566/
  - https://github.com/splunk/security_content/blob/develop/detections/web/zscaler_adware_activities_threat_blocked.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1566
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    action: 'blocked'
    threatname: '*adware*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
