title: Rclone Activity via Proxy
id: 732de462-732d-432d-a32d-732de4620000
status: stable
description: Detection rule for MITRE ATT&CK technique T1567.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_ua_rclone.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1567.002
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         c-useragent|startswith: 'rclone/v'
    #     condition: selection
    # 
  condition: selection
level: medium
