title: Suspicious External WebDAV Execution
id: 3622f57e-3622-4622-a622-3622f57e0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1584
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_webdav_external_execution.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1584
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original sigma detection logic
    #     selection_webdav:
    #         c-useragent|startswith: 'Microsoft-WebDAV-MiniRedir/'
    #         cs-method: 'GET'
    #     selection_execution:
    #         c-uri|endswith:
    #             - '.7z'
    #             - '.bat'
    #             - '.dat'
    #             - '.cmd'
    #             - '.exe'
    #             - '.js'
    #             - '.lnk'
    #             - '.ps1'
    #             - '.rar'
    #             - '.url'
    #             - '.vbe'
    #             - '.vbs'
    #             - '.zip'
    #     filter_main_local_ips:
    #         dst_ip|cidr:
    #             - '127.0.0.0/8'
    #             - '10.0.0.0/8'
    #             - '172.16.0.0/12'
    #             - '192.168.0.0/16'
    #             - '169.254.0.0/16'
    #             - '::1/128'  # IPv6 loopback
    #             - 'fe80::/10'  # IPv6 link-local addresses
    #             - 'fc00::/7'  # IPv6 private addresses
    #     condition: all of selection_* and not 1 of filter_main_*
    # 
  condition: selection
level: medium
