title: Okta Authentication Failed During MFA Challenge
id: b319c871-caa2-4292-ae68-f31bed163026
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/003/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Authentication'
    signature: 'user.authentication.auth_via_mfa'
    action: 'failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
