title: Web Server Suspicious User Agent Requests
id: 1c7c3076-1c7c-4c7c-ac7c-1c7c30760000
status: stable
description: Detection rule for MITRE ATT&CK technique T1595.001
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/reconnaissance_web_server_unusual_user_agents.toml
author: elastic (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1595.001
logsource:
  product: web
  service: proxy
detection:
  selection:
    # Original elastic detection logic
    # from logs-nginx.access-*, logs-apache.access-*, logs-apache_tomcat.access-*, logs-iis.access-*
    # 
    # | eval Esql.user_agent_original_to_lower = to_lower(user_agent.original), Esql.url_original_to_lower = to_lower(url.original)
    # 
    # | where
    #     Esql.user_agent_original_to_lower like "mozilla/5.0 (windows nt 10.0; win64; x64) applewebkit/537.36 (khtml, like gecko) chrome/74.0.3729.169 safari/537.36" or // Nikto
    #     Esql.user_agent_original_to_lower like "nikto*" or // Nikto
    #     Esql.user_agent_original_to_lower like "mozilla/4.0 (compatible; msie 8.0; windows nt 5.1; trident/4.0)" or // Nessus Vulnerability Scanner
    #     Esql.user_agent_original_to_lower like "*nessus*" or // Nessus Vulnerability Scanner
    #     Esql.user_agent_original_to_lower like "sqlmap/*" or // SQLMap
    #     Esql.user_agent_original_to_lower like "wpscan*" or // WPScan
    #     Esql.user_agent_original_to_lower like "feroxbuster/*" or // Feroxbuster
    #     Esql.user_agent_original_to_lower like "masscan*" or // Masscan & masscan-ng
    #     Esql.user_agent_original_to_lower like "fuzz*" or // Ffuf
    #     Esql.user_agent_original_to_lower like "mozilla/5.0 (windows nt 10.0; win64; x64) applewebkit/537.36 (khtml, like gecko) chrome/user_agent.original like~ 87.0.4280.88 safari/537.36" or // Dirsearch
    #     Esql.user_agent_original_to_lower like "mozilla/4.0 (compatible; msie 6.0; windows nt 5.1)" or // Dirb
    #     Esql.user_agent_original_to_lower like "dirbuster*" or // Dirbuster
    #     Esql.user_agent_original_to_lower like "gobuster/*" or // Gobuster
    #     Esql.user_agent_original_to_lower like "*dirsearch*" or // dirsearch
    #     Esql.user_agent_original_to_lower like "*nmap*" or // Nmap Scripting Engine
    #     Esql.user_agent_original_to_lower like "*hydra*" or // Hydra Brute Forcer
    #     Esql.user_agent_original_to_lower like "*w3af*" or // w3af Web Application Attack and Audit Framework
    #     Esql.user_agent_original_to_lower like "*arachni*" or // Arachni Web Application Security Scanner
    #     Esql.user_agent_original_to_lower like "*skipfish*"
    # ... [truncated]
  condition: selection
level: medium
