title: Cisco ASA - Reconnaissance Command Activity
id: 7604966c-0a4b-45e3-bee3-48b089bf224e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1590.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1590/005/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___reconnaissance_command_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1590.005
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command_type: 'case('
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
