title: HTTP Rapid POST with Mixed Status Codes
id: fc2d0a88-0caa-46df-a027-3dfac9bf1b7d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1595/
  - https://github.com/splunk/security_content/blob/develop/detections/web/http_rapid_post_with_mixed_status_codes.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1595
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    http_method: 'POST'
    span: '5s'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
