title: Cisco ASA - Reconnaissance Command Activity
id: 3d9af05f-fcfb-4f33-a1d1-88fba1793d0a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1590.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1590/001/
  - https://github.com/splunk/security_content/blob/develop/detections/application/cisco_asa___reconnaissance_command_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1590.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    command_type: 'case('
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
