title: ESXi Download Errors
id: f6962899-1014-4ac5-8d3a-218821718f2c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1601.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1601/001/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_download_errors.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1601.001
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field: '_raw'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
