title: Okta Authentication Failed During MFA Challenge
id: 4a550f88-d6c1-435e-b71d-8ba4370f4896
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1621.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://github.com/splunk/security_content/blob/develop/detections/application/okta_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1621
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    datamodel: 'Authentication'
    signature: 'user.authentication.auth_via_mfa'
    action: 'failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
