title: ESXi Bulk VM Termination
id: a1fc0bf5-88c3-40e6-8606-2a0ac3d7a578
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1673.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1673/
  - https://github.com/splunk/security_content/blob/develop/detections/application/esxi_bulk_vm_termination.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1673
logsource:
  product: web
  service: proxy
  category: proxy
detection:
  selection:
    field:
      - '_raw'
      - '_raw'
    command:
      - 'mvappend(esxicli_Command,'
      - 'pkill'
      - '*esxcli*'
      - '*--format-param*'
      - '*vm'
      - '*awk*'
      - '*esxcli'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
