title: Boot or Logon Autostart Execution (WINDOWS - security)
id: fe3740c6-d6d9-45b3-a5a5-20fda436b80c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1547/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
    CommandLine|contains|contains:
      - 'grpconv.exe -o'
      - 'grpconv -o'
    Image|endswith|contains:
      - '\pnputil.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547
  - actor.hunters_international
