title: Impair Defenses (WINDOWS - security)
id: f87e7355-3df7-4af1-9f85-9c1d9cab1058
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1562/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Application|endswith|contains:
      - '\AmSvc.exe'
      - '\cb.exe'
      - '\CETASvc.exe'
    ObjectName|endswith|contains:
      - '\SOFTWARE\Microsoft\.NETFramework'
    FilterName|contains|contains:
      - 'Custom Outbound Filter'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562
  - actor.hunters_international
