title: SMB/Windows Admin Shares (MACOS - unified_logging)
id: c92bc8fe-a646-4151-9762-81d19fe27408
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.002.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1021.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.002
  - actor.hunters_international
