title: Network Sniffing (MACOS - unified_logging)
id: 8a0d2d16-de36-4200-a825-90c4c9ff3d2e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1040.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1040/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/tcpdump'
      - '/tshark'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1040
  - actor.apt28
