title: External Remote Services - Repellent Scorpius Cicada3301 (unified_logging)
id: e2018652-0c34-4712-a704-268f3222f586
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1133 (External Remote Services).
  Associated threat actor: Repellent Scorpius Cicada3301
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_ssh_connection_established_inside_a_container.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1133
  - actor.repellent_scorpius_cicada3301
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    container.id|contains: '*'
    process.entry_leader.entry_meta.type|contains: 'sshd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
