title: Security Account Manager (WINDOWS - sysmon)
id: 1d26a4d7-1862-4176-a983-83ce7e1159ae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.002.
  Threat Actor: Threat Group-3390
references:
  - https://attack.mitre.org/techniques/T1003.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'mklink'
      - 'HarddiskVolumeShadowCopy'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
    CommandLine|contains|contains:
      - '::aadcookie'
      - '::detours'
      - '::memssp'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.002
  - actor.threat_group-3390
