title: Process Discovery (MACOS - unified_logging)
id: f4e2f00c-6b23-4a24-b880-36ec9e042e2b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: Turla
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.turla
