title: Archive via Utility (MACOS - unified_logging)
id: 381b1f8c-f59d-47cf-b82c-38c7d197f445
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: Turla
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/hdiutil'
    CommandLine|contains|contains:
      - 'attach '
      - 'mount '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.turla
