title: JavaScript - Cephalus (defender)
id: 0719b5ae-9ddb-45d9-8046-3af2c598a2a4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.007 (JavaScript).
  Associated threat actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1059/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_suspicious_jar_child_process.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.007
  - actor.cephalus
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.type|contains: 'start'
    process.parent.name|contains: 'java'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
