title: Automated Collection - Cephalus (defender)
id: 0022b387-59d2-45f0-9ac8-0841e3bce868
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1119 (Automated Collection).
  Associated threat actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1119
  - actor.cephalus
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    OriginalFileName|contains:
      - 'FINDSTR.EXE'
      - ' /e '
      - ' /si '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
