title: Peripheral Device Discovery (WINDOWS - defender)
id: ffbfc203-242d-44ec-b762-90ade2392a8c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1120.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1120/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1120
  - actor.bianlian
