title: Clear Command History (WINDOWS - security)
id: a37375f9-7aa1-4288-a449-80eb66b07051
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.003.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1070.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' del'
      - '\Software\Microsoft\Windows\CurrentVersion\Explorer\RunMRU'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.003
  - actor.apt41
