title: Group Policy Modification (WINDOWS - security)
id: fce68c41-4412-42a0-b5e3-40de2118d641
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectClass|contains:
      - 'groupPolicyContainer'
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.apt41
