title: Windows Service (LINUX - auditd)
id: e93d879c-b823-41f0-bd3d-10e7c017e439
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.cl0p
