title: Default Accounts - GLOBAL (unified_logging)
id: 9d5492db-421b-440c-b42b-daaf5675f0b7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/kubernetes/initial_access_anonymous_request_authorized.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.global
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    kubernetes.audit.user.username|contains: 'system:anonymous'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
