title: Cloud Accounts - Chaos (sysmon)
id: b029e4be-1bb2-451c-8a70-5f7c7e311cc6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.004 (Cloud Accounts).
  Associated threat actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.004
  - actor.chaos
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.token'
    event.action|contains: 'authorize'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
