title: Clear Windows Event Logs - Chaos (sysmon)
id: d431e139-4ea4-4c94-bc30-15c88f326966
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070.001 (Clear Windows Event Logs).
  Associated threat actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1070/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_audit_policy_disabled_winlog.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070.001
  - actor.chaos
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.code|contains: '4719'
    host.os.type|contains: 'windows'
    winlog.event_data.AuditPolicyChangesDescription|contains: 'Success removed'
    winlog.event_data.SubCategory|contains: 'Logon'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
