title: Hide Artifacts - Lynx (entra_id)
id: ae125d7c-994b-4ada-9f9b-f501e0e93fbf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564 (Hide Artifacts).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/defense_evasion_exchange_new_inbox_rule_delete_or_move.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564
  - actor.lynx
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    event.dataset|contains: 'o365.audit'
    event.action|contains: 'New-InboxRule'
    event.outcome|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
