title: Spearphishing Link (M365 - entra_id)
id: 3c0b6897-22e4-443a-95ef-7aa4e155359b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.brain_cipher
