title: DLL (WINDOWS - sysmon)
id: 89d814a2-a5f4-4d6d-9aa3-4e3febcb5827
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: Tonto Team
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/PhoneDeepLink'
    Image|endswith|contains:
      - '\dnscmd.exe'
    Image|startswith|contains:
      - 'C:\Program Files\VMware\'
    CommandLine|contains|all|contains:
      - '/config'
      - '/serverlevelplugindll'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.tonto_team
