title: OS Credential Dumping - Rhysida (workspace)
id: f23d3139-4d6d-4ae1-9da6-a9395c520cc7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/credential_access_gitleaks_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.rhysida
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains:
      - 'gitleaks.exe'
      - 'gitleaks'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
