title: Data Encrypted for Impact - Conti (entra_id)
id: ef1558a9-7f13-47c5-ab4e-5f53006a1d07
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1486 (Data Encrypted for Impact).
  Associated threat actor: Conti
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/impact_potential_linux_ransomware_file_encryption.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1486
  - actor.conti
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    file.extension|contains: '?*'
    process.executable|contains:
      - './*'
      - '/run/*'
    file.path|contains:
      - '/home/*/Downloads/*'
      - '/var/www/*'
    process.name|contains:
      - 'dpkg'
      - 'suldownloader'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
