title: Windows Service (WINDOWS - sysmon)
id: 5737142f-888a-4fee-8893-3ec22fec2777
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Tropic Trooper
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '-SecurityDescriptorSddl '
      - '-sd '
    CommandLine|contains|all|contains:
      - 'New-Service'
      - '-BinaryPathName'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.tropic_trooper
