title: Exploit Public-Facing Application - Cicada3301Repellent Scorpius (security)
id: f40be545-a0f8-409d-b077-bde4ac169eef
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1190 (Exploit Public-Facing Application).
  Associated threat actor: Cicada3301Repellent Scorpius
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_failed_logon_source.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1190
  - actor.cicada3301repellent_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4625'
    IpAddress|contains:
      - '-'
      - '10.0.0.0/8'
      - '127.0.0.0/8'
      - '172.16.0.0/12'
      - '192.168.0.0/16'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
