title: Windows Management Instrumentation (WINDOWS - sysmon)
id: 67e7453b-08f0-4bdb-a162-ef36619752e4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1047.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1047/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'reg'
      - ' add '
    ParentImage|endswith|contains:
      - '\hh.exe'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1047
  - actor.menupass
