title: System Network Configuration Discovery (WINDOWS - defender)
id: 111ab25c-2342-49d5-a66c-82caadbbb837
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.hive
