title: Software Deployment Tools (WINDOWS - defender)
id: 90c1baea-47b8-42c0-b57d-9d8bb92d5538
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.hive
