title: Exploitation for Defense Evasion (M365 - entra_id)
id: b8f20ad5-9c9f-4f1f-8b45-4180e7e4a270
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1211.
  Threat Actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1211/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1211
  - actor.avoslocker
