title: Obfuscated Files or Information (GOOGLE - workspace)
id: cd358ef8-9d10-480c-95e2-49fc561e7fff
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.stormous
