title: Registry Run Keys / Startup Folder (WINDOWS - sysmon)
id: 31098812-84d4-4aa8-bf64-927cbc80cd4c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.001.
  Threat Actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1547.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'reg'
      - ' add '
    Image|endswith|contains:
      - '\reg.exe'
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.001
  - actor.chaos
