title: Masquerading (WINDOWS - defender)
id: 8c065cc1-97e1-410e-ac50-84a5b0016e30
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1036/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' -u '
      - ' --full '
      - ' -f '
    Image|endswith|contains:
      - '\chcp.com'
    CommandLine|endswith|contains:
      - ' 936'
      - ' 1258'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036
  - actor.menupass
