title: DLL (WINDOWS - defender)
id: b76c7cf8-45c4-47f1-9910-36d4dbee8b15
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/PhoneDeepLink'
    Image|endswith|contains:
      - '\dnscmd.exe'
    Image|startswith|contains:
      - 'C:\Program Files\VMware\'
    CommandLine|contains|all|contains:
      - '/config'
      - '/serverlevelplugindll'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.menupass
