title: Software Deployment Tools (WINDOWS - defender)
id: 7b29284b-00a3-4f5e-b909-fc3d0b592397
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.cactus_ransomware
