title: Lateral Tool Transfer (WINDOWS - defender)
id: 38e11bbc-f2f6-43bb-b0e4-755e03be6422
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.cactus_ransomware
