title: Security Software Discovery (WINDOWS - sysmon)
id: d217f1a1-fb7c-41b8-921b-ccd7b844b03b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - ' avira'
      - ' avira"'
      - ' cb'
    CommandLine|contains|contains:
      - ' 385201'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.8base
