title: Access Token Manipulation (WINDOWS - sysmon)
id: d77ddef9-22d4-44ba-9112-aeba5f353bff
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.vect_raas
