title: LSA Secrets (WINDOWS - security)
id: 464e7f6d-4bfc-4215-ac01-91d0db5a481e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.alphv-blackcat
