title: Windows Command Shell (WINDOWS - security)
id: f24902d5-4619-40b5-95d8-3a02aa03c0b5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.003.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1059.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|all|contains:
      - 'http'
      - '://'
      - '%AppData%'
    CommandLine|contains|contains:
      - '<'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.003
  - actor.alphv-blackcat
