title: Software Deployment Tools (WINDOWS - security)
id: 8f52d964-3c30-4958-a3fc-24d6161ee497
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.alphv-blackcat
