title: Create Process with Token (WINDOWS - security)
id: 19559d65-6396-47be-98bc-b53af67f9a1f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.002.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1134.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
    ParentImage|endswith|contains:
      - '\services.exe'
    CommandLine|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.002
  - actor.alphv-blackcat
