title: Pass the Hash (WINDOWS - security)
id: 801e654a-4ab6-4d59-8762-836fe473eda9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1550.002.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1550.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SubjectUserSid|contains:
      - 'S-1-0-0'
    Workstation|contains:
      - 'RULER'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1550.002
  - actor.alphv-blackcat
