title: Masquerade Task or Service (WINDOWS - sysmon)
id: 46d320e0-e823-41e7-bd18-c91654d0def4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: BackdoorDiplomacy
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.backdoordiplomacy
