title: Windows Management Instrumentation (WINDOWS - security)
id: 4896beb2-51fe-495d-bb87-3b87e705ffe6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1047.
  Threat Actor: Deep Panda
references:
  - https://attack.mitre.org/techniques/T1047/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ProcessName|endswith|contains:
      - '\WmiPrvSE.exe'
    RelativeTargetName|endswith|contains:
      - '\wbem\wbemcomn.dll'
    CommandLine|contains|all|contains:
      - 'reg'
      - ' add '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1047
  - actor.deep_panda
