title: Double File Extension - SafePay (defender)
id: e0d26c21-10c9-4b09-a96a-bceef47b690b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1036.007 (Double File Extension).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1036/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_file_creation_mult_extension.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1036.007
  - actor.safepay
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.extension|contains: 'exe'
    process.executable|contains:
      - 'C:\\Program Files\\dotnet\\dotnet.exe'
      - '\\Device\\HarddiskVolume*\\Program Files\\Microsoft Visual Studio\\*.exe'
    file.path|contains:
      - '?:\\Program Files\\QGIS *\\apps\\grass\\*.exe'
      - '\\Device\\HarddiskVolume*\\Program Files\\QGIS *\\apps\\grass\\*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
