title: Msiexec - SafePay (defender)
id: c2cb12a4-1443-42a8-a943-99f03fa2ed96
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.007 (Msiexec).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1218/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_msiexec_child_proc_netcon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.007
  - actor.safepay
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.type|contains: 'start'
    process.parent.name|contains: 'msiexec.exe'
    process.parent.args|contains: '/v'
    process.executable|contains:
      - '?:\\Windows\\System32\\msiexec.exe'
      - 'C:\\Windows\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe'
    process.name|contains:
      - 'rundll32.exe'
      - 'wscript.exe'
    process.args|contains:
      - '?:\\Program Files\\*'
      - '?:\\Program Files (x86)\\*'
    process.code_signature.subject_name|contains: 'Microsoft Corporation'
    dns.question.name|contains:
      - 'core.bdec.microsoft.com'
      - '*.symcb.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
