title: Windows Management Instrumentation Event Subscription - SafePay (defender)
id: 9b1cc850-f97d-490d-b040-f5709372da1a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1546.003 (Windows Management Instrumentation Event Subscription).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1546/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_mofcomp.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1546.003
  - actor.safepay
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'mofcomp.exe'
    process.args|contains:
      - '*\\MSSQL\\Binn\\*.mof'
      - '*\\OLAP\\bin\\*.mof'
    user.id|contains: 'S-1-5-18'
    process.parent.name|contains: 'ScenarioEngine.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
