title: Spearphishing Link (MACOS - unified_logging)
id: d703fc51-0545-46ca-90d6-ca8ef68a0dab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.sandworm_team
