title: Web Shell (WINDOWS - sysmon)
id: 3f3bd47f-a35d-4c2c-ae43-8531dd59b03b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'install'
      - 'module'
    ParentImage|endswith|contains:
      - '\sqlservr.exe'
    Image|endswith|contains:
      - '\bash.exe'
      - '\bitsadmin.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '&ipconfig&echo'
      - '&quser&echo'
      - '&whoami&echo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.gallium
