title: Hide Artifacts (WINDOWS - defender)
id: 74b913bd-a0f2-433f-abc5-a7d162d3d204
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.spectra
