title: Query Registry (WINDOWS - security)
id: 0be8ed5d-3eb8-414e-a29b-a9ace2ce66df
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: Magaskosh
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'Key'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.magaskosh
