title: Disable or Modify Tools (WINDOWS - security)
id: 96396179-fb4c-44e1-81af-8231b060660b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Magaskosh
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.magaskosh
