title: Automated Collection (WINDOWS - defender)
id: a00ae9e0-0a32-4149-9cfa-a7aecd6bcde2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1119.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1119/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.doc'
      - '.docx'
      - '.xls'
    CommandLine|contains|all|contains:
      - 'dir '
      - ' /b '
      - ' /s '
    ParentCommandLine|contains|contains:
      - ' > %TEMP%\'
      - ' > %TMP%\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1119
  - actor.apt28
