title: Steal Application Access Token (WINDOWS - defender)
id: 7b00ab7d-a429-4ffd-986d-8b30618f924d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1528.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1528/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    OriginalFileName|contains:
      - 'BrowserCore.exe'
    Image|endswith|contains:
      - '\Microsoft\Teams\current\Teams.exe'
    CommandLine|contains|contains:
      - '\Microsoft\Teams\Cookies'
      - '\Microsoft\Teams\Local Storage\leveldb'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1528
  - actor.apt28
