title: External Proxy - AvosLocker (sysmon)
id: d7a6f0b4-718a-415d-a5b5-ef4c45e24258
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1090.002 (External Proxy).
  Associated threat actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1090/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_common_webservices.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1090.002
  - actor.avoslocker
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    dns.question.name|contains: 'graph.microsoft.com'
    process.executable|contains:
      - '?:\\Program Files\\*.exe'
      - '?:\\Windows\\System32\\WWAHost.exe'
    process.name|contains: 'terraform-provider*.exe'
    process.code_signature.subject_name|contains:
      - 'Johannes Schindelin'
      - 'Mozilla Corporation'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
