title: Gsuite Outbound Email With Attachment To External Domain
id: 7e2a0fc5-7e2a-4e2a-ae2a-7e2a0fc50000
status: stable
description: Detection rule for MITRE ATT&CK technique T1048.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gsuite_outbound_email_with_attachment_to_external_domain.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1048.003
logsource:
  product: google_workspace
  service: admin
detection:
  selection:
    # Original splunk detection logic
    # `gsuite_gmail` num_message_attachments > 0 | rex field=source.from_header_address
    #   "[^@]+@(?<source_domain>[^@]+)" | rex field=destination{}.address "[^@]+@(?<dest_domain>[^@]+)"
    #   | where source_domain="internal_test_email.com" and not dest_domain="internal_test_email.com"
    #   | eval phase="plan" | eval severity="low" | stats values(subject) as subject, values(source.from_header_address)
    #   as src_domain_list, count as numEvents, dc(source.from_header_address) as numSrcAddresses,
    #   min(_time) as firstTime max(_time) as lastTime by dest_domain phase severity | where
    #   numSrcAddresses < 20 |sort - numSrcAddresses | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `gsuite_outbound_email_with_attachment_to_external_domain_filter`
  condition: selection
level: medium
