title: Mailsniper Invoke functions
id: 6a525176-6a52-4a52-aa52-6a5251760000
status: stable
description: Detection rule for MITRE ATT&CK technique T1114.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/mailsniper_invoke_functions.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1114.001
logsource:
  product: google_workspace
  service: admin
detection:
  selection:
    # Original splunk detection logic
    # `powershell` EventCode=4104 ScriptBlockText IN ("*Invoke-GlobalO365MailSearch*",
    #   "*Invoke-GlobalMailSearch*", "*Invoke-SelfSearch*", "*Invoke-PasswordSprayOWA*",
    #   "*Invoke-PasswordSprayEWS*","*Invoke-DomainHarvestOWA*", "*Invoke-UsernameHarvestOWA*","*Invoke-OpenInboxFinder*","*Invoke-InjectGEventAPI*","*Invoke-InjectGEvent*","*Invoke-SearchGmail*",
    #   "*Invoke-MonitorCredSniper*", "*Invoke-AddGmailRule*","*Invoke-PasswordSprayEAS*","*Invoke-UsernameHarvestEAS*")
    #   | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by dest
    #   signature signature_id user_id vendor_product EventID Guid Opcode Name Path ProcessID
    #   ScriptBlockId ScriptBlockText | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `mailsniper_invoke_functions_filter`
  condition: selection
level: medium
