title: Steganography (WINDOWS - defender)
id: d16c72d6-f6d4-4add-a5de-89a77714c885
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.qilin
