title: Python (WINDOWS - defender)
id: 0ab7e960-91b9-4876-801f-41cc053ea543
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.qilin
