title: Indirect Command Execution (WINDOWS - defender)
id: e4209d63-d69e-419b-b976-7c9002b21687
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1202.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1202/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'bash.exe -'
      - 'bash -'
    ParentImage|endswith|contains:
      - '\bginfo.exe'
      - '\bginfo64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1202
  - actor.qilin
