title: Valid Accounts (WINDOWS - defender)
id: 9519d1c3-7fce-44ba-bc4b-c6596647a43d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' use '
      - ':*\\'
      - '/USER:* *'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.vice_society
