title: External Remote Services (WINDOWS - defender)
id: ff2594bf-704d-43e5-a072-ab7939d5cf40
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\dns.exe'
    Image|endswith|contains:
      - '\conhost.exe'
    CommandLine|contains|all|contains:
      - 'e=Access&'
      - 'y=Guest&'
      - '&p='
    Image|contains:
      - 'TeamViewer_Desktop.exe'
    ParentImage|contains:
      - 'TeamViewer_Service.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.vice_society
