title: Malware (WINDOWS - sysmon)
id: 76576573-d45e-4916-86e8-847aeb642ae0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1587.001.
  Threat Actor: Turla
references:
  - https://attack.mitre.org/techniques/T1587.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\csexec.exe'
    Description|contains:
      - 'csexec'
    CommandLine|contains|windash|contains:
      - ' -s cmd'
      - ' -s -i cmd'
      - ' -i -s cmd'
    CommandLine|contains|contains:
      - '\\\\localhost'
      - '\\\\127.'
    CommandLine|contains|all|contains:
      - 'accepteula'
      - ' -u '
      - ' -p '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1587.001
  - actor.turla
