title: Valid Accounts (WINDOWS - sysmon)
id: 1aa6172f-cf02-4818-b6d2-63093ed146d7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: UNC2165
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' use '
      - ':*\\'
      - '/USER:* *'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.unc2165
