title: Spearphishing Attachment - Sarcoma (security)
id: 5bc10c5c-4af9-4883-9709-64f10ffb3a01
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.001 (Spearphishing Attachment).
  Associated threat actor: Sarcoma
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_iso_mount.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.001
  - actor.sarcoma
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4663'
    ObjectServer|contains: 'Security'
    ObjectType|contains: 'File'
    ObjectName|contains:
      - '\Device\CdRom'
      - '\Device\CdRom0\autorun.ico'
      - '\Device\CdRom0\setup.exe'
      - '\Device\CdRom0\setup64.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
