title: Network Service Discovery (LINUX - auditd)
id: 28d7478e-34fd-4e07-86ee-cb72aa95e7a9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1046.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1046/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|endswith|contains:
      - '/telnet'
      - '/nmap'
      - '/netcat'
    CommandLine|re|contains:
      - '-(W|R)\s?(\s|"|')([0-9a-fA-F]{2}\s?){2,20}(\s|"|')'
    Image|endswith|contains:
      - '/autorecon'
      - '/hping'
      - '/hping2'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1046
  - actor.vice_society
