title: Clear Windows Event Logs (LINUX - auditd)
id: 7db92968-ec41-469d-8b4e-ad7287547228
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
  - actor.vice_society
