title: Exfiltration Over Web Service (LINUX - auditd)
id: e959ea8f-3b30-4ae9-b517-55d01a94fdd5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/curl'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.vice_society
