title: Embedded Payloads - Shinra (defender)
id: a3a50421-a818-4612-a0c1-76a60c56e127
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.009 (Embedded Payloads).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1027/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.009
  - actor.shinra
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    ProcessCommandLine|contains: '${env:path}'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
