title: Data Staged - Shinra (defender)
id: 276876ba-3406-4f08-a09c-fe8e77dcf46f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1074 (Data Staged).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1074
  - actor.shinra
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category|contains: 'iam'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
