title: PowerShell (WINDOWS - sysmon)
id: e8b09e69-a4b6-4b46-9953-fcc64ea68c78
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|all|contains:
      - ' net use http'
      - '& start /b '
      - '\DavWWWRoot\'
    CommandLine|contains|contains:
      - '/cwhoami'
      - '/cpowershell'
      - '/cschtasks'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.ignoble_scorpius
