title: Hide Artifacts (WINDOWS - sysmon)
id: 9e28b398-cf60-42a3-9421-7b61c4dd72ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.ignoble_scorpius
