title: Lateral Tool Transfer (WINDOWS - sysmon)
id: 0125d181-bda2-46bd-928d-b90c035008a5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.ignoble_scorpius
