title: Network Share Discovery (GOOGLE - workspace)
id: 42b06edc-4ce2-443f-8340-50e9dfee5c58
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1135.
  Threat Actor: APT38
references:
  - https://attack.mitre.org/techniques/T1135/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1135
  - actor.apt38
