title: System Service Discovery - ALPHV-BlackCat (auditd)
id: deb22175-0f5a-4c66-bd95-79c4f53c4ca0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1007 (System Service Discovery).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1007
  - actor.alphv-blackcat
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains: '/crontab'
    cmd|contains: ' -l'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
