title: Data Transfer Size Limits - ALPHV-BlackCat (auditd)
id: 4924c836-7c49-4e51-998d-7f6d592bf678
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1030 (Data Transfer Size Limits).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1030/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_split_file_into_pieces.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1030
  - actor.alphv-blackcat
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'SYSCALL'
    comm|contains: 'split'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
