title: Network Service Discovery - ALPHV-BlackCat (auditd)
id: b3e4ddaf-7a9b-42c9-b5fc-8538eb757e1e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1046 (Network Service Discovery).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_network_service_scanning.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1046
  - actor.alphv-blackcat
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - '/telnet'
      - '/nmap'
      - '/netcat'
      - '/nc'
    key|contains: 'network_connect_4'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
