title: Application Layer Protocol - ALPHV-BlackCat (auditd)
id: fc46022f-f204-4cc2-a62a-0876f9a6ebdf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1071 (Application Layer Protocol).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_susp_c2_commands.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1071
  - actor.alphv-blackcat
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    key|contains: 'susp_activity'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
