title: Local Account - ALPHV-BlackCat (auditd)
id: 0b20249e-13e1-4983-b765-fa560fe6af08
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.001 (Local Account).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.001
  - actor.alphv-blackcat
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains:
      - '/lastlog'
      - '/id'
      - '/lsof'
    cmd|contains:
      - '''x:0:'''
      - '/cat'
      - '/ed'
      - '/head'
      - '/more'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
