title: Data Staged - BQTLock (workspace)
id: 7ce3e3e8-9eac-405c-a257-fcb0bfd00e1b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1074 (Data Staged).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1074
  - actor.bqtlock
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category|contains: 'iam'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
