title: Valid Accounts - Cicada3301Repellent Scorpius (unified_logging)
id: f9d602d7-e475-4e53-9ef4-4acc4bddf1cb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078 (Valid Accounts).
  Associated threat actor: Cicada3301Repellent Scorpius
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_login_failures.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078
  - actor.cicada3301repellent_scorpius
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    event.action|contains: 'failed-log-in-too-many-times-to'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
