title: Exfiltration Over Unencrypted Non-C2 Protocol (LINUX - auditd)
id: ecc3f6ad-3ad9-469d-a905-0ebaba810153
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1048.003.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1048.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'wget'
    CommandLine|contains|contains:
      - 'http.server'
      - 'SimpleHTTPServer'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1048.003
  - actor.kazu
