title: Systemd Service (LINUX - auditd)
id: 7e069c22-678b-49dc-8eab-fadc4366add6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.002.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1543.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    a0|contains|contains:
      - 'systemctl'
      - 'service'
    nametype|contains:
      - 'CREATE'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.002
  - actor.kazu
