title: Exfiltration Over Web Service (LINUX - auditd)
id: 88205f98-c3cc-490d-948a-2e7581cfdd0f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/curl'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.kazu
