title: At - Qilin (security)
id: f3cb3597-687e-49d6-b2ea-d5f0fa693a60
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053.002 (At).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1053/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_atsvc_task.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053.002
  - actor.qilin
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5145'
    ShareName|contains: '\\\\\*\\IPC$' # looking for the string \\*\IPC$'
    RelativeTargetName|contains: 'atsvc'
    AccessList|contains: 'WriteData'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
