title: Abuse Elevation Control Mechanism - Qilin (security)
id: 58a192a4-e018-4b76-86fc-034769cc24b8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1548 (Abuse Elevation Control Mechanism).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_privesc_kerberos_relay_over_ldap.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1548
  - actor.qilin
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '3'
    AuthenticationPackageName|contains: 'Kerberos'
    IpAddress|contains: '127.0.0.1'
    TargetUserSid|contains:
      - 'S-1-5-21-'
      - '-500'
    IpPort|contains: '0'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
