title: Pass the Ticket - Qilin (security)
id: 5cfccd6f-f91f-47fd-a1f6-56293648232e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1550.003 (Pass the Ticket).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1550/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/lateral_movement_credential_access_kerberos_correlation.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1550.003
  - actor.qilin
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.executable|contains:
      - 'C:\\Windows\\System32\\svchost.exe'
      - 'F:\\IGEL\\RemoteManager\\*\\bin\\tomcat10.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
