title: Modify Registry (WINDOWS - sysmon)
id: 4a6ebe8d-4332-4b27-953a-7e13e341e177
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1112.
  Threat Actor: APT19
references:
  - https://attack.mitre.org/techniques/T1112/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\dnscmd.exe'
    CommandLine|contains|all|contains:
      - ' add '
      - '\SYSTEM\CurrentControlSet\Control\MiniNt'
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1112
  - actor.apt19
