title: Windows Management Instrumentation - Vice Society (security)
id: 21561698-05fd-46a3-88c2-c33029f878d2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1047 (Windows Management Instrumentation).
  Associated threat actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_wmi_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1047
  - actor.vice_society
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    ProcessName|contains: '\WmiPrvSE.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
