title: NTDS (WINDOWS - security)
id: b2d89e32-a992-4f5d-b02b-6d09b4200ec2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
    CommandLine|contains|all|contains:
      - 'mklink'
      - 'HarddiskVolumeShadowCopy'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.bianlian
