title: Obfuscated Files or Information (WINDOWS - security)
id: 52944090-76a0-419f-be71-fd2d6bceaf2f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'cmd'
      - 'powershell'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.bianlian
