title: Masquerade Task or Service (WINDOWS - security)
id: 07d36e4e-13e0-427d-b10e-ef00f9642056
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.bianlian
