title: Valid Accounts (WINDOWS - security)
id: 97bea7f3-593d-402b-9e4b-6f8ae716b567
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.bianlian
