title: Domain Account (WINDOWS)
id: b1d3c88d-a83d-437b-9087-5622939ab54f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
