title: Develop Capabilities (WINDOWS - security)
id: 82aad9ac-2caf-4a31-8270-66f6ca25f161
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1587.
  Threat Actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1587/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'xyz123456.exe'
      - 'PurpleSharp'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1587
  - actor.bianlian
