title: 7dd95ff6-712e-4056-9626-312ea4ab4c5e (GOOGLE)
id: f296dc82-2025-48e0-a0d0-77a2c225cdfc
description: >
  Detects techniques consistent with MITRE ATT&CK technique 7dd95ff6-712e-4056-9626-312ea4ab4c5e.
references:
  - https://attack.mitre.org/techniques/7dd95ff6-712e-4056-9626-312ea4ab4c5e/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.7dd95ff6-712e-4056-9626-312ea4ab4c5e
