title: Abuse Elevation Control Mechanism (LINUX - auditd)
id: 3655413f-4ab3-4379-9d61-31a0cb9b759b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'getcap'
    Image|endswith|contains:
      - '/setcap'
    CommandLine|contains|contains:
      - 'cap_setuid'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.donex
