title: Windows Management Instrumentation - BlackBasta (sysmon)
id: fdf62569-4c64-484a-840e-52732189a6b2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1047 (Windows Management Instrumentation).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_suspicious_wmi_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1047
  - actor.blackbasta
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'WMIC.exe'
    process.pe.original_file_name|contains: 'wmic.exe'
    process.args|contains:
      - 'format*:*'
      - '*-format*:*'
    process.command_line|contains:
      - '* /format:table *'
      - '* /format:table'
    event.action|contains: 'Image loaded*'
    dll.name|contains:
      - 'jscript.dll'
      - 'vbscript.dll'
    file.name|contains:
      - 'jscript.dll'
      - 'vbscript.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
