title: JavaScript - BlackBasta (sysmon)
id: b59a58dc-392e-46e2-b2e1-1bcf9bcbe3a8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.007 (JavaScript).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1059/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_suspicious_jar_child_process.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.007
  - actor.blackbasta
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.type|contains: 'start'
    process.parent.name|contains: 'java'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
