title: Steal or Forge Kerberos Tickets - BlackBasta (sysmon)
id: 6e1ddfbc-2cf1-46a6-84e2-2d1ee60ec3fb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558 (Steal or Forge Kerberos Tickets).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1558/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558
  - actor.blackbasta
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
