title: Disable or Modify System Firewall - BlackBasta (sysmon)
id: 31f5511d-0f20-4139-8cbe-4fc6e7fc08d2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.004 (Disable or Modify System Firewall).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1562/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_disable_windows_firewall_rules_with_netsh.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.004
  - actor.blackbasta
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'netsh.exe'
    process.args|contains: 'state'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
