title: DLL - BlackBasta (sysmon)
id: 938c21f1-c55b-4326-87ff-c863baf3e10b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574.001 (DLL).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_amsi_bypass_dllhijack.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574.001
  - actor.blackbasta
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.name|contains:
      - 'amsi.dll'
      - 'amsi'
    file.path|contains:
      - '?:\\$SysReset\\CloudImage\\Package_for_RollupFix*\\amsi.dll'
      - '\\\\?\\Volume{*}\\Windows\\syswow64\\amsi.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
