title: Service Execution (WINDOWS - defender)
id: e3f7b84a-8d15-4a28-a65d-970a5d2f13ec
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1569.002.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1569.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' start '
    Image|endswith|contains:
      - '\csexec.exe'
    Description|contains:
      - 'csexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1569.002
  - actor.blackbasta
