title: Scheduled Task (M365 - entra_id)
id: 2f6b2804-a2cf-4ffb-a504-b2c68225757d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.005.
  Threat Actor: Rancor
references:
  - https://attack.mitre.org/techniques/T1053.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.005
  - actor.rancor
