title: Software Deployment Tools (WINDOWS - security)
id: 5d809801-f722-48c1-84a5-6cc341407a89
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Silence
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.silence
