title: Windows Management Instrumentation Event Subscription (WINDOWS - defender)
id: 9b538d54-bddf-4c34-9988-99a8d7a8fd88
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.003.
  Threat Actor: APT33
references:
  - https://attack.mitre.org/techniques/T1546.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\EdgeTransport.exe'
    CommandLine|contains|all|contains:
      - 'ActiveScriptEventConsumer'
      - ' CREATE '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.003
  - actor.apt33
