title: Network Share Discovery - Medusa (defender)
id: 67a5e67b-71a2-4ef0-aebf-132da2e682a0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1135 (Network Share Discovery).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_posh_invoke_sharefinder.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1135
  - actor.medusa
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Invoke-ShareFinder'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
