title: System Shutdown/Reboot - Medusa (defender)
id: b21c0135-285d-40dd-969f-7754aa58145a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1529 (System Shutdown/Reboot).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1529
  - actor.medusa
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName|contains:
      - '\shutdown.exe'
      - '/r '
      - '/s '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
