title: Service Execution - Medusa (defender)
id: d0050875-6716-4204-8620-8c96faa78d97
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1569.002 (Service Execution).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1569/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_psexec_lateral_movement_command.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1569.002
  - actor.medusa
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'PsExec.exe'
    process.args|contains: '-accepteula'
    process.executable|contains:
      - '?:\\ProgramData\\Docusnap\\Discovery\\discovery\\plugins\\17\\Bin\\psexec.exe'
      - '?:\\Program Files\\Docusnap X\\Tools\\dsDNS.exe'
    process.parent.executable|contains: '?:\\Program Files (x86)\\Cynet\\Cynet Scanner\\CynetScanner.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
