title: Data Encrypted for Impact (GOOGLE - workspace)
id: 1871f42d-959b-4c60-8a41-67a55ba8d063
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1486.
  Threat Actor: AlphaLocker
references:
  - https://attack.mitre.org/techniques/T1486/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1486
  - actor.alphalocker
