title: Valid Accounts (WINDOWS - security)
id: d1294805-0a91-4892-a88a-6b4bf8667559
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.kazu
