title: Boot or Logon Autostart Execution (WINDOWS)
id: 1d98ca93-a364-4b48-a32c-1be149191cae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.
references:
  - https://attack.mitre.org/techniques/T1547/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547
