title: PowerShell (WINDOWS - security)
id: 14a99de5-c4d8-4a5a-946e-865802b1f666
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Devman's Ransomware
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'cmd'
      - '"set'
      - '-f'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.devman's_ransomware
