title: NTDS (WINDOWS - defender)
id: fe1b08f9-3c9f-4af9-a85e-e0924deb682e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.rhysida
