title: System Network Configuration Discovery (WINDOWS - defender)
id: d8c30d7f-42f3-4fcc-a832-13979ffea55b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.rhysida
