title: Indicator Removal (WINDOWS - defender)
id: 1764e36e-7868-49b7-8a98-8d3248a6b192
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1070/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'unload'
    CommandLine|contains|all|contains:
      - 'unload'
      - 'sysmon'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070
  - actor.rhysida
