title: Security Software Discovery (WINDOWS - defender)
id: edc28921-db4e-415f-be58-b48994bc2674
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - ' avira'
      - ' avira"'
      - ' cb'
    CommandLine|contains|contains:
      - ' 385201'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.rhysida
