title: Active Scanning (WINDOWS - defender)
id: b6edf1ed-ad46-44b2-984f-86c94aefe379
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.rhysida
