title: Timestomp - Magaskosh (security)
id: 7ce52dba-04e3-4c2c-b5e4-ef4c24b0fa28
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070.006 (Timestomp).
  Associated threat actor: Magaskosh
references:
  - https://attack.mitre.org/techniques/T1070/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_time_modification.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070.006
  - actor.magaskosh
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4616'
    ProcessName|contains: 'C:\Windows\System32\svchost.exe'
    SubjectUserSid|contains:
      - 'S-1-5-19'
      - 'C:\Program Files\VMware\VMware Tools\vmtoolsd.exe'
      - 'C:\Program Files (x86)\VMware\VMware Tools\vmtoolsd.exe'
      - 'C:\Windows\System32\VBoxService.exe'
      - 'C:\Windows\System32\oobe\msoobe.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
