title: Phishing (MACOS - unified_logging)
id: 128f8f45-0c4c-4cc0-bc64-f8701e83733c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.cephalus
