title: Inhibit System Recovery (MACOS - unified_logging)
id: 0a0b7fb1-6c10-4946-aed4-ea553d1a0d8a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1490.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1490/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'addexclusion'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1490
  - actor.blacksuit
