title: Group Policy Preferences (GOOGLE - workspace)
id: 38a3f376-69a2-4240-bdf6-6fc75209719d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.006.
  Threat Actor: APT33
references:
  - https://attack.mitre.org/techniques/T1552.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.006
  - actor.apt33
