title: NTFS File Attributes (WINDOWS - sysmon)
id: b3621641-40db-4a9a-b774-2368c795f9df
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.004.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1564.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -s '
    CommandLine|contains|all|contains:
      - 'diantz.exe'
      - '.cab'
    CommandLine|re|contains:
      - ':[^\\]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.004
  - actor.rhysida
