title: Windows Service - Qilin (auditd)
id: c405e29f-9e6f-4010-94a2-1bf980c73703
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1543.003 (Windows Service).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1543/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_susp_special_file_creation_via_mknod_syscall.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1543.003
  - actor.qilin
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'SYSCALL'
    SYSCALL|contains: 'mknod'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
