title: Non-Standard Port - Kazu (workspace)
id: 64628ac5-575d-4178-be7d-47963dc5fb1d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1571 (Non-Standard Port).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1571/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_linux_port_knocking_reverse_connection.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1571
  - actor.kazu
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains:
      - 'python*'
      - 'ksh'
    process.executable|contains:
      - '/usr/bin/*'
      - '/bin/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
