title: T0219 (WINDOWS - defender)
id: c50bdb13-ac20-47c5-abb3-dbacd2b91dd6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T0219.
  Threat Actor: PEAR
references:
  - https://attack.mitre.org/techniques/T0219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'rundll32.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T0219
  - actor.pear
