title: Malicious Copy and Paste (WINDOWS - defender)
id: 286104fd-226a-47dc-a973-3dfc3b494fe2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.004.
  Threat Actor: PEAR
references:
  - https://attack.mitre.org/techniques/T1204.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\brave.exe'
      - '\chrome.exe'
      - '\firefox.exe'
    CommandLine|contains|contains:
      - '#'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.004
  - actor.pear
