title: Binary Padding (WINDOWS - security)
id: 36f8a168-fb1c-46f0-9d31-26d18e23e7b1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.001.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1027.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    param1|contains|contains:
      - '\CSFalconServiceUninstallTool_'
      - '\Program Files\CrowdStrike\'
      - '\Windows\System32\ScriptControl64_'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.001
  - actor.leviathan
