title: External Remote Services (WINDOWS - security)
id: 3bc6104a-8d7f-4447-ad46-e662ddbc9364
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.leviathan
