title: Shortcut Modification (WINDOWS - security)
id: 81987b0e-5e15-4a91-a606-4e7b51873f0f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.009.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1547.009/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'File'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.009
  - actor.leviathan
