title: Exfiltration Over Unencrypted Non-C2 Protocol (WINDOWS - defender)
id: c19d21fc-f70d-4a99-8f24-5b35e4be84a3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1048.003.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1048.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\svchost.exe'
    ParentCommandLine|contains|contains:
      - '-s WebClient'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1048.003
  - actor.kazu
