title: Non-Application Layer Protocol (WINDOWS - defender)
id: 57f3bec8-d664-4230-85ae-4837340ca636
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1095.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1095/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1095
  - actor.kazu
