title: Hide Artifacts (WINDOWS - defender)
id: e7932d24-653b-4412-b0f9-0398ab8c547e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.blacksuit
