title: Shortcut Modification (WINDOWS - security)
id: 4e3cc2e0-4fb6-4e84-920c-eda644599cfe
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.009.
  Threat Actor: APT39
references:
  - https://attack.mitre.org/techniques/T1547.009/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'File'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.009
  - actor.apt39
