title: Remote Desktop Protocol (GOOGLE - workspace)
id: 6533eef2-fba7-4116-9112-a407996b602b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.001.
  Threat Actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1021.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.001
  - actor.chaos
