title: Cloud Accounts - Chaos (entra_id)
id: 98b0071e-0542-4890-99d7-dafc6e0c3bfa
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.004 (Cloud Accounts).
  Associated threat actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.004
  - actor.chaos
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    event.dataset|contains: 'google_workspace.token'
    event.action|contains: 'authorize'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
