title: Unusual GCP Event for a User
id: 5e695d10-5e69-4e69-ae69-5e695d100000
status: stable
description: Detection rule for MITRE ATT&CK technique T1021.007
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/gcp/ml_gcp_rare_method_by_user.toml
author: elastic (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1021.007
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original elastic detection logic
    # No detection logic available
  condition: selection
level: medium
