title: O365 DLP Rule Triggered
id: 96eb03ac-3d78-4ab8-a854-cf43a7b41441
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_dlp_rule_triggered.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    Operation: 'DLPRuleMatch'
    src_user: 'UserId,'
    file_name: 'case(NOT'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
