title: Kubernetes Cron Job Creation
id: 80c7079f-a842-4e73-bd6a-0ab8b7071b32
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.007.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1053/007/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/kubernetes_cron_job_creation.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1053.007
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    verb: 'create'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
