title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: 83114e07-7c20-43db-938a-fbba2c53d3bc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1069/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1069.003
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset:
      - 'azure.activitylogs'
      - 'o365.audit'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
