title: GCP Authentication Failed During MFA Challenge
id: e832b23f-6cf4-4834-ac72-8bf1f0651b8d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
