title: Entra ID Protection - Risk Detection - Sign-in Risk
id: 8e3625e2-4d28-482d-adaf-526f7607f0f2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/initial_access_entra_id_protection_sign_in_risk_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1071
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'azure.identity_protection'
    event.action: 'User Risk Detection'
    azure.identityprotection.properties.activity: 'signin'
    azure.identityprotection.properties.risk_state: 'remediated'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
