title: Google Cloud Kubernetes Admission Controller
id: 74dbb84a-74db-44db-a4db-74dbb84a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1078
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_kubernetes_admission_controller.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         gcp.audit.method_name|startswith: 'admissionregistration.k8s.io.v'
    #         gcp.audit.method_name|contains:
    #             - '.mutatingwebhookconfigurations.'
    #             - '.validatingwebhookconfigurations.'
    #         gcp.audit.method_name|endswith:
    #             - 'create'
    #             - 'patch'
    #             - 'replace'
    #     condition: selection
    # 
  condition: selection
level: medium
