title: AWS IAM Principal Enumeration via UpdateAssumeRolePolicy
id: 2aed2454-dae7-48b0-a4e9-9dd8e1e27a95
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1087/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/discovery_iam_principal_enumeration_via_update_assume_role_policy.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1087.004
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'UpdateAssumeRolePolicy'
    aws.cloudtrail.error_code: 'MalformedPolicyDocumentException'
    event.outcome: 'failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
