title: GCP Access Policy Deleted
id: bdea6817-9da7-48d2-bcce-a2de1d2c7ddc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/audit/gcp_access_policy_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
      selection:
          data.protoPayload.authorizationInfo.permission:
              - 'accesscontextmanager.accessPolicies.delete'
              - 'accesscontextmanager.accessPolicies.accessLevels.delete'
              - 'accesscontextmanager.accessPolicies.accessZones.delete'
              - 'accesscontextmanager.accessPolicies.authorizedOrgsDescs.delete'
          data.protoPayload.authorizationInfo.granted: 'true'
          data.protoPayload.serviceName: 'accesscontextmanager.googleapis.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
