title: Okta Non-Standard VPN Usage
id: 1f042ac2-feb8-43aa-8539-b9c7753c6184
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1090/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/okta_non_standard_vpn_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1090
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    user:
      - 'coalesce('
      - 'mvindex(split(user,'
    status: 'case(match(_raw,'
    value: 'N/A'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
