title: Google Workspace Application Access Level Modified
id: fabc53b2-a1de-4f3d-9ac1-3f6d9e4de4aa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/gworkspace/gcp_gworkspace_application_access_levels_modified.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098.003
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
      selection:
          eventService: 'admin.googleapis.com'
          eventName: 'CHANGE_APPLICATION_SETTING'
          setting_name|startswith: 'ContextAwareAccess'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
