title: AWS EC2 Export Task
id: af11b439-388b-4ad0-bd0b-0f4c4d126509
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1119.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/exfiltration_ec2_export_task.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1119
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'ec2.amazonaws.com'
    event.action: 'CreateInstanceExportTask'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
