title: GCP Multiple Users Failing To Authenticate From Ip
id: 3f35e3b8-e9e1-426e-9ed8-f5a2e174548f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_multiple_users_failing_to_authenticate_from_ip.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.004
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    type: 'login'
    name: 'login_failure'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
