title: GCP Multiple Users Failing To Authenticate From Ip
id: 013b5c26-013b-413b-a13b-013b5c260000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_multiple_users_failing_to_authenticate_from_ip.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1110.003
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original splunk detection logic
    # `gws_reports_login` event.type = login event.name = login_failure | bucket
    #   span=5m _time | stats count dc(user) AS unique_accounts values(user) as tried_accounts
    #   values(authentication_method) AS authentication_method earliest(_time) as firstTime
    #   latest(_time) as lastTime by _time event.name src app id.applicationName | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` |  where unique_accounts > 20 | `gcp_multiple_users_failing_to_authenticate_from_ip_filter`
  condition: selection
level: medium
