title: O365 SharePoint Malware Detection
id: 6faa050a-45d5-4f51-84ad-f13f20ad81d5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_sharepoint_malware_detection.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204.002
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    Operation: 'FileMalwareDetected'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
