title: Risk Rule for Dev Sec Ops by Repository
id: 714afac5-a4f7-465b-bb8b-a168a7927e5a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/risk_rule_for_dev_sec_ops_by_repository.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204.003
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    datamodel: 'Risk.All_Risk'
    analyticstories: 'Dev'
    risk_object_type: 'other'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
