title: AWS IAM SAML Provider Updated
id: 9c9be12f-e4ba-42a4-8972-94c288d3639a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/privilege_escalation_iam_saml_provider_updated.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1484
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'UpdateSAMLProvider'
    event.outcome: 'success'
    source.address: 'sso.amazonaws.com'
    user_agent.original: 'sso.amazonaws.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
