title: GCP Multi-Factor Authentication Disabled
id: d902c42f-c20a-4091-b508-9cd0f45fb9f3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.006.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1556/006/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_multi_factor_authentication_disabled.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1556.006
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    command: 'UNENROLL_USER_FROM_STRONG_AUTH'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
