title: GCP Multi-Factor Authentication Disabled
id: 2e0c4de9-2e0c-4e0c-ae0c-2e0c4de90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1556.006
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_multi_factor_authentication_disabled.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1556.006
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original splunk detection logic
    # `gws_reports_admin` command=UNENROLL_USER_FROM_STRONG_AUTH | stats count
    #   min(_time) as firstTime max(_time) as lastTime by user, command, actor.email, status,
    #   id.applicationName, event.name, vendor_account, action | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`| `gcp_multi_factor_authentication_disabled_filter`
  condition: selection
level: medium
