title: AWS IAM Deactivation of MFA Device
id: c3d6020d-2e4e-4017-b5fe-ae6991eeed27
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1556/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/impact_iam_deactivate_mfa_device.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1556
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'DeactivateMFADevice'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
