title: AWS EC2 Unauthorized Admin Credential Fetch via Assumed Role
id: f59b5dd0-702a-40a1-ba10-d658ec4a60a8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.005.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1552/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/credential_access_aws_getpassword_for_ec2_instance.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1552.005
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'ec2.amazonaws.com'
    event.action: 'GetPasswordData'
    aws.cloudtrail.user_identity.type: 'AssumedRole'
    aws.cloudtrail.error_code: 'Client.UnauthorizedOperation'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
