title: GSuite Email Suspicious Attachment
id: 47b97d56-9dbe-4d4d-9d95-1dd190368805
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gsuite_email_suspicious_attachment.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    phase: 'plan'
    severity: 'medium'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
