title: Okta Non-Standard VPN Usage
id: aa4e3702-4bc9-4fb0-ad49-cf1bd44823d0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1572.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1572/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/okta_non_standard_vpn_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1572
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    user:
      - 'coalesce('
      - 'mvindex(split(user,'
    status: 'case(match(_raw,'
    value: 'N/A'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
