title: GCP Authentication Failed During MFA Challenge
id: 5bea12af-5bea-4bea-abea-5bea12af0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1586.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1586.003
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original splunk detection logic
    # `gws_reports_login` event.name=login_failure `gws_login_mfa_methods` | stats
    #   count min(_time) as firstTime max(_time) as lastTime by user, src_ip, login_challenge_method
    #   | `gcp_authentication_failed_during_mfa_challenge_filter`
  condition: selection
level: medium
