title: AWS Route 53 Private Hosted Zone Associated With a VPC
id: 7c653df2-0f10-47c4-98da-ebe2dd5224c1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1583.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1583/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_route_53_hosted_zone_associated_with_a_vpc.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1583.001
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'route53.amazonaws.com'
    event.action: 'AssociateVPCWithHostedZone'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
