title: AWS Route 53 Domain Transfer Lock Disabled
id: 8872fc73-c24c-4d89-a153-681c1b54ac68
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1584.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1584/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_route_53_domain_transfer_lock_disabled.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1584.001
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'route53domains.amazonaws.com'
    event.action: 'DisableDomainTransferLock'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
