title: GCP Authentication Failed During MFA Challenge
id: 333f24c7-b9f7-401b-a17e-1419d3cd2bec
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
