title: AWS Route 53 Domain Transfer Lock Disabled
id: 10eeb28d-4d7c-4021-b4fe-6cc4dd5f1944
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1584.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1584/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_route_53_domain_transfer_lock_disabled.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1584
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'route53domains.amazonaws.com'
    event.action: 'DisableDomainTransferLock'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
