title: AWS SNS Topic Created by Rare User
id: 5bd788d9-61c4-4f17-a515-48217b4a03e7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1608.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1608/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/resource_development_sns_topic_created_by_rare_user.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1608
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'sns.amazonaws.com'
    event.action: 'CreateTopic'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
