title: GCP Authentication Failed During MFA Challenge
id: 5040c8dd-e971-4086-8997-fe230e873b12
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1621.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1621
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    name: 'login_failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
