title: GCP Authentication Failed During MFA Challenge
id: 7e057c72-7e05-4e05-ae05-7e057c720000
status: stable
description: Detection rule for MITRE ATT&CK technique T1621
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gcp_authentication_failed_during_mfa_challenge.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1621
logsource:
  product: gcp
  service: audit
detection:
  selection:
    # Original splunk detection logic
    # `gws_reports_login` event.name=login_failure `gws_login_mfa_methods` | stats
    #   count min(_time) as firstTime max(_time) as lastTime by user, src_ip, login_challenge_method
    #   | `gcp_authentication_failed_during_mfa_challenge_filter`
  condition: selection
level: medium
