title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: d32ae1ab-2aac-487e-bc32-4662c3676ad6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1673.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1673/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1673
logsource:
  product: gcp
  service: audit
  category: cloud_audit
detection:
  selection:
    event.dataset:
      - 'azure.activitylogs'
      - 'o365.audit'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
