title: Proxy (M365 - entra_id)
id: 85e7257e-571e-447b-8a5c-c9ce31980a96
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1090.
  Threat Actor: Cuba
references:
  - https://attack.mitre.org/techniques/T1090/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1090
  - actor.cuba
