title: SMB/Windows Admin Shares - BianLian (unified_logging)
id: c54f512e-17ac-4d92-9e07-ec6ffbf7ef40
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.002 (SMB/Windows Admin Shares).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/lateral_movement_mounting_smb_share.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.002
  - actor.bianlian
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line|contains: 'osascript*mount volume*smb://*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
