title: Valid Accounts - BianLian (unified_logging)
id: 1417207d-019b-4246-90fe-d0965417829e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078 (Valid Accounts).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_login_failures.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078
  - actor.bianlian
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    event.action|contains: 'failed-log-in-too-many-times-to'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
