title: Ingress Tool Transfer - BianLian (unified_logging)
id: 28265137-a0bd-4fa7-8d3f-5a3810719d71
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1105 (Ingress Tool Transfer).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/command_and_control_google_drive_malicious_file_download.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1105
  - actor.bianlian
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'Microsoft Edge'
      - 'wget.exe'
    process.command_line|contains: '*confirm=no_antivirus*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
