title: Server Software Component - BianLian (unified_logging)
id: b45b0044-0748-493d-a4d7-16ee1e3aaf12
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505 (Server Software Component).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1505/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_shell_activity_by_web_server.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505
  - actor.bianlian
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'apache'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
