title: Local Account - ALPHV-BlackCat (sysmon)
id: acf9dfc5-0657-44b2-868b-63d05fcf5694
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.001 (Local Account).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_admin_recon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.001
  - actor.alphv-blackcat
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'wmic.exe'
    process.parent.name|contains: 'net.exe'
    process.args|contains:
      - 'group'
      - 'useraccount'
    user.id|contains:
      - 'S-1-5-18'
      - 'S-1-5-20'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
