title: Lateral Tool Transfer - ALPHV-BlackCat (sysmon)
id: 7a1fd88a-1c0a-4b47-bac9-9d3aa2520cd3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1570 (Lateral Tool Transfer).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1570/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_psexec_lateral_movement_command.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1570
  - actor.alphv-blackcat
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'PsExec.exe'
    process.args|contains: '-accepteula'
    process.executable|contains:
      - '?:\\ProgramData\\Docusnap\\Discovery\\discovery\\plugins\\17\\Bin\\psexec.exe'
      - '?:\\Program Files\\Docusnap X\\Tools\\dsDNS.exe'
    process.parent.executable|contains: '?:\\Program Files (x86)\\Cynet\\Cynet Scanner\\CynetScanner.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
