title: Valid Accounts (WINDOWS - security)
id: 64eaa144-cda0-406e-96f2-73f54212edb0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: BlackCatALPHV
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.blackcatalphv
