title: Encrypted Channel - ALPHV-BlackCat (entra_id)
id: d39da376-4446-40c5-a84c-5ede1f468a49
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1573 (Encrypted Channel).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_detection/microsoft365_from_susp_ip_addresses.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1573
  - actor.alphv-blackcat
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    eventSource|contains: 'SecurityComplianceCenter'
    eventName|contains: 'Activity from suspicious IP addresses'
    status|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
