title: Spearphishing Link (M365 - entra_id)
id: eca131db-ce4d-40a9-8671-7f6c28b060d5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: BlackTech
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.blacktech
