title: LSA Secrets - INC Ransom (security)
id: 6e32eb8a-81c4-48d9-8f9f-1695e5364f13
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.004 (LSA Secrets).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1003/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_dpapi_domain_backupkey_extraction.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.004
  - actor.inc_ransom
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4662'
    ObjectType|contains: 'SecretObject'
    AccessMask|contains: '0x2'
    ObjectName|contains: 'BCKUPKEY'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
