title: Visual Basic - INC Ransom (security)
id: 28cb9513-155d-42ab-9316-255b6851c6b9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.005 (Visual Basic).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_remote_file_copy_scripts.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.005
  - actor.inc_ransom
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'wscript.exe'
      - 'cscript.exe'
    network.direction|contains:
      - 'outgoing'
      - 'egress'
    file.extension|contains:
      - 'exe'
      - 'dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
