title: Screen Capture - INC Ransom (security)
id: 1b9dbf27-0e90-484f-b138-28f2f8834e6a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_screen_grabber.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.inc_ransom
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
