title: Modify Registry - INC Ransom (security)
id: bbe83964-8914-40e6-9e1f-73e1ee8b3180
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1112 (Modify Registry).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_dot_net_etw_tamper.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1112
  - actor.inc_ransom
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4657'
      - '4657'
    ObjectName|contains:
      - '\SOFTWARE\Microsoft\.NETFramework'
      - '\Environment'
    ObjectValueName|contains: 'ETWEnabled'
    NewValue|contains:
      - '0'
      - 'COMPlus_ETWEnabled'
      - 'COMPlus_ETWFlags'
      - '0'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
