title: Spearphishing Link - INC Ransom (security)
id: 6f2f4860-f6c1-4a8a-8bf8-31bb64cf9050
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.002 (Spearphishing Link).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.002
  - actor.inc_ransom
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
