title: Phishing - 8base (workspace)
id: 09db55f1-35bc-4e61-b12d-7ac51710625a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566 (Phishing).
  Associated threat actor: 8base
references:
  - https://attack.mitre.org/techniques/T1566/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566
  - actor.8base
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
