title: Malicious File (MACOS - unified_logging)
id: 4feffc8f-da56-4781-96b2-4b493143f642
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.002.
  Threat Actor: Tropic Trooper
references:
  - https://attack.mitre.org/techniques/T1204.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - 'Microsoft Word'
      - 'Microsoft Excel'
      - 'Microsoft PowerPoint'
    Image|endswith|contains:
      - '/bash'
      - '/curl'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.002
  - actor.tropic_trooper
