title: Group Policy Modification - BlackBasta (defender)
id: 1482a8e4-ea5c-42ed-a71a-6d241614b445
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1484.001 (Group Policy Modification).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1484/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/privilege_escalation_gpo_schtask_service_creation.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1484.001
  - actor.blackbasta
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.name|contains:
      - 'ScheduledTasks.xml'
      - 'Services.xml'
    file.path|contains:
      - '?:\\Windows\\SYSVOL\\domain\\Policies\\*\\MACHINE\\Preferences\\ScheduledTasks\\ScheduledTasks.xml'
      - '?:\\Windows\\SYSVOL\\domain\\Policies\\*\\MACHINE\\Preferences\\Services\\Services.xml'
    process.executable|contains: 'C:\\Windows\\System32\\dfsrs.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
