title: NTDS (WINDOWS - sysmon)
id: 2d9a95b7-1111-4181-b51f-5f6f65c549ad
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.lockbit
