title: Remote System Discovery (WINDOWS - sysmon)
id: 6f604c7e-1132-4f77-90ed-9dae261baed2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1018.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1018/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'domainlist'
      - 'trustdmp'
      - 'dcmodes'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1018
  - actor.lockbit
