title: Python (WINDOWS - sysmon)
id: 6293b6c0-7aab-48ea-97ef-8a82f1c10c9e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.lockbit
