title: Hide Artifacts (WINDOWS - sysmon)
id: 9564fcd6-ce01-4b80-af45-160ce98c7266
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.lockbit
