title: Encrypted Channel (WINDOWS)
id: 4fe55394-4ce0-4998-a1c8-b3c53650b8ef
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1573.
references:
  - https://attack.mitre.org/techniques/T1573/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'cipher.exe'
      - 'certutil.exe'
    CommandLine|contains:
      - '/e'
      - '/s'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1573
