title: System Language Discovery (WINDOWS - sysmon)
id: da085486-ee07-4408-884c-b2ad6bb19a7d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1614.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1614.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cmd.exe'
    ParentCommandLine|contains|windash|contains:
      - ' -c '
      - ' -r '
      - ' -k '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1614.001
  - actor.lockbit
