title: Data Encrypted for Impact - Hunters International (defender)
id: f87d6c0f-e09e-45bd-92b1-bb10c7463324
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1486 (Data Encrypted for Impact).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/impact_potential_linux_ransomware_file_encryption.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1486
  - actor.hunters_international
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.extension|contains: '?*'
    process.executable|contains:
      - './*'
      - '/run/*'
    file.path|contains:
      - '/home/*/Downloads/*'
      - '/var/www/*'
    process.name|contains:
      - 'dpkg'
      - 'suldownloader'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
