title: Portable Executable Injection - Rhysida (security)
id: fd768590-6491-4497-8a9d-616dcc01d0f3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1055.002 (Portable Executable Injection).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1055/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_posh_assembly_load.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1055.002
  - actor.rhysida
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'reflection.assembly]::Load('System.'
    file.name|contains: 'PathFunctions.ps1'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
