title: File and Directory Discovery - Rhysida (security)
id: 70a58022-093e-403f-9d8f-b4e0a2a4b119
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_file_dir_discovery.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.rhysida
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'tree.com'
    process.args|contains: 'dir'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
