title: Account Discovery - Rhysida (security)
id: 05babd68-12e0-4ecd-976b-c2c31b75ae47
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087 (Account Discovery).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1087/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_alert_ruler.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087
  - actor.rhysida
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4776'
    Workstation|contains:
      - 'RULER'
      - '4624'
      - '4625'
    WorkstationName|contains: 'RULER'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
