title: d4287702-e2f7-4946-bdfa-2c7f5aaa5032 (M365)
id: 8c8f7758-3b6d-4321-9582-8d240b36d4e0
description: >
  Detects techniques consistent with MITRE ATT&CK technique d4287702-e2f7-4946-bdfa-2c7f5aaa5032.
references:
  - https://attack.mitre.org/techniques/d4287702-e2f7-4946-bdfa-2c7f5aaa5032/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.d4287702-e2f7-4946-bdfa-2c7f5aaa5032
