title: NTDS (WINDOWS - defender)
id: 67588fbf-fa47-4e30-8ac5-e2ae55f223b1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.ignoble_scorpius
