title: Inhibit System Recovery (WINDOWS - defender)
id: da98e7f4-f4c6-4044-ba15-fe850110c079
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1490.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1490/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Win32_ShadowCopy'
    CommandLine|contains|all|contains:
      - 'copy '
      - '\\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1490
  - actor.ignoble_scorpius
