title: Redundant Access (WINDOWS - sysmon)
id: e2e5edb7-57fc-4100-8b18-e1918c6e3538
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1108.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1108/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'rundll32.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1108
  - actor.stormous
