title: Active Scanning (WINDOWS - sysmon)
id: 96e86e4e-63e2-4093-b6e5-5e56409fa659
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.stormous
