title: Active Scanning (WINDOWS - defender)
id: 0ae18371-9e8f-4a3b-8d2a-44b2fd35ed5f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: WannaCry
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.wannacry
