title: Hijack Execution Flow - AvosLocker (unified_logging)
id: 0db01500-7ac4-442f-8956-a0cae4bcd7b7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574 (Hijack Execution Flow).
  Associated threat actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1574/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_ld_preload_env_variable_process_injection.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574
  - actor.avoslocker
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.env_vars|contains:
      - 'LD_PRELOAD=?*'
      - 'LD_LIBRARY_PATH=?*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
