title: OS Credential Dumping (WINDOWS - defender)
id: a25681ce-149a-4b53-be84-80c0854216cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    Hashes|contains|contains:
      - 'IMPHASH=BCCA3C247B619DCD13C8CDFF5F123932'
      - 'IMPHASH=3A19059BD7688CB88E70005F18EFC439'
      - 'IMPHASH=bf6223a49e45d99094406777eb6004ba'
    Company|contains:
      - 'Cube0x0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.apt32
