title: O365 Privileged Graph API Permission Assigned
id: 665c1020-665c-465c-a65c-665c10200000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_privileged_graph_api_permission_assigned.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1003.002
logsource:
  product: m365
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `o365_management_activity` Workload=AzureActiveDirectory Operation=\"Update application.\" 
    #   | eval newvalue = mvindex('ModifiedProperties{}.NewValue',0) 
    #   | spath input=newvalue 
    #   | search \"{}.RequiredAppPermissions{}.EntitlementId\"=\"1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9\" OR \"{}.RequiredAppPermissions{}.EntitlementId\"=\"06b708a9-e830-4db3-a914-8e69da51d44f\" OR \"{}.RequiredAppPermissions{}.EntitlementId\"=\"9e3f62cf-ca93-4989-b6ce-bf83c28f9fe8\" 
    #   | eval Permissions = '{}.RequiredAppPermissions{}.EntitlementId' 
    #   | fillnull 
    #   | stats count earliest(_time) as firstTime latest(_time) as lastTime values(Permissions) by user src object user_agent signature vendor_account vendor_product dest
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)` 
    #   | `o365_privileged_graph_api_permission_assigned_filter`
  condition: selection
level: medium
