title: O365 ApplicationImpersonation Role Assigned
id: 27e4ceee-27e4-47e4-a7e4-27e4ceee0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1098.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_applicationimpersonation_role_assigned.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1098.002
logsource:
  product: m365
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `o365_management_activity` Workload=Exchange Operation="New-ManagementRoleAssignment" Role=ApplicationImpersonation 
    #   | rename User as target_user  
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime by signature dest user src vendor_account vendor_product target_user 
    #   | `security_content_ctime(lastTime)` 
    #   | `o365_applicationimpersonation_role_assigned_filter`
  condition: selection
level: medium
