title: O365 Email Suspicious Search Behavior
id: 07c67930-07c6-47c6-a7c6-07c679300000
status: stable
description: Detection rule for MITRE ATT&CK technique T1213.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_email_suspicious_search_behavior.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1213.002
logsource:
  product: m365
  service: general
detection:
  selection:
    # Original splunk detection logic
    # -
    #   `o365_management_activity` Operation=SearchQueryInitiatedExchange
    #   | eval command = case(Operation=="SearchQueryPerformed",SearchQueryText,true(),QueryText), UserId = lower(UserId), signature_id = CorrelationId, signature=Operation, src = ClientIP, user = lower(UserId), object_name=case(Operation=="SearchQueryPerformed",'EventData',true(),QuerySource), -time = _time, suspect_terms = case(match(command, `o365_suspect_search_terms_regex`),command,true(),null())
    #   | where command != "*" AND command != "(*)" 
    #   | bin _time span=1hr
    #   | `o365_email_suspicious_search_behavior_filter`
    #   | stats values(ScenarioName) as app, values(object_name) as object_name values(command) as command, values(suspect_terms) as suspect_terms, values(src) as src, dc(suspect_terms) as suspect_terms_count, dc(command) as count, min(-time) as firstTime, max(-time) as lastTime by user,signature,_time
    #   | where count > 20 OR suspect_terms_count >= 2
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)`
  condition: selection
level: medium
