title: O365 Cross-Tenant Access Change
id: 0ec63570-0ec6-4ec6-aec6-0ec635700000
status: stable
description: Detection rule for MITRE ATT&CK technique T1484
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_cross_tenant_access_change.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1484
logsource:
  product: m365
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `o365_management_activity` Workload=AzureActiveDirectory Operation IN (\"\
    #     Add a partner to cross-tenant access setting.\",\"Delete partner specific cross-tenant
    #     access setting.\") 
    #   | eval user = case(match(mvindex('Actor{}.ID',-1),\"User\"),mvindex('Actor{}.ID',0),match(mvindex('Actor{}.ID',-1),\"\
    #       ServicePrincipal\"),mvindex('Actor{}.ID',3),true(),mvindex('Actor{}.ID',0)) 
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime by dest user src vendor_account vendor_product signature signature_id 
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)` 
    #   | `o365_cross_tenant_access_change_filter`
  condition: selection
level: medium
