title: O365 Bypass MFA via Trusted IP
id: 2626646b-2626-4626-a626-2626646b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1562.007
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_bypass_mfa_via_trusted_ip.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1562.007
logsource:
  product: m365
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `o365_management_activity` Operation="Set Company Information." ModifiedProperties{}.Name=StrongAuthenticationPolicy 
    #   | rex max_match=100 field=ModifiedProperties{}.NewValue "(?<ip_addresses_new_added>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\/\d{1,2})" 
    #   | rex max_match=100 field=ModifiedProperties{}.OldValue "(?<ip_addresses_old>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\/\d{1,2})" 
    #   | eval ip_addresses_old=if(isnotnull(ip_addresses_old),ip_addresses_old,"0") 
    #   | mvexpand ip_addresses_new_added 
    #   | where isnull(mvfind(ip_addresses_old,ip_addresses_new_added)) 
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime values(ip_addresses_old) as ip_addresses_old by signature dest user src vendor_account vendor_product ip_addresses_new_added
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)` 
    #   | `o365_bypass_mfa_via_trusted_ip_filter`
  condition: selection
level: medium
