title: Local Data Staging (GOOGLE - workspace)
id: efae8bdd-a4a5-4262-8787-16f32836321d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1074.001.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1074.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1074.001
  - actor.safepay
