title: T1566.001 (GOOGLE - workspace)
id: 7b1d715f-a96a-4af8-81ff-aeb79f0cfa2f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.001.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1566.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.001
  - actor.safepay
