title: Digital Certificates (GOOGLE - workspace)
id: c55e828c-ba7a-4591-a894-3d5b213c3021
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1588.004.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1588.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1588.004
  - actor.safepay
