title: JavaScript - BlackBasta (auditd)
id: 0451c3b9-a73b-4c18-b4e6-26029cd37f81
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.007 (JavaScript).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1059/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_suspicious_jar_child_process.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.007
  - actor.blackbasta
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    event.type|contains: 'start'
    process.parent.name|contains: 'java'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
