title: Spearphishing Attachment - BlackBasta (auditd)
id: 8423b726-2310-46dc-b64e-3b6ae3b3a793
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.001 (Spearphishing Attachment).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/initial_access_security_compliance_user_reported_phish_malware.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.001
  - actor.blackbasta
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    rule.name|contains: 'Email reported by user as malware or phish'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
