title: DLL - BlackBasta (auditd)
id: 932c3906-4911-4119-822d-b9b9775f8a3a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574.001 (DLL).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_hidden_binary_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574.001
  - actor.blackbasta
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'PATH'
    name|contains:
      - '/.'
      - '/.cache/'
      - '/.config/'
      - '/.pyenv/'
      - '/.rustup/toolchains'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
