title: Virtualization/Sandbox Evasion - Hunt-Dharma-Crysis (sysmon)
id: ec87bbfe-3e5c-486e-ac12-9dda9f38aad1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1497 (Virtualization/Sandbox Evasion).
  Associated threat actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1497/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_delayed_via_ping_lolbas_unsigned.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1497
  - actor.hunt-dharma-crysis
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'wscript.exe'
    process.args|contains:
      - '?:\\windows\\syswow64\\msxml?.dll'
      - '?:\\Windows\\SysWOW64\\mschrt20.ocx'
    process.parent.name|contains: 'cmd.exe'
    user.id|contains: 'S-1-5-18'
    process.executable|contains: '?:\\Users\\*\\AppData\\*.exe'
    process.parent.command_line|contains: '*ScreenConnectConfigurator.cmd*'
    process.pe.original_file_name|contains: 'DPInst.exe'
    process.command_line|contains: 'driver\\DPInst_x64  /f '
    process.parent.args|contains: '?:\\Windows\\TempInst\\7z*'
    process.working_directory|contains:
      - '?:\\Windows\\TempInst\\*'
      - '?:\\Users\\*\\AppData\\Local\\Temp\\QBTools\\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
