title: Encrypted/Encoded File - LockBit (entra_id)
id: 3d15057c-b96a-4258-8234-1da9360a6f34
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.013 (Encrypted/Encoded File).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1027/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_encoding_rot13_python_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.013
  - actor.lockbit
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.name|contains: 'python*'
    file.name|contains: 'rot_??.cpython-*.pyc*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
