title: Default Accounts - LockBit (entra_id)
id: 24b354f3-9d81-4da3-ad62-59854c929346
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/kubernetes/initial_access_anonymous_request_authorized.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.lockbit
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    kubernetes.audit.user.username|contains: 'system:anonymous'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
