title: Web Protocols (MACOS - unified_logging)
id: 041c49fc-aff1-4e97-ab1c-b321104b795d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.001.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1071.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/package_script_service'
      - '/installer'
    Image|endswith|contains:
      - '/sh'
      - '/bash'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071.001
  - actor.stormous
