title: Steganography (WINDOWS - sysmon)
id: 8136bf45-3fe1-4554-a2d9-c3c9c71564b0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.qilin
