title: Abuse Elevation Control Mechanism (WINDOWS - sysmon)
id: cabc6bc3-8f4d-45a3-be89-ecacca4163f2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\mmc.exe'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
    ParentCommandLine|contains|contains:
      - 'WF.msc'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.qilin
