title: Non-Application Layer Protocol - Kazu (sysmon)
id: ab99a169-fce0-4ace-a293-7ad798569f0a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1095 (Non-Application Layer Protocol).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_connection_attempt_by_non_ssh_root_session.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1095
  - actor.kazu
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.executable|contains:
      - '/bin/ssh'
      - '/usr/bin/sshpass'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
