title: Access Token Manipulation (WINDOWS - defender)
id: 7497c067-e123-40f2-9806-9ccdcb117679
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: BlackByte
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.blackbyte
