title: Disable or Modify Tools (WINDOWS - defender)
id: 30b4c9d5-d07b-4f17-bcd3-91a08038a65c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: BlackByte
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    InitiatingProcessFileName|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    ProcessCommandLine|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.blackbyte
