title: Automated Collection (WINDOWS - sysmon)
id: f1a82498-d604-4b0c-8534-af56e07cff69
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1119.
  Threat Actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1119/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.doc'
      - '.docx'
      - '.xls'
    CommandLine|contains|all|contains:
      - 'dir '
      - ' /b '
      - ' /s '
    ParentCommandLine|contains|contains:
      - ' > %TEMP%\'
      - ' > %TMP%\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1119
  - actor.benzona
