title: Okta New Admin Console Behaviours
id: 1e0851c3-a833-42d3-a6ac-f88e4b482ff4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_new_behaviours_admin_console.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: okta
  service: system
  category: authentication
detection:
      selection_event:
          eventtype: 'policy.evaluate_sign_on'
          target.displayname: 'Okta Admin Console'
      selection_positive:
          - debugcontext.debugdata.behaviors|contains: 'POSITIVE'
          - debugcontext.debugdata.logonlysecuritydata|contains: 'POSITIVE'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
