title: Okta User Account Locked Out
id: 2cd0598b-ae5d-4cd7-9e97-355dce174cb6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1531.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1531/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_user_account_locked_out.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: okta
  service: system
  category: authentication
detection:
      selection:
          displaymessage: Max sign in attempts exceeded
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
