title: Potential Okta Password in AlternateID Field
id: 790e4e4c-790e-490e-a90e-790e4e4c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1552
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_password_in_alternateid_field.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1552
logsource:
  product: okta
  service: system
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         legacyeventtype: 'core.user_auth.login_failed'
    #     filter_main:
    #         # Okta service account names start with 0oa
    #         # Email addresses are the default format for Okta usernames, so attempt
    #         # to exclude alternateIds that look like valid emails
    #         # If your Okta configuration uses different character restrictions, you
    #         # will need to update this regular expression to reflect that or disable the rule for your environment
    #         # Possible false negatives are failed login attempts with a password that looks like a valid email address
    #         actor.alternateid|re: '(^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})'
    #     condition: selection and not filter_main
    # 
  condition: selection
level: medium
