title: Potential Okta Password in AlternateID Field
id: 9528225e-d95a-4d2e-be27-11ace9e4b621
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_password_in_alternateid_field.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: okta
  service: system
  category: authentication
detection:
      selection:
          legacyeventtype: 'core.user_auth.login_failed'
      filter_main:
          # Okta service account names start with 0oa
          # Email addresses are the default format for Okta usernames, so attempt
          # to exclude alternateIds that look like valid emails
          # If your Okta configuration uses different character restrictions, you
          # will need to update this regular expression to reflect that or disable the rule for your environment
          # Possible false negatives are failed login attempts with a password that looks like a valid email address
          actor.alternateid|re: '(^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})'
      condition: selection and not filter_main
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
