title: Okta FastPass Phishing Detection
id: c643c175-8307-4507-bff3-553eb6fda263
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1566/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_fastpass_phishing_detection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1566
logsource:
  product: okta
  service: system
  category: authentication
detection:
      selection:
          outcome.reason: 'FastPass declined phishing attempt'
          outcome.result: FAILURE
          eventtype: user.authentication.auth_via_mfa
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
