title: Okta Suspicious Activity Reported by End-user
id: 5a979382-5a97-4a97-aa97-5a9793820000
status: stable
description: Detection rule for MITRE ATT&CK technique T1586.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/identity/okta/okta_suspicious_activity_enduser_report.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: okta
  service: system
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         eventtype: 'user.account.report_suspicious_activity_by_enduser'
    #     condition: selection
    # 
  condition: selection
level: medium
