title: T1059 (WINDOWS - security)
id: dd20bf7f-a15a-47d6-89e6-4923d297839b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    NewProcessName|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    CommandLine|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
  - actor.blackbasta
