title: Group Policy Modification (WINDOWS - security)
id: 29891c65-b56b-4e6d-a3ea-c98262fbaf3e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectClass|contains:
      - 'groupPolicyContainer'
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.blackbasta
