title: Protocol Tunneling (WINDOWS - security)
id: 876b98fa-2387-4ff8-9251-1ffe9c73a5cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1572.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1572/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - ' -R '
    Description|contains:
      - 'Command-line SSH, Telnet, and Rlogin client'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1572
  - actor.blackbasta
