title: Spearphishing Link (GOOGLE - workspace)
id: fa900d88-655b-4b8a-ba3c-239862adfe10
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.apt29
