title: Windows Command Shell - DORRRA (security)
id: ea060ce7-35b8-443b-9baa-f853ab92805d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.003 (Windows Command Shell).
  Associated threat actor: DORRRA
references:
  - https://attack.mitre.org/techniques/T1059/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_execution_msbuild_started_by_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.003
  - actor.dorrra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name.caseless|contains: 'msbuild.exe'
    process.pe.original_file_name|contains: 'MSBuild.exe'
    process.parent.name|contains: 'cmd.exe'
    process.executable|contains: 'C:\\Program Files\\Microsoft Visual Studio\\2022\\Professional\\MSBuild\\Current\\Bin\\MSBuild.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
