title: Exploitation for Client Execution (LINUX - auditd)
id: fb12fdcd-5313-4753-8dbe-be29660fea7d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
  Threat Actor: REvil
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/tmp/'
      - '/dev/shm/'
    User|contains:
      - 'root'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
  - actor.revil
