title: Disable or Modify Tools - DoNex (security)
id: 430fca21-a093-4384-90ef-e8f8caa322e3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.001 (Disable or Modify Tools).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_alert_enable_weak_encryption.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.001
  - actor.donex
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4738'
    olduac_des|contains:
      - '# 0x8000'
      - '8???'
      - '9???'
      - 'A???'
      - 'B???'
    olduac_preauth|contains:
      - '# 0x10000'
      - '1????'
      - '3????'
      - '5????'
      - '7????'
    olduac_encrypted|contains:
      - '# 0x800'
      - '8??'
      - '9??'
      - 'A??'
      - 'B??'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
