title: System Information Discovery (WINDOWS - sysmon)
id: 7b9ccc30-a700-44c8-aa01-88835ff68a66
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1082.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1082/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\PCHunter64.exe'
      - '\PCHunter32.exe'
    CommandLine|contains|contains:
      - 'lkd(0)'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1082
  - actor.yashma-ator-vietnamita
