title: Security Software Discovery (WINDOWS - sysmon)
id: 9d15d155-e588-4ffc-9e46-73f97e1b51e8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - ' avira'
      - ' avira"'
      - ' cb'
    CommandLine|contains|contains:
      - ' 385201'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.yashma-ator-vietnamita
