title: Masquerade Task or Service (WINDOWS - security)
id: 10d1ca1c-9ca7-4c58-8d41-9ba3e472fbcd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Aquatic Panda
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.aquatic_panda
