title: Account Discovery (WINDOWS - security)
id: e045fc91-7b0c-4be5-8532-c7d0a78d4ea2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.
  Threat Actor: Aquatic Panda
references:
  - https://attack.mitre.org/techniques/T1087/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - ' applicationsinfo'
      - ' browserinfo'
      - ' eventsinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087
  - actor.aquatic_panda
