title: Microsoft Intune Device Health Scripts
id: 29a9f2fb-29a9-49a9-a9a9-29a9f2fb0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1021.007
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1021.007
logsource:
  product: azure
  service: intune
detection:
  selection:
    # Original splunk detection logic
    # -
    #   `azure_monitor_activity` operationName="*DeviceHealthScript*" 
    #   | rename identity as user, properties.TargetObjectIds{} as TargetObjectId, properties.TargetDisplayNames{} as TargetDisplayName, properties.Actor.IsDelegatedAdmin as user_isDelegatedAdmin
    #   | rex field="operationName" "^(?P<action>\w+?)DeviceHealthScript" | replace "patch" with "updated", "create" with "created", "delete", with "deleted", "assign", with "assigned" IN action
    #   | table _time operationName action user user_type user_isDelegatedAdmin TargetDisplayName TargetObjectId status tenantId correlationId
    #   | `microsoft_intune_device_health_scripts_filter`
  condition: selection
level: medium
