title: LSA Secrets (WINDOWS - defender)
id: 7db11238-9f40-4a2a-9668-811d2a6eb497
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: Threat Group-3390
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' save '
      - ' export '
      - ' ˢave '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.threat_group-3390
