title: System Service Discovery (LINUX - auditd)
id: fd6fd3e4-7b82-4516-8a0f-9b1f9dca9a99
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1007.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/esxcli'
    CommandLine|contains|contains:
      - 'storage'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1007
  - actor.kimsuky
