title: Macos Remote System Discovery
id: f45bf973-948d-408f-a83a-03c81cc5849f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1018.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1018/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_remote_system_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1018
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_1:
          Image|endswith: '/arp'
          CommandLine|contains: '-a'
      selection_2:
          Image|endswith: '/ping'
          CommandLine|contains:
              - ' 10.' # 10.0.0.0/8
              - ' 192.168.' # 192.168.0.0/16
              - ' 172.16.' # 172.16.0.0/12
              - ' 172.17.'
              - ' 172.18.'
              - ' 172.19.'
              - ' 172.20.'
              - ' 172.21.'
              - ' 172.22.'
              - ' 172.23.'
              - ' 172.24.'
              - ' 172.25.'
              - ' 172.26.'
              - ' 172.27.'
              - ' 172.28.'
              - ' 172.29.'
              - ' 172.30.'
              - ' 172.31.'
              - ' 127.' # 127.0.0.0/8
              - ' 169.254.' # 169.254.0.0/16
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
