title: System Network Discovery - macOS
id: 1f21a4ef-153b-4793-98bf-f5102c3a187b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1016.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1016/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_susp_system_network_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1016
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_1:
          Image|endswith:
              - '/arp'
              - '/ifconfig'
              - '/netstat'
              - '/networksetup'
              - '/socketfilterfw'
      selection_2:
          Image: '/usr/bin/defaults'
          CommandLine|contains|all:
              - '/Library/Preferences/com.apple.alf'
              - 'read'
      filter_main_wifivelocityd:
          ParentImage|endswith: '/wifivelocityd'
      condition: 1 of selection_* and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
