title: Binary Padding - MacOS
id: 87e0f25b-b3bb-4a87-9fa5-8995ffc923f2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_binary_padding.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_truncate:
          Image|endswith: '/truncate'
          CommandLine|contains: '-s +'
      selection_dd:
          Image|endswith: '/dd'
          CommandLine|contains:
              - 'if=/dev/zero' # if input is not /dev/zero, then there is no null padding
              - 'if=/dev/random' # high-quality random data
              - 'if=/dev/urandom' # low-quality random data
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
