title: Attempt to Mount SMB Share via Command Line
id: f73ce96a-8b6e-44f6-97ce-d1eb32f013a1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/lateral_movement_mounting_smb_share.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1021.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line: 'osascript*mount volume*smb://*'
    smb: '//*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
