title: Decode Base64 Encoded Text -MacOs
id: 501b80ab-24ee-4c9d-b1c7-835730da324e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_base64_decode.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image: '/usr/bin/base64'
          CommandLine|contains: '-d'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
