title: Startup Item File Created - MacOS
id: 778dca42-2365-4687-b846-8a39244817d9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1037.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1037/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/file_event/file_event_macos_susp_startup_item_created.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1037.005
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          TargetFilename|startswith:
              - '/Library/StartupItems/'
              - '/System/Library/StartupItems'
          TargetFilename|endswith: '.plist'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
