title: MacOS Network Service Scanning
id: cd145dcb-e8d5-43c3-8f4b-51af7c979961
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1046.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_network_service_scanning.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1046
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_1:
          Image|endswith:
              - '/nc'
              - '/netcat'
      selection_2:
          Image|endswith:
              - '/nmap'
              - '/telnet'
      filter:
          CommandLine|contains: 'l'
      condition: (selection_1 and not filter) or selection_2
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
