title: Network Sniffing - MacOs
id: fae48a10-9846-4038-9e7e-29c3d10c6b85
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1040.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1040/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_network_sniffing.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1040
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/tcpdump'
              - '/tshark'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
