title: System Network Connections Discovery - MacOs
id: db4f331d-5f30-4ed4-b483-33a7821d46ee
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1049.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1049/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_system_network_connections_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1049
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/who'
              - '/w'
              - '/last'
              - '/lsof'
              - '/netstat'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
