title: MacOS Scripting Interpreter AppleScript
id: 929b4809-014d-4ff7-bf4d-3ad2d686638b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_applescript.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/osascript'
          CommandLine|contains:
              - ' -e '
              - '.scpt'
              - '.js'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
