title: GUI Input Capture - macOS
id: 769f85fa-573c-4625-94bc-9184f0f9cb98
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_gui_input_capture.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_img:
          Image|endswith: '/osascript'
      selection_cli_1:
          CommandLine|contains|all:
              - '-e'
              - 'display'
              - 'dialog'
              - 'answer'
      selection_cli_2:
          CommandLine|contains:
              - 'admin'
              - 'administrator'
              - 'authenticate'
              - 'authentication'
              - 'credentials'
              - 'pass'
              - 'password'
              - 'unlock'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
