title: Scheduled Cron Task/Job - MacOs
id: a4d9155d-64f8-428b-8fe8-337ea9b6c496
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_schedule_task_job_cron.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.003
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/crontab'
          CommandLine|contains: '/tmp/'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
