title: Suspicious pbpaste High Volume Activity
id: 1a2b2df2-2cb8-4ca1-942e-bab6a8f9ccc8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1056/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/credential_access_high_volume_of_pbpaste.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1056
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name: 'pbpaste'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
