title: MacOS LOLbin
id: 08fa38c3-c905-4f31-9b83-c62239cbb4ec
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1059/004/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/macos_lolbin.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1059.004
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    name: 'es_process_events'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
