title: Suspicious Installer Package Child Process
id: d6784730-8c31-44b3-999a-567e01abdf2b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_installer_susp_child_process.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.007
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_installer:
          ParentImage|endswith:
              - '/package_script_service'
              - '/installer'
          Image|endswith:
              - '/sh'
              - '/bash'
              - '/dash'
              - '/python'
              - '/ruby'
              - '/perl'
              - '/php'
              - '/javascript'
              - '/osascript'
              - '/tclsh'
              - '/curl'
              - '/wget'
          CommandLine|contains:
              - 'preinstall'
              - 'postinstall'
      condition: selection_installer
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
