title: Enumeration of Users or Groups via Built-in Commands
id: a392a979-c134-48e1-ab23-8082912600c2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1069/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1069
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name: '.*'
    process.parent.name: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
