title: Local Groups Discovery - MacOs
id: a4e725b3-6fe3-4892-8aa3-c4f7599b67af
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_local_groups.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1069.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_1:
          Image|endswith: '/dscacheutil'
          CommandLine|contains|all:
              - '-q'
              - 'group'
      selection_2:
          Image|endswith: '/cat'
          CommandLine|contains: '/etc/group'
      selection_3:
          Image|endswith: '/dscl'
          CommandLine|contains|all:
              - '-list'
              - '/groups'
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
