title: User Added To Admin Group Via Dscl
id: 43185831-ded1-4536-b265-0c028e82cace
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_dscl_add_user_to_admin_group.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.003
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection: # adds to admin group
          Image|endswith: '/dscl'
          CommandLine|contains|all:
              - ' -append '
              - ' /Groups/admin '
              - ' GroupMembership '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
