title: Root Account Enable Via Dsenableroot
id: d9d0ee56-8fa1-4759-8a34-98f8c72a3fe3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_dsenableroot_enable_root_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/dsenableroot'
      filter_main_disable:
          CommandLine|contains: ' -d '
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
