title: Indicator Removal on Host - Clear Mac System Logs
id: b188b39c-5fbf-47aa-8ac7-44cbef95df06
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_clear_system_logs.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection1:
          Image|endswith:
              - '/rm'
              - '/unlink'
              - '/shred'
      selection_cli_1:
          CommandLine|contains: '/var/log'
      selection_cli_2:
          CommandLine|contains|all:
              - '/Users/'
              - '/Library/Logs/'
      condition: selection1 and 1 of selection_cli*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
