title: Enumeration of Users or Groups via Built-in Commands
id: f5f4b146-4231-4d43-a8cb-c5870b3c0316
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1087/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1087
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name: '.*'
    process.parent.name: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
