title: File and Directory Discovery - MacOS
id: 710c7bf5-775f-4e66-821d-6d11e2a43679
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1083.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_file_and_directory_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1083
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      select_file_with_asterisk:
          Image: '/usr/bin/file'
          CommandLine|re: '(.){200,}' # execution of the 'file */* *>> /tmp/output.txt' will produce huge commandline
      select_recursive_ls:
          Image: '/bin/ls'
          CommandLine|contains: '-R'
      select_find_execution:
          Image: '/usr/bin/find'
      select_mdfind_execution:
          Image: '/usr/bin/mdfind'
      select_tree_execution|endswith:
          Image: '/tree'
      condition: 1 of select*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
