title: Clipboard Data Collection Via OSAScript
id: 5564baa9-79a2-42cd-b792-3335ba7a9fa9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1115.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_clipboard_data_via_osascript.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1115
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - 'osascript'
              - ' -e '
              - 'clipboard'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
