title: Potential macOS SSH Brute Force Detected
id: 0055216a-992e-45fe-8b16-a8356f0058f5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/credential_access_potential_macos_ssh_bruteforce.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name: 'sshd-keygen-wrapper'
    event.category: 'process'
    host.os.type: 'macos'
    event.type: 'start'
    process.parent.name: 'launchd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
