title: Remote Access Tool - Team Viewer Session Started On MacOS Host
id: e2339c32-c21b-45d3-b037-48bdaea998be
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1133.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_remote_access_tools_teamviewer_incoming_connection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1133
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          ParentImage|endswith: '/TeamViewer_Service'
          Image|endswith: '/TeamViewer_Desktop'
          CommandLine|endswith: '/TeamViewer_Desktop --IPCport 5939 --Module 1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
