title: Creation Of A Local User Account
id: 59e45112-5618-4296-bd71-b72b0b9681e6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_create_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1136.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_dscl:
          Image|endswith: '/dscl'
          CommandLine|contains: 'create'
      selection_sysadminctl:
          Image|endswith: '/sysadminctl'
          CommandLine|contains: 'addUser'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
