title: Suspicious Browser Child Process - MacOS
id: aeae9d3a-c667-4e19-bde7-c61409749eb5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1189.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_susp_browser_child_process.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1189
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          ParentImage|contains:
              - 'com.apple.WebKit.WebContent'
              - 'firefox'
              - 'Google Chrome Helper'
              - 'Google Chrome'
              - 'Microsoft Edge'
              - 'Opera'
              - 'Safari'
              - 'Tor Browser'
          Image|endswith:
              - '/bash'
              - '/curl'
              - '/dash'
              - '/ksh'
              - '/osascript'
              - '/perl'
              - '/php'
              - '/pwsh'
              - '/python'
              - '/sh'
              - '/tcsh'
              - '/wget'
              - '/zsh'
      filter_main_generic:
          CommandLine|contains: '--defaults-torrc' # Informs tor to use default config file
      filter_main_ms_autoupdate:
          CommandLine|contains: '/Library/Application Support/Microsoft/MAU*/Microsoft AutoUpdate.app/Contents/MacOS/msupdate' # Microsoft AutoUpdate utility
      filter_main_chrome:
          ParentImage|contains:
              - 'Google Chrome Helper'
              - 'Google Chrome'
          CommandLine|contains:
              - '/Volumes/Google Chrome/Google Chrome.app/Contents/Frameworks/*/Resources/install.sh' # Install the Google Chrome browser
              - '/Applications/Google Chrome.app/Contents/Frameworks/Google Chrome Framework.framework/*/Resources/keystone_promote_preflight.sh' # Updates the Google Chrome branding configuration files
              - '/Applications/Google Chrome.app/Contents/Frameworks/Google Chrome Framework.framework/*/Resources/keystone_promote_postflight.sh' # Script that performs the post-installation tasks
      filter_main_ms_edge:
          ParentImage|contains: 'Microsoft Edge'
          CommandLine|contains:
              - 'IOPlatformExpertDevice' # Retrieves the IOPlatformUUID (parent process - Microsoft Edge)
              - 'hw.model' # Retrieves model name of the computer's hardware (parent process - Microsoft Edge)
      filter_main_chromerecovery:
          ParentImage|contains:
              - 'Google Chrome Helper'
              - 'Google Chrome'
          CommandLine|contains|all:
              - '/Users/'
              - '/Library/Application Support/Google/Chrome/recovery/'
              - '/ChromeRecovery'
      filter_optional_null:
          # Aoids alerting for the events which do not have command-line arguments
          CommandLine: null
      filter_optional_empty:
          # Aoids alerting for the events which do not have command-line arguments
          CommandLine: ''
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
