title: Payload Decoded and Decrypted via Built-in Utilities
id: c41bdf06-e156-4744-8b67-1fbf3ac3c2dd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1204/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_payload_decoded_and_decrypted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1204
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/openssl'
          CommandLine|contains|all:
              - '/Volumes/'
              - 'enc'
              - '-base64'
              - ' -d '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
