title: Suspicious Microsoft Office Child Process - MacOS
id: a265e2e0-8e20-4c40-b4fe-3450682e66ba
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1204/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_office_susp_child_processes.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1204.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          ParentImage|contains:
              - 'Microsoft Word'
              - 'Microsoft Excel'
              - 'Microsoft PowerPoint'
              - 'Microsoft OneNote'
          Image|endswith:
              - '/bash'
              - '/curl'
              - '/dash'
              - '/fish'
              - '/osacompile'
              - '/osascript'
              - '/sh'
              - '/zsh'
              - '/python'
              - '/python3'
              - '/wget'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
