title: System Information Discovery Via Sysctl - MacOS
id: c05d3e64-bd77-4cd4-95b1-68d7b2ea8143
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1497.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1497/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_sysctl_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1497.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '/sysctl'
          - CommandLine|contains: 'sysctl'
      selection_cmd:
          CommandLine|contains:
              - 'hw.'
              - 'kern.'
              - 'machdep.'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
