title: Time Machine Backup Deletion Attempt Via Tmutil - MacOS
id: 5152eb5e-0ae4-4d92-b298-76007b8d1d3a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1490.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_tmutil_delete_backup.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '/tmutil'
          - CommandLine|contains: 'tmutil'
      selection_cmd:
          CommandLine|contains: 'delete'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
