title: System Integrity Protection (SIP) Disabled
id: 53f7d935-6e6b-41ff-8326-f26d1bb4dafc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1518.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1518/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_csrutil_disable.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1518.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      # VT Query: behavior_processes:"csrutil status" p:5+ type:mac
      selection:
          Image|endswith: '/csrutil'
          CommandLine|contains: 'disable'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
