title: System Shutdown/Reboot - MacOs
id: 648d8625-0ff2-4893-a32f-cd33972a02c5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1529.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_system_shutdown_reboot.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1529
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/shutdown'
              - '/reboot'
              - '/halt'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
