title: MacOS Emond Launch Daemon
id: 19933aa6-3ee8-47b4-b72a-b276be6f89a3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.014.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/014/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/file_event/file_event_macos_emond_launch_daemon.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.014
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_1:
          TargetFilename|contains: '/etc/emond.d/rules/'
          TargetFilename|endswith: '.plist'
      selection_2:
          TargetFilename|contains: '/private/var/db/emondClients/'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
