title: Potential Privacy Control Bypass via Localhost Secure Copy
id: 36bcff9d-1036-4e67-93a6-e10c7eac244e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/defense_evasion_privilege_escalation_privacy_pref_sshd_fulldiskaccess.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line:
      - 'scp *localhost:/*'
      - 'scp *127.0.0.1:/*'
    process.args: 'vagrant@*127.0.0.1*'
    localhost: '/*'
    127.0.0.1: '/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
