title: Launch Agent/Daemon Execution Via Launchctl
id: 0451f962-9074-4166-9a08-37584625290c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1543.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1543/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_launchctl_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1543.004
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/launchctl'
          CommandLine|contains:
              - 'submit'
              - 'load'
              - 'start'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
