title: Keychain Password Retrieval via Command Line
id: 9ac34477-c2a4-49a5-9a0a-0d255a920ec9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1555/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/credential_access_keychain_pwd_retrieval_security_cmd.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1555.003
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line:
      - '*Chrome*'
      - '*Firefox*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
