title: Gatekeeper Bypass via Xattr
id: 8648af1f-ce9c-48e2-9503-68ae817b3618
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_xattr_gatekeeper_bypass.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/xattr'
          CommandLine|contains|all:
              - '-d'
              - 'com.apple.quarantine'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
