title: Suspicious Execution via macOS Script Editor
id: 1f0d7206-241c-4579-a83d-41d10ee48171
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_susp_execution_macos_script_editor.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1566.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection_parent:
          ParentImage|endswith: '/Script Editor'
      selection_img:
          - Image|endswith:
                - '/curl'
                - '/bash'
                - '/sh'
                - '/zsh'
                - '/dash'
                - '/fish'
                - '/osascript'
                - '/mktemp'
                - '/chmod'
                - '/php'
                - '/nohup'
                - '/openssl'
                - '/plutil'
                - '/PlistBuddy'
                - '/xattr'
                - '/sqlite'
                - '/funzip'
                - '/popen'
          - Image|contains:
                - 'python'
                - 'perl'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
