title: Hidden Flag Set On File/Directory Via Chflags - MacOS
id: ef491f28-bae8-4e1e-85f1-ba49eee06e2d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_chflags_hidden_flag.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.004
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: '/chflags'
          CommandLine|contains: 'hidden '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
