title: Disk Image Mounting Via Hdiutil - MacOS
id: d7f2a18f-0105-4d6c-9f19-b09d2015b963
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_hdiutil_mount.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      selection:
          Image|endswith: /hdiutil
          CommandLine|contains:
              - 'attach '
              - 'mount '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
