title: Hidden User Creation
id: 2a15b3e9-7403-4718-8d0f-9182bf19f757
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_create_hidden_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.002
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
      dscl_create:
          Image|endswith: '/dscl'
          CommandLine|contains: 'create'
      id_below_500:
          CommandLine|contains: UniqueID
          CommandLine|re: '([0-9]|[1-9][0-9]|[1-4][0-9]{2})'
      ishidden_option_declaration:
          CommandLine|contains: 'IsHidden'
      ishidden_option_confirmation:
          CommandLine|contains:
              - 'true'
              - 'yes'
              - '1'
      condition: dscl_create and id_below_500 or dscl_create and (ishidden_option_declaration and ishidden_option_confirmation)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
