title: Creation of Hidden Login Item via Apple Script
id: 46c7f350-d37a-4ef6-96ad-a3ea42ead673
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1647.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1647/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/persistence_creation_hidden_login_item_osascript.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1647
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line: 'osascript*login item*hidden:true*'
    hidden: 'true*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
