title: Split A File Into Pieces
id: 471ed36f-471e-471e-a71e-471ed36f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1030
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_split_file_into_pieces.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1030
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '/split'
    #     condition: selection
    # 
  condition: selection
level: medium
