title: Startup Item File Created - MacOS
id: 38fac2b5-38fa-48fa-a8fa-38fac2b50000
status: stable
description: Detection rule for MITRE ATT&CK technique T1037.005
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/file_event/file_event_macos_susp_startup_item_created.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1037.005
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|startswith:
    #             - '/Library/StartupItems/'
    #             - '/System/Library/StartupItems'
    #         TargetFilename|endswith: '.plist'
    #     condition: selection
    # 
  condition: selection
level: medium
