title: File Time Attribute Change
id: 3331916e-3331-4331-a331-3331916e0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.006
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_change_file_time_attr.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1070.006
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '/touch'
    #         CommandLine|contains:
    #             - '-t'
    #             - '-acmr'
    #             - '-d'
    #             - '-r'
    #     condition: selection
    # 
  condition: selection
level: medium
