title: File and Directory Discovery - MacOS
id: 03beb679-03be-43be-a3be-03beb6790000
status: stable
description: Detection rule for MITRE ATT&CK technique T1083
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_file_and_directory_discovery.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1083
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     select_file_with_asterisk:
    #         Image: '/usr/bin/file'
    #         CommandLine|re: '(.){200,}' # execution of the 'file */* *>> /tmp/output.txt' will produce huge commandline
    #     select_recursive_ls:
    #         Image: '/bin/ls'
    #         CommandLine|contains: '-R'
    #     select_find_execution:
    #         Image: '/usr/bin/find'
    #     select_mdfind_execution:
    #         Image: '/usr/bin/mdfind'
    #     select_tree_execution|endswith:
    #         Image: '/tree'
    #     condition: 1 of select*
    # 
  condition: selection
level: medium
