title: System Shutdown/Reboot - MacOs
id: 7025bdd9-7025-4025-a025-7025bdd90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1529
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_system_shutdown_reboot.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1529
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith:
    #             - '/shutdown'
    #             - '/reboot'
    #             - '/halt'
    #     condition: selection
    # 
  condition: selection
level: medium
