title: Credentials from Password Stores - Keychain
id: 4403f130-4403-4403-a403-4403f1300000
status: stable
description: Detection rule for MITRE ATT&CK technique T1555.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_creds_from_keychain.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1555.001
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection1:
    #         Image: '/usr/bin/security'
    #         CommandLine|contains:
    #             - 'find-certificate'
    #             - ' export '
    #     selection2:
    #         CommandLine|contains:
    #             - ' dump-keychain '
    #             - ' login-keychain '
    #     condition: 1 of selection*
    # 
  condition: selection
level: medium
