title: Hidden User Creation
id: 3bb39bed-3bb3-4bb3-abb3-3bb39bed0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1564.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_create_hidden_account.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1564.002
logsource:
  product: macos
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     dscl_create:
    #         Image|endswith: '/dscl'
    #         CommandLine|contains: 'create'
    #     id_below_500:
    #         CommandLine|contains: UniqueID
    #         CommandLine|re: '([0-9]|[1-9][0-9]|[1-4][0-9]{2})'
    #     ishidden_option_declaration:
    #         CommandLine|contains: 'IsHidden'
    #     ishidden_option_confirmation:
    #         CommandLine|contains:
    #             - 'true'
    #             - 'yes'
    #             - '1'
    #     condition: dscl_create and id_below_500 or dscl_create and (ishidden_option_declaration and ishidden_option_confirmation)
    # 
  condition: selection
level: medium
