title: Data from Network Shared Drive - Qilin (sysmon)
id: 09753fb6-3244-4799-a4a8-a5600f866d03
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1039 (Data from Network Shared Drive).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1039/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_posh_invoke_sharefinder.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1039
  - actor.qilin
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Invoke-ShareFinder'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
