title: Embedded Payloads - DoNex (defender)
id: 4940e098-41af-43dc-b84d-7582569147a7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.009 (Embedded Payloads).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1027/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.009
  - actor.donex
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    ProcessCommandLine|contains: '${env:path}'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
