title: Native API - DoNex (defender)
id: 7e74e4ec-6254-4325-8e36-826c864a5c32
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1106 (Native API).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1106/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_audio_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1106
  - actor.donex
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'sentinelbreakpoints'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
