title: Abuse Elevation Control Mechanism - DoNex (defender)
id: 44686a05-cf09-41fa-a443-d4b06a50665e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1548 (Abuse Elevation Control Mechanism).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_connection_attempt_by_non_ssh_root_session.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1548
  - actor.donex
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.executable|contains:
      - '/bin/ssh'
      - '/usr/bin/sshpass'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
