title: DLL (LINUX - auditd)
id: d89a15cf-3a5b-4fc3-823f-3983ff6ae021
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: BackdoorDiplomacy
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains|contains:
      - '/.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.backdoordiplomacy
