title: Steal or Forge Kerberos Tickets (MACOS - unified_logging)
id: 8f89842e-ab68-4646-acfd-d286ca21ee8c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1558.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1558/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1558
  - actor.blackbasta
