title: Phishing (MACOS - unified_logging)
id: ade3114d-1edd-4d39-8dd7-c836a646f709
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'cmd'
      - 'powershell'
    CommandLine|contains:
      - 'encoded'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.blackbasta
