title: Domain Account - Brain Cipher (sysmon)
id: ebd5c0e5-297c-4899-a24c-2344f0df5b42
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.002 (Domain Account).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1087/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_ad_explorer_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.002
  - actor.brain_cipher
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'ADExplorer*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
