title: File and Directory Discovery - Brain Cipher (sysmon)
id: 5efb30b4-77c3-499c-9a00-c4d9a179ae8a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_file_dir_discovery.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.brain_cipher
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'tree.com'
    process.args|contains: 'dir'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
