title: Clipboard Data - Brain Cipher (sysmon)
id: bc2d871b-16a4-42d1-8fd1-481550240f9b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1115 (Clipboard Data).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_clipboard_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1115
  - actor.brain_cipher
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Set-Alias -Name \'
    user.id|contains: 'S-1-5-18'
    file.name|contains: 'Convert-ExcelRangeToImage.ps1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
