title: Rundll32 - Brain Cipher (sysmon)
id: 691ef60a-5c3c-46bf-990d-a9b1394bc6bd
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.011 (Rundll32).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_cmdline_dump_tool.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.011
  - actor.brain_cipher
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.pe.original_file_name|contains: 'diskshadow.exe'
    process.name|contains: 'diskshadow.exe'
    process.args|contains: '/s'
    process.command_line|contains: '*comsvcs*#*24*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
