title: DLL - Brain Cipher (sysmon)
id: 8dfdd9d5-13fc-4810-9f8d-1791a7ec65ec
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574.001 (DLL).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_amsi_bypass_dllhijack.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574.001
  - actor.brain_cipher
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.name|contains:
      - 'amsi.dll'
      - 'amsi'
    file.path|contains:
      - '?:\\$SysReset\\CloudImage\\Package_for_RollupFix*\\amsi.dll'
      - '\\\\?\\Volume{*}\\Windows\\syswow64\\amsi.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
