title: Screen Capture - Lynx (unified_logging)
id: 0899a3da-10ab-44d0-8109-feeee95af653
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_screencapture.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.lynx
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/usr/sbin/screencapture'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
