title: SSH - Akira (sysmon)
id: 5a94e97c-81db-4a56-b592-5be48f37310c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.004 (SSH).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1021/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.004
  - actor.akira
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
