title: Pass the Hash - Akira (sysmon)
id: dd47a1cf-8d32-4944-93ca-1533475a19d6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1550.002 (Pass the Hash).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1550/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_posh_relay_tools.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1550.002
  - actor.akira
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.directory|contains: 'C:\ProgramData\Microsoft\Windows Defender Advanced Threat Protection\Downloads'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
