title: Local Groups - Akira (auditd)
id: c9a9d872-f0d6-496f-b86c-808b8965a05a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.001 (Local Groups).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_groups.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.001
  - actor.akira
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains:
      - '/groups'
      - '/cat'
      - '/ed'
      - '/head'
      - '/less'
    cmd|contains: '/etc/group'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
