title: Account Manipulation - Akira (auditd)
id: 0c3a5c53-0ea1-4581-bede-54cda785b919
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1098 (Account Manipulation).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_google_workspace_user_group_access_modified_to_allow_external_access.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1098
  - actor.akira
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CHANGE_GROUP_SETTING'
    event.category|contains: 'iam'
    google_workspace.admin.setting.name|contains: 'WHO_CAN_JOIN'
    google_workspace.admin.new_value|contains: 'CAN_REQUEST_TO_JOIN'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
