title: Service Stop - Akira (auditd)
id: 8227f612-36b9-4ed6-b59d-3341466adbab
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1489 (Service Stop).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1489/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_magic_system_request_key.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1489
  - actor.akira
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/sysrq'
      - '/sysctl.conf'
      - '/sysrq-trigger'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
