title: Use Alternate Authentication Material - Akira (auditd)
id: ccbfc047-94ff-4236-801e-bbad5346a1b3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1550 (Use Alternate Authentication Material).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1550/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1550
  - actor.akira
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.token'
    event.action|contains: 'authorize'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
