title: Cloud Instance Metadata API (M365 - entra_id)
id: 0aeaae59-8c26-44e6-acd8-7786634a69b4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.005.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1552.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.005
  - actor.teamtnt
