title: System Language Discovery (WINDOWS - security)
id: 17d1161a-2e9c-4f2a-a41b-6c82ae193232
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1614.001.
  Threat Actor: Sarcoma
references:
  - https://attack.mitre.org/techniques/T1614.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cmd.exe'
    ParentCommandLine|contains|windash|contains:
      - ' -c '
      - ' -r '
      - ' -k '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1614.001
  - actor.sarcoma
