title: Hide Artifacts - BlackSuit (defender)
id: d54d3255-2c0e-41c0-97d3-c51c7fa5c13b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564 (Hide Artifacts).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/defense_evasion_exchange_new_inbox_rule_delete_or_move.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564
  - actor.blacksuit
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'o365.audit'
    event.action|contains: 'New-InboxRule'
    event.outcome|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
