title: Deobfuscate/Decode Files or Information (MACOS - unified_logging)
id: 083090f9-c72c-4c34-a1bf-99e80590da72
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1140.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1140/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/bash'
    CommandLine|contains|all|contains:
      - 'tail'
      - '-c'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1140
  - actor.ignoble_scorpius
