title: Phishing (MACOS - unified_logging)
id: c11945dc-ef28-4b16-879c-3b6df4c3db7d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.ignoble_scorpius
