title: Data Staged (LINUX - auditd)
id: eb403f53-ad8d-4a60-82e8-bccd1a5c7235
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1074.
  Threat Actor: PEAR
references:
  - https://attack.mitre.org/techniques/T1074/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1074
  - actor.pear
