title: Command Obfuscation (WINDOWS - defender)
id: 06b18d45-0008-4f81-8e81-5997fa46adfe
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.010.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1027.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '-ComObject'
      - 'InstallProduct('
      - '.Insert('
    CommandLine|contains|contains:
      - '#'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.010
  - actor.inc_ransom
