title: Steganography (WINDOWS - defender)
id: f316f4fa-ad39-426f-9ec2-658c307e617f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.inc_ransom
