title: Python (WINDOWS - defender)
id: cd8ec34a-a81b-41bb-851f-be791d780f81
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.inc_ransom
