title: Windows Command Shell (WINDOWS - defender)
id: 4b1e3cbf-368b-4b6a-9b4c-d6cf41976dd8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.003.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|all|contains:
      - 'http'
      - '://'
      - '%AppData%'
    CommandLine|contains|contains:
      - '<'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.003
  - actor.inc_ransom
