title: Python (WINDOWS - defender)
id: ebdfb0d7-d2d6-4ec1-8fa2-c3f81b7ec935
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.inc_ransom
