title: Disable or Modify Tools (WINDOWS - defender)
id: d5080bd6-4bc2-4d8e-97a5-66d28648275a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' disable '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.inc_ransom
