title: Data Staged - 8base (unified_logging)
id: b756fb5e-eb31-4206-95a2-1fa65b30ca60
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1074 (Data Staged).
  Associated threat actor: 8base
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1074
  - actor.8base
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category|contains: 'iam'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
