title: Password Spraying - RansomHub (entra_id)
id: 0eb13657-c1b8-43b7-88ab-91a34d9fc9a8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1110.003 (Password Spraying).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1110.003
  - actor.ransomhub
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
