title: PowerShell (WINDOWS - security)
id: b45318c0-0fe2-456b-8f4d-7d35c80364d4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'cmd'
      - '"set'
      - '-f'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.benzona
