title: ESXi Syslog Configuration Change Via ESXCLI
id: 418cae48-418c-418c-a18c-418cae480000
status: stable
description: Detection rule for MITRE ATT&CK technique T1562.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_esxcli_syslog_config_change.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1562.003
logsource:
  product: linux
  service: syslog
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '/esxcli'
    #         CommandLine|contains|all:
    #             - 'system'
    #             - 'syslog'
    #             - 'config'
    #         CommandLine|contains: ' set'
    #     condition: selection
    # 
  condition: selection
level: medium
