title: Valid Accounts (WINDOWS - security)
id: 22dd59c4-f1c1-4754-ba74-228f3509da8d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: REvil
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.revil
