title: External Remote Services (WINDOWS - security)
id: 3fdf60a7-a156-4f12-91f4-70b42416c759
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: REvil
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.revil
