title: Executable Installer File Permissions Weakness (WINDOWS - sysmon)
id: ce38d82c-0a0e-4210-ba4e-581553d03c1b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.005.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1574.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ' -m '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.005
  - actor.mustang_panda
