title: Rootkit - Spectra (unified_logging)
id: 68dacc5c-ee95-4cf0-a13e-358b329dcb21
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1014 (Rootkit).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1014
  - actor.spectra
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
