title: Account Discovery - Spectra (unified_logging)
id: 0d28d136-fa7d-4745-b263-cbb14eeba864
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087 (Account Discovery).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1087/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/discovery_users_domain_built_in_commands.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087
  - actor.spectra
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.Ext.effective_parent.name|contains: '.*'
    process.parent.name|contains: '.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
