title: Steal or Forge Kerberos Tickets - Interlock (workspace)
id: 6562335d-7743-42ea-a0b0-3464687478c5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558 (Steal or Forge Kerberos Tickets).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1558/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558
  - actor.interlock
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
