title: Data Manipulation - Interlock (workspace)
id: 555a657f-ffa9-4095-a03a-ac82e3e4e034
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1565 (Data Manipulation).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1565/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/impact_hosts_file_modified.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1565
  - actor.interlock
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    file.path|contains:
      - '/private/etc/hosts'
      - '?:\\Windows\\System32\\drivers\\etc\\hosts'
    process.executable|contains:
      - 'C:\\Program Files\\Fortinet\\FortiClient\\FCDBLog.exe'
      - '/usr/local/demisto/server'
    process.args|contains: '/etc/hosts'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
