title: File and Directory Discovery (WINDOWS - sysmon)
id: 4b175326-7187-4fe4-add1-3461c845f005
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.cl0p
