title: Application Layer Protocol (WINDOWS - defender)
id: a9bd8691-166b-4ab5-8d10-d6c6c57a6628
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.cl0p
