title: Native API (WINDOWS - defender)
id: 2a38cbf4-ac6a-48ea-9e40-864a4524924f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1106.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1106/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Offline_Winpwn'
      - 'WinPwn '
      - 'WinPwn.exe'
    Image|endswith|contains:
      - '\rundll32.exe'
      - '\cmd.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1106
  - actor.cl0p
