title: User Execution (WINDOWS - defender)
id: a5a715e2-8363-4245-843b-4d69dda9d1b5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1204/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'immersivecontrolpanel'
    ParentImage|endswith|contains:
      - '\explorer.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\cscript.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204
  - actor.cl0p
