title: Query Registry (WINDOWS - security)
id: e12ce743-c3e2-4e47-ae81-df90b85217c9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: DORRRA
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'Key'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.dorrra
