title: System Network Configuration Discovery (WINDOWS - security)
id: 09107d7a-7a1e-4e5c-ae04-fc2f4572d4cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.akira
