title: Valid Accounts (WINDOWS - security)
id: 84250492-2c10-44cc-90c0-368334d18a3b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.akira
