title: Account Discovery (WINDOWS - security)
id: ebe5004a-9e5c-4a62-a4c5-4c575a56a223
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1087/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - ' applicationsinfo'
      - ' browserinfo'
      - ' eventsinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087
  - actor.akira
