title: Automated Collection (WINDOWS - defender)
id: 2ac36126-5ea1-4de3-a37f-a9eda9ef2a8a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1119.
  Threat Actor: Confucius
references:
  - https://attack.mitre.org/techniques/T1119/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.doc'
      - '.docx'
      - '.xls'
    CommandLine|contains|all|contains:
      - 'dir '
      - ' /b '
      - ' /s '
    ParentCommandLine|contains|contains:
      - ' > %TEMP%\'
      - ' > %TMP%\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1119
  - actor.confucius
