title: Embedded Payloads - RansomHub (sysmon)
id: ad008085-1f61-4601-ba69-feeb3d269baa
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.009 (Embedded Payloads).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1027/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.009
  - actor.ransomhub
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    CommandLine|contains: '${env:path}'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
