title: Token Impersonation/Theft (WINDOWS - sysmon)
id: c3a03089-4ebb-473e-b247-4245b56c3694
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.001.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1134.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' backupkey '
      - ' blob '
      - ' certificates '
    ParentImage|endswith|contains:
      - '\services.exe'
    CommandLine|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.001
  - actor.apt28
