title: Exploit Public-Facing Application (WINDOWS - sysmon)
id: ba5764f6-d094-4991-ac3e-da71f274664b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\ScreenConnect.Service.exe'
    Image|endswith|contains:
      - '\rdpclip.exe'
      - ':\Windows\System32\csrss.exe'
      - ':\Windows\System32\wininit.exe'
    ParentCommandLine|contains|all|contains:
      - '\svchost.exe'
      - 'termsvcs'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.apt28
