title: Service Stop (WINDOWS - sysmon)
id: f6d0a5e7-ca6b-4531-89da-0a4e9451980c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1489.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1489/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' stop '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1489
  - actor.akira
