title: Data from Local System (WINDOWS - security)
id: e5e2d557-33fd-458c-ae11-57bc5420274a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1005.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-r'
    Image|endswith|contains:
      - '\sqlcmd.exe'
    CommandLine|contains|all|contains:
      - 'SELECT'
      - 'TOP'
      - '[VeeamBackup].[dbo].[Credentials]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1005
  - actor.spectra
