title: System Owner/User Discovery (WINDOWS - security)
id: 8701a2d0-e024-46af-8ef4-39c3b34e6b48
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SharpLdapWhoami.exe'
    CommandLine|contains|all|contains:
      - 'Get-ADComputer '
      - ' -Filter \*'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.spectra
