title: Account Discovery (WINDOWS - security)
id: 9e2d7723-7118-40e3-95af-e316c58bed54
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1087/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - ' applicationsinfo'
      - ' browserinfo'
      - ' eventsinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087
  - actor.spectra
