title: Email Collection (WINDOWS - security)
id: 3cb9ec72-5790-4a71-bc80-f23b0c58e6a8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1114.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1114/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - 'Add-PSSnapin'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1114
  - actor.spectra
