title: System Binary Proxy Execution (WINDOWS - security)
id: 064d35c9-cd34-4d3b-80d3-fc3242cb1a3d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1218/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '-AddInRoot:'
      - '-PipelineRoot:'
    ParentImage|endswith|contains:
      - '\addinutil.exe'
    Image|endswith|contains:
      - ':\Windows\System32\conhost.exe'
      - ':\Windows\System32\werfault.exe'
      - ':\Windows\SysWOW64\werfault.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218
  - actor.spectra
