title: Abuse Elevation Control Mechanism (WINDOWS - security)
id: e00332c8-e93e-4a88-9d48-693a6ff28007
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\TrustedInstaller.exe'
      - '\ProcessHacker.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.spectra
