title: Hidden Window (WINDOWS - security)
id: fdbec8f4-eedb-4dcc-a488-151049969116
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.003.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '--headless'
      - 'dump-dom'
      - 'http'
    Image|endswith|contains:
      - '\brave.exe'
      - '\chrome.exe'
      - '\msedge.exe'
    CommandLine|contains|contains:
      - '--headless'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.003
  - actor.spectra
