title: Hide Artifacts (WINDOWS - security)
id: 6e0b41d9-3bb5-4bf1-8bdb-912799889745
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.spectra
