title: Exfiltration Over C2 Channel (GOOGLE - workspace)
id: 8d63ec82-b8a6-4502-9c75-94523a7747ab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1041.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1041/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1041
  - actor.vice_society
