title: JavaScript (WINDOWS - sysmon)
id: 1759f1f6-929a-4203-a452-79644e64387e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.007.
  Threat Actor: LazyScripter
references:
  - https://attack.mitre.org/techniques/T1059.007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\hh.exe'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.007
  - actor.lazyscripter
