title: Vulnerability Scanning (GOOGLE - workspace)
id: e9cc89d4-f1ea-48e0-a8d6-9bd74818014e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.002.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1595.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595.002
  - actor.hunters_international
