title: Application Window Discovery (WINDOWS - security)
id: 86f2dbd4-086c-4de6-b21d-21493fb381ae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1010.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1010
  - actor.lazarus_group
