title: SSH (WINDOWS - security)
id: 3939edb5-b53a-4bd6-9996-962b8bf986a1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.lazarus_group
