title: Mshta (WINDOWS - security)
id: 2992d549-44b9-44b3-94ec-0b88e0120b35
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.005.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1218.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cscript.exe'
      - '\excel.exe'
      - '\mshta.exe'
    CommandLine|contains|contains:
      - 'javascript'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.005
  - actor.lazarus_group
