title: Shortcut Modification (WINDOWS - security)
id: d17e0325-caa4-4e73-b7d2-c6ec124d2991
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.009.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1547.009/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'File'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.009
  - actor.lazarus_group
