title: Disable or Modify System Firewall (WINDOWS - security)
id: 11b4a571-f61e-4943-8f6e-5475b7f2ee23
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.004.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1562.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'firewall '
      - 'add '
      - 'tcp '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.004
  - actor.lazarus_group
