title: Bypass User Account Control (WINDOWS - sysmon)
id: efa3b4b2-bacf-48cc-ba74-827cad6aabfe
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.002.
  Threat Actor: 3AM
references:
  - https://attack.mitre.org/techniques/T1548.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'WindowsPowerShellWebAccess'
      - '/online'
      - '/enable-feature'
    ParentImage|endswith|contains:
      - '\eventvwr.exe'
    Image|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|contains:
      - '/NOUACCHECK'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548.002
  - actor.3am
