title: Inhibit System Recovery - Stormous (unified_logging)
id: 9c3506d1-8acc-4e01-a922-d295796da390
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1490 (Inhibit System Recovery).
  Associated threat actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_tmutil_delete_backup.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1490
  - actor.stormous
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    CommandLine|contains: 'delete'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
