title: JavaScript (GOOGLE - workspace)
id: 35cb31b0-297b-4269-94bc-a2bc9ac875dc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.007.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1059.007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.007
  - actor.blacksuit
