title: Data Encrypted for Impact (GOOGLE - workspace)
id: 8d92da82-6141-40c1-8194-3d7f062eac99
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1486.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1486/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1486
  - actor.blacksuit
