title: Domain or Tenant Policy Modification (GOOGLE - workspace)
id: 236bb244-9167-4699-ba79-f8a797089e85
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1484/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484
  - actor.blacksuit
