title: Spearphishing Voice (GOOGLE - workspace)
id: 45026b76-ae35-405e-8179-792d81970fd7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.004.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1566.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.004
  - actor.blacksuit
