title: System Network Configuration Discovery (WINDOWS - security)
id: 33b45d2d-bdce-4656-9b0c-da3663598007
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.wizard_spider
