title: Domain Account (WINDOWS - security)
id: 8dc62853-35fc-4e42-9ef7-1ed8907d66ce
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.wizard_spider
