title: T1074 (GOOGLE - workspace)
id: 56f024d4-5a73-47a6-bb71-fd68ac6c2e83
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1074.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1074/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1074
  - actor.shinra
