title: External Remote Services - Play (entra_id)
id: 5a1072e2-44c7-4c71-b048-ef509ed384a9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1133 (External Remote Services).
  Associated threat actor: Play
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_ssh_connection_established_inside_a_container.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1133
  - actor.play
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    container.id|contains: '*'
    process.entry_leader.entry_meta.type|contains: 'sshd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
