title: Process Hollowing (WINDOWS - security)
id: 570430c0-0643-43a9-b1bc-46a639429c36
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.012.
  Threat Actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1055.012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\svchost.exe'
    CommandLine|re|contains:
      - '-k\s\w{1,64}(\s?(-p|-s))?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.012
  - actor.bqtlock
