title: Abuse Elevation Control Mechanism (WINDOWS - security)
id: ce7e04b1-2752-4940-b842-80b9bfcba9ed
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\TrustedInstaller.exe'
      - '\ProcessHacker.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.bqtlock
