title: Remote Services (GOOGLE - workspace)
id: a3146a96-22e2-4961-87d6-7737b6a05f96
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.
  Threat Actor: Sarcoma
references:
  - https://attack.mitre.org/techniques/T1021/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021
  - actor.sarcoma
