title: Web Shell (M365 - entra_id)
id: eb9afef1-3b56-4d39-a92e-c7b618ea58df
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.leviathan
