title: Email Accounts (M365 - entra_id)
id: 8cee5e41-3432-4bfc-9e71-ec43fdff9266
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1586.002.
  Threat Actor: Leviathan
references:
  - https://attack.mitre.org/techniques/T1586.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1586.002
  - actor.leviathan
