title: Security Account Manager - BianLian (security)
id: b9b11b3b-9f74-44cc-9eec-1a20d6b6f0eb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.002 (Security Account Manager).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.002
  - actor.bianlian
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5145'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$'
      - 'SYSTEM32\'
      - '.tmp'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
