title: Data Encrypted for Impact (WINDOWS)
id: be2eb7c2-9ab0-4bf8-a0f6-7540249b0ec4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1486.
references:
  - https://attack.mitre.org/techniques/T1486/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'cipher.exe'
      - 'certutil.exe'
    CommandLine|contains:
      - '/e'
      - '/s'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1486
