title: Web Protocols (WINDOWS - sysmon)
id: b4802ca4-1bb0-4da2-a99c-6ecd983e2ee5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.001.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1071.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.exe tunnel'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|contains|contains:
      - '\servers\Stable-'
    ParentImage|endswith|contains:
      - '\server\node.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071.001
  - actor.hunters_international
