title: Screen Capture (LINUX - auditd)
id: fd448fe0-6878-4c20-8d67-233823e4380d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1113.
  Threat Actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1113/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'xwd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1113
  - actor.bqtlock
