title: Impair Defenses (WINDOWS - defender)
id: 99002040-2799-4d3d-adbb-0b1da3c793d9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.
  Threat Actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1562/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'unload'
    CommandLine|contains|all|contains:
      - 'unload'
      - 'sysmon'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562
  - actor.hunters_international
