title: Command and Scripting Interpreter - Spectra (auditd)
id: bd2b3eef-91b5-4c74-ae7e-272d47f7ebfb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059 (Command and Scripting Interpreter).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_bpfdoor_file_accessed.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059
  - actor.spectra
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/var/run/haldrund.pid'
      - '/var/run/xinetd.lock'
      - '/var/run/kdevrund.pid'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
