title: Cisco Secure Firewall - High Priority Intrusion Classification
id: e841541d-3f98-418d-ba77-de85416d049a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___high_priority_intrusion_classification.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1003
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
