title: Cisco Secure Firewall - High Priority Intrusion Classification
id: 61e335c7-61e3-41e3-a1e3-61e335c70000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___high_priority_intrusion_classification.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1003
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # `cisco_secure_firewall` EventType=IntrusionEvent 
    #           class_desc IN ("A Network Trojan was Detected", "Successful Administrator Privilege Gain", "Successful User Privilege Gain", "Attempt to Login By a Default Username and Password", "Known malware command and control traffic", "Known malicious file or file based exploit", "Known client side exploit attempt", "Large Scale Information Leak")
    #   | fillnull
    #   | stats count min(_time) as firstTime max(_time) as lastTime
    #           values(signature_id) as signature_id 
    #           values(MitreAttackGroups) as MitreAttackGroups 
    #           values(InlineResult) as InlineResult 
    #           values(InlineResultReason) as InlineResultReason 
    #           values(dest_port) as dest_port 
    #           values(rule) as rule 
    #           values(transport) as transport 
    #           values(app) as app
    #           by src, dest, signature, class_desc
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_secure_firewall___high_priority_intrusion_classification_filter`
  condition: selection
level: medium
