title: System Network Discovery - Linux
id: 19d8929f-19d8-49d8-a9d8-19d8929f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1016
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_system_network_discovery.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1016
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         Image|endswith:
    #             - '/firewall-cmd'
    #             - '/ufw'
    #             - '/iptables'
    #             - '/netstat'
    #             - '/ss'
    #             - '/ip'
    #             - '/ifconfig'
    #             - '/systemd-resolve'
    #             - '/route'
    #     selection_cli:
    #         CommandLine|contains: '/etc/resolv.conf'
    #     condition: 1 of selection_*
    # 
  condition: selection
level: medium
