title: Detect Traffic Mirroring
id: b46cf02d-f1cc-437d-951d-bc644ae52afe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1020.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1020/001/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_traffic_mirroring.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1020.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    facility:
      - 'MIRROR'
      - 'SPAN'
      - 'SPAN'
    mnemonic:
      - 'ETH_SPAN_SESSION_UP'
      - 'SESSION_UP'
      - 'PKTCAP_START'
      - 'CFGLOG_LOGGEDCMD'
    command: 'monitor'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
