title: Remote Desktop Network Traffic
id: 13ce475a-8868-465e-8355-7561c80fd16a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1021/001/
  - https://github.com/splunk/security_content/blob/develop/detections/network/remote_desktop_network_traffic.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1021.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Traffic'
    dest_port: '3389'
    action: 'allowed'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
