title: Cisco Network Interface Modifications
id: ac38d5eb-4884-48b4-aef4-c6add1f7ceb1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1021/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_network_interface_modifications.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1021
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Change.All_Changes'
    command:
      - '*interface*'
      - '*LINEPROTO-5-UPDOWN*'
      - '*ip'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
