title: Cisco Secure Firewall - Lumma Stealer Activity
id: 17292116-8234-4693-ac8b-62dabdfa401e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___lumma_stealer_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1027
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
    span: '15m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
