title: Detect DNS Data Exfiltration using pretrained model in DSDL
id: a7ef6a96-e2d7-4200-bfe4-4a8a33b6703f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_dns_data_exfiltration_using_pretrained_model_in_dsdl.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Resolution'
    rank: '='
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
