title: Cisco Secure Firewall - Blocked Connection
id: 0a28d995-4344-4966-bf24-91af967e6153
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1046.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___blocked_connection.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1046
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
