title: Cisco Secure Firewall - High EVE Threat Confidence
id: ac615290-bd5d-4616-a5d1-13b14883ff63
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1041.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1041/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___high_eve_threat_confidence.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1041
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
