title: Cisco Secure Firewall - Wget or Curl Download
id: 3f8bb66b-6f6b-48a2-adaa-134c2986faf7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___wget_or_curl_download.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1053.003
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
