title: Cisco Secure Firewall - Binary File Type Download
id: 8ab97191-3147-4bfd-b08b-b05404bc7d2a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___binary_file_type_download.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1059
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'FileEvent'
    FileDirection: 'Download'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
