title: Suspicious Network Communication With IPFS
id: 0034c8de-0034-4034-a034-0034c8de0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1056
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/web/proxy_generic/proxy_susp_ipfs_cred_harvest.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1056
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         cs-uri|re: '(?i)(ipfs\.io/|ipfs\.io\s).+\..+@.+\.[a-z]+'
    #     condition: selection
    # 
  condition: selection
level: medium
