title: Cisco NVM - MSHTML or MSHTA Network Execution Without URL in CLI
id: 5ce6cc1d-5ce6-4ce6-ace6-5ce6cc1d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1059.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cisco_nvm___mshtml_or_mshta_network_execution_without_url_in_cli.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1059.005
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # `cisco_network_visibility_module_flowdata`
    #   (
    #     (
    #       process_name = "mshta.exe"
    #       process_arguments IN ("*javascript*", "*vbscript*")
    #     )
    #     OR
    #     ( process_name = "rundll32.exe" AND
    #       process_arguments = "*mshtml*" AND
    #       process_arguments = "*RunHTMLApplication*"
    #     )
    #   )
    #   NOT process_arguments IN ("*http://*", "*https://*")
    #   | stats count min(_time) as firstTime max(_time) as lastTime
    #           values(parent_process_arguments) as parent_process_arguments
    #           values(process_arguments) as process_arguments
    #           values(parent_process_hash) as parent_process_hash
    #           values(process_hash) as process_hash
    #           values(module_name_list) as module_name_list
    #           values(module_hash_list) as module_hash_list
    #           values(dest_port) as dest_port
    #           values(aliul) as additional_logged_in_users_list
    #           values(dest_hostname) as dest_hostname
    #           by src dest parent_process_path parent_process_integrity_level process_path process_name process_integrity_level process_id transport
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | table
    #     parent_process_integrity_level parent_process_path parent_process_arguments parent_process_hash
    #     process_integrity_level process_path process_name process_arguments process_hash process_id
    #     additional_logged_in_users_list module_name_list module_hash_list
    #     src dest_hostname dest dest_port transport firstTime lastTime
    #   | `cisco_nvm___mshtml_or_mshta_network_execution_without_url_in_cli_filter`
  condition: selection
level: medium
