title: Cisco Secure Firewall - Communication Over Suspicious Ports
id: 8d111771-d18b-4447-9696-c317ff5965c7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___communication_over_suspicious_ports.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1059.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
    value: 'unknown'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
