title: Cisco Secure Firewall - High Priority Intrusion Classification
id: 8259efb2-3879-479b-b3c0-635abea0a908
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___high_priority_intrusion_classification.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1071
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
