title: Detect Outbound SMB Traffic
id: 119df844-119d-419d-a19d-119df8440000
status: stable
description: Detection rule for MITRE ATT&CK technique T1071.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_outbound_smb_traffic.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1071.002
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` 
    #   earliest(_time) as start_time 
    #   latest(_time) as end_time 
    #   values(All_Traffic.action) as action 
    #   values(All_Traffic.app) as app
    #   values(sourcetype) as sourcetype count 
    #   from datamodel=Network_Traffic where
    #     All_Traffic.action IN ("allowed", "allow") AND
    #     (All_Traffic.dest_port=139 OR All_Traffic.dest_port=445 OR All_Traffic.app="smb")
    #   AND All_Traffic.src_ip IN (
    #     "10.0.0.0/8","172.16.0.0/12","192.168.0.0/16"
    #   ) 
    #   AND NOT All_Traffic.dest_ip IN (
    #   "10.0.0.0/8", "172.16.0.0/12", "192.168.0.0/16", "100.64.0.0/10", 
    #   "127.0.0.0/8", "169.254.0.0/16", "192.0.0.0/24", "192.0.0.0/29", "192.0.0.8/32", 
    #   "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24", 
    #   "192.31.196.0/24", "192.52.193.0/24", "192.88.99.0/24", "224.0.0.0/4", "192.175.48.0/24", 
    #   "198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4", "::1"
    #   )
    #   by All_Traffic.action All_Traffic.app All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out
    #   All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.dvc All_Traffic.protocol
    #   All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip All_Traffic.src_port
    #   All_Traffic.transport All_Traffic.user All_Traffic.vendor_product All_Traffic.rule 
    #   | `drop_dm_object_name("All_Traffic")`  
    #   | `security_content_ctime(start_time)`  
    #   | `security_content_ctime(end_time)` 
    #   | iplocation dest_ip 
    #   | `detect_outbound_smb_traffic_filter`
  condition: selection
level: medium
