title: Cisco Stage Data
id: 85cb5cac-86df-4fdb-9c79-820f6a5156e2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1074.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_moving_data.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1074
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'tftp'
          - 'rcp'
          - 'puts'
          - 'copy'
          - 'configure replace'
          - 'archive tar'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
