title: Detect Outbound SMB Traffic
id: 343b51c6-d28b-47ed-8b06-e89d984ee3d0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1071/002/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_outbound_smb_traffic.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1071.002
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Traffic'
    dest_port:
      - '139'
      - '445'
    app: 'smb'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
