title: Cisco BGP Authentication Failures
id: 4c999144-4c99-4c99-ac99-4c9991440000
status: stable
description: Detection rule for MITRE ATT&CK technique T1078
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/bgp/cisco_bgp_md5_auth_failed.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1078
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     keywords_bgp_cisco:
    #         '|all':
    #             - ':179' # Protocol
    #             - 'IP-TCP-3-BADAUTH'
    #     condition: keywords_bgp_cisco
    # 
  condition: selection
level: medium
