title: Cobalt Strike DNS Beaconing
id: 132f71f2-132f-432f-a32f-132f71f20000
status: stable
description: Detection rule for MITRE ATT&CK technique T1071.004
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/dns/net_dns_mal_cobaltstrike.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1071.004
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection1:
    #         query|startswith:
    #             - 'aaa.stage.'
    #             - 'post.1'
    #     selection2:
    #         query|contains: '.stage.123456.'
    #     condition: 1 of selection*
    # 
  condition: selection
level: medium
