title: Cisco File Deletion
id: 1ce38e77-af4f-4e16-bd72-3c42eb423619
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_file_deletion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.004
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'erase'
          - 'delete'
          - 'format'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
