title: Cisco BGP Authentication Failures
id: 9aa1324f-8930-46b9-86bc-5e89a349d364
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/bgp/cisco_bgp_md5_auth_failed.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords_bgp_cisco:
          '|all':
              - ':179' # Protocol
              - 'IP-TCP-3-BADAUTH'
      condition: keywords_bgp_cisco
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
