title: DNS Query Length Outliers - MLTK
id: 7a2c3b07-a9d5-4815-ac48-5e00c628077f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1071/004/
  - https://github.com/splunk/security_content/blob/develop/detections/network/dns_query_length_outliers___mltk.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1071.004
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Resolution'
    record_type: '*'
    query_length: 'len(query)'
    threshold: '0.01'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
