title: Network Traffic to Active Directory Web Services Protocol
id: 637b583e-637b-437b-a37b-637b583e0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1087.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/network_traffic_to_active_directory_web_services_protocol.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1087.002
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats count from datamodel=Network_Traffic where All_Traffic.dest_port=9389
    #   by All_Traffic.action All_Traffic.app All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port
    #   All_Traffic.direction All_Traffic.dvc All_Traffic.protocol All_Traffic.protocol_version
    #   All_Traffic.src All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport All_Traffic.user
    #   All_Traffic.vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `drop_dm_object_name("All_Traffic")` | `network_traffic_to_active_directory_web_services_protocol_filter`
  condition: selection
level: medium
