title: Cisco Collect Data
id: 80e3a442-acbe-4e6b-86e0-7b67541aecfd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_collect_data.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1087.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'show running-config'
          - 'show startup-config'
          - 'show archive config'
          - 'more'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
