title: Detect Large ICMP Traffic
id: 43ce427d-1e7a-467c-9911-f6e2b902d2ae
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1095.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_large_icmp_traffic.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1095
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Traffic'
    protocol: 'icmp'
    transport: 'icmp)'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
