title: Cisco Secure Firewall - Connection to File Sharing Domain
id: 28b2e5f5-4162-4d0f-bc07-04e100940bd2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1090/002/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___connection_to_file_sharing_domain.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1090.002
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
