title: Cisco Stage Data
id: 5cc2fd88-295f-4eac-ab83-5671a066d018
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1105.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_moving_data.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1105
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'tftp'
          - 'rcp'
          - 'puts'
          - 'copy'
          - 'configure replace'
          - 'archive tar'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
