title: Cisco BGP Authentication Failures
id: 6ea74815-3a1c-4b33-84b4-1d29a7bc34dd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/bgp/cisco_bgp_md5_auth_failed.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords_bgp_cisco:
          '|all':
              - ':179' # Protocol
              - 'IP-TCP-3-BADAUTH'
      condition: keywords_bgp_cisco
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
