title: Hosts receiving high volume of network traffic from email server
id: f0c9f4c2-44f0-4c80-bcbf-a3e573e6b161
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://github.com/splunk/security_content/blob/develop/detections/network/hosts_receiving_high_volume_of_network_traffic_from_email_server.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1114.002
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Traffic'
    dest_category: 'email_server'
    span: '1d'
    minimum_data_samples: '4,'
    deviation_threshold: '3'
    num_standard_deviations_away_from_server_average: 'round(abs(bytes_in'
    num_standard_deviations_away_from_client_average: 'round(abs(bytes_in'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
