title: Cisco Network Interface Modifications
id: 74d6f66a-fd2e-420a-9b9c-f529c7904dfd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1133.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_network_interface_modifications.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1133
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Change.All_Changes'
    command:
      - '*interface*'
      - '*LINEPROTO-5-UPDOWN*'
      - '*ip'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
