title: Cisco IOS Suspicious Privileged Account Creation
id: 2a36ae17-4eef-4975-a262-e253e1c4b6d6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1136/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_ios_suspicious_privileged_account_creation.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1136
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Change.All_Changes'
    command:
      - '*username'
      - '*username'
      - '*USER'
      - '*USER_PRIVILEGE_UPDATE*priv-15*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
