title: Potential PetitPotam Attack Via EFS RPC Calls
id: 53cd9fd1-53cd-43cd-a3cd-53cd9fd10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1187
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/zeek/zeek_dce_rpc_potential_petit_potam_efs_rpc_call.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1187
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         operation|startswith: 'efs'
    #     condition: selection
    # 
  condition: selection
level: medium
