title: Detect hosts connecting to dynamic domain providers
id: 60fdd564-60fd-40fd-a0fd-60fdd5640000
status: stable
description: Detection rule for MITRE ATT&CK technique T1189
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_hosts_connecting_to_dynamic_domain_providers.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1189
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime
    #     from datamodel=Network_Resolution where
    #     DNS.query=*
    #     NOT DNS.query IN ("-", "unknown")
    #     by DNS.answer DNS.answer_count DNS.query DNS.query_count
    #        DNS.reply_code_id DNS.src DNS.vendor_product
    #   | `drop_dm_object_name("DNS")`
    #   | `security_content_ctime(firstTime)`
    #   | lookup update=true dynamic_dns_providers_default dynamic_dns_domains as query OUTPUTNEW isDynDNS_default
    #   | lookup update=true dynamic_dns_providers_local dynamic_dns_domains as query OUTPUTNEW isDynDNS_local
    #   | eval isDynDNS = coalesce(isDynDNS_local,isDynDNS_default)
    #   |fields - isDynDNS_default, isDynDNS_local| search isDynDNS=True
    #   | `detect_hosts_connecting_to_dynamic_domain_providers_filter`
  condition: selection
level: medium
