title: Cisco Secure Firewall - Lumma Stealer Activity
id: 17a21d77-887a-4a5b-aab8-fd79ff22d743
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___lumma_stealer_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
    span: '15m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
