title: RegAsm.EXE Initiating Network Connection To Public IP
id: 43e63b78-43e6-43e6-a3e6-43e63b780000
status: stable
description: Detection rule for MITRE ATT&CK technique T1218.009
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_regasm_network_activity.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1218.009
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Initiated: 'true'
    #         Image|endswith: '\regasm.exe'
    #     filter_main_local_ranges:
    #         DestinationIp|cidr:
    #             - '127.0.0.0/8'
    #             - '10.0.0.0/8'
    #             - '172.16.0.0/12'
    #             - '192.168.0.0/16'
    #             - '169.254.0.0/16'
    #             - '::1/128'  # IPv6 loopback
    #             - 'fe80::/10'  # IPv6 link-local addresses
    #             - 'fc00::/7'  # IPv6 private addresses
    #     condition: selection and not 1 of filter_main_*
    # 
  condition: selection
level: medium
