title: Cisco Secure Firewall - Communication Over Suspicious Ports
id: 1998de10-ce9a-47b3-aa36-eabf0813f473
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1219.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___communication_over_suspicious_ports.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1219
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
    value: 'unknown'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
