title: Cisco Secure Firewall - Static Tundra Smart Install Abuse
id: 6e850069-d673-41ef-9f07-6012f7bdf2dd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1499.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1499/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___static_tundra_smart_install_abuse.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1499
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
    span: '15m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
