title: Cisco Denial of Service
id: 216b1780-1954-4fd7-9923-1bed3e9a7f74
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1495.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1495/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_dos.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1495
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'shutdown'
          - 'config-register 0x2100'
          - 'config-register 0x2142'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
