title: Detect ARP Poisoning
id: ac8a69a1-8e84-4f80-9d6b-b1fb2fdae5a4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1498.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1498/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_arp_poisoning.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1498
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    facility: 'PM'
    mnemonic: 'ERR_DISABLE'
    disable_cause: 'arp-inspection'
    src_interface: 'src_int_prefix_long+src_int_suffix'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
