title: Large Volume of DNS ANY Queries
id: 636a8a72-c436-4b5d-88a6-45d18c489f9b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1498.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1498/002/
  - https://github.com/splunk/security_content/blob/develop/detections/network/large_volume_of_dns_any_queries.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1498.002
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Resolution'
    nodename: 'DNS'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
