title: Cisco Modify Configuration
id: f23c4167-8dfd-4557-aae1-919816791d97
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1505/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_modify_config.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1505
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'ip http server'
          - 'ip https server'
          - 'kron policy-list'
          - 'kron occurrence'
          - 'policy-list'
          - 'access-list'
          - 'ip access-group'
          - 'archive maximum'
          - 'ntp server'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
