title: Cisco Configuration Archive Logging Analysis
id: 1930d051-1930-4930-a930-1930d0510000
status: stable
description: Detection rule for MITRE ATT&CK technique T1505.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_configuration_archive_logging_analysis.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1505.003
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(All_Changes.command) as commands min(_time) as firstTime max(_time) as lastTime from datamodel=Change.All_Changes
    #   where (
    #   (All_Changes.command="*username*privilege 15*") OR
    #   (All_Changes.command="*username*password*") OR
    #   (All_Changes.command="*USER TABLE MODIFIED*") OR
    #   (All_Changes.command="*tftp-server*") OR
    #   (All_Changes.command="*snmp-server community*")
    #   )
    #   by All_Changes.dvc All_Changes.user
    #   | `drop_dm_object_name("All_Changes")`
    #   | rename dvc as dest
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_configuration_archive_logging_analysis_filter`
  condition: selection
level: medium
