title: Cisco Modify Configuration
id: 30e7188f-30e7-40e7-a0e7-30e7188f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1505
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_modify_config.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1505
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     keywords:
    #         - 'ip http server'
    #         - 'ip https server'
    #         - 'kron policy-list'
    #         - 'kron occurrence'
    #         - 'policy-list'
    #         - 'access-list'
    #         - 'ip access-group'
    #         - 'archive maximum'
    #         - 'ntp server'
    #     condition: keywords
    # 
  condition: selection
level: medium
