title: Cisco Configuration Archive Logging Analysis
id: 4b5feda3-3ee3-4b38-b585-dc41763fb0ce
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_configuration_archive_logging_analysis.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1505.003
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Change.All_Changes'
    command:
      - '*username*privilege'
      - '*username*password*'
      - '*USER'
      - '*tftp-server*'
      - '*snmp-server'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
