title: Detect Software Download To Network Device
id: 9b905d4d-811d-44fd-b2a0-5859ffad3742
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1542.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1542/005/
  - https://github.com/splunk/security_content/blob/develop/detections/network/detect_software_download_to_network_device.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1542.005
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Network_Traffic'
    transport:
      - 'udp'
      - 'tcp'
      - 'tcp'
    dest_port:
      - '69)'
      - '21)'
      - '22)'
    src_category:
      - 'network'
      - 'router'
      - 'switch'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
