title: Windows WinLogon with Public Network Connection
id: 55d02bf1-55d0-45d0-a5d0-55d02bf10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1542.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_winlogon_with_public_network_connection.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1542.003
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN (winlogon.exe) Processes.process!=unknown
    #   by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | join process_id
    #   [| tstats `security_content_summariesonly` count FROM datamodel=Network_Traffic.All_Traffic
    #   where All_Traffic.dest_port != 0 NOT (All_Traffic.dest IN (127.0.0.1,10.0.0.0/8,172.16.0.0/12,
    #   192.168.0.0/16, 0:0:0:0:0:0:0:1)) by All_Traffic.process_id All_Traffic.dest All_Traffic.dest_port
    #   | `drop_dm_object_name(All_Traffic)` | rename dest as publicIp ] | table dest parent_process_name
    #   process_name process_path process process_id dest_port publicIp | `windows_winlogon_with_public_network_connection_filter`
  condition: selection
level: medium
