title: Cisco BGP Authentication Failures
id: 6b8270b6-6b82-4b82-ab82-6b8270b60000
status: stable
description: Detection rule for MITRE ATT&CK technique T1557
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/bgp/cisco_bgp_md5_auth_failed.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1557
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     keywords_bgp_cisco:
    #         '|all':
    #             - ':179' # Protocol
    #             - 'IP-TCP-3-BADAUTH'
    #     condition: keywords_bgp_cisco
    # 
  condition: selection
level: medium
