title: Cisco Crypto Commands
id: a7e2ad52-b114-4625-a8a9-ac127da3671d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_crypto_actions.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.004
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'crypto pki export'
          - 'crypto pki import'
          - 'crypto pki trustpoint'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
