title: Potential PetitPotam Attack Via EFS RPC Calls
id: 65025967-6502-4502-a502-650259670000
status: stable
description: Detection rule for MITRE ATT&CK technique T1557.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/zeek/zeek_dce_rpc_potential_petit_potam_efs_rpc_call.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1557.001
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         operation|startswith: 'efs'
    #     condition: selection
    # 
  condition: selection
level: medium
