title: Cisco SNMP Community String Configuration Changes
id: 4b90432a-4b90-4b90-ab90-4b90432a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1552
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_snmp_community_string_configuration_changes.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(All_Changes.command) as command min(_time) as firstTime max(_time) as lastTime from datamodel=Change.All_Changes
    #   where (
    #     (All_Changes.command="*snmp-server community*rw*") OR
    #     (All_Changes.command="*snmp-server community*ro*") OR
    #     (All_Changes.command="*snmp-server host*")
    #   )
    #   by All_Changes.dvc All_Changes.user
    # | `drop_dm_object_name("All_Changes")`
    # | rename dvc as dest
    # | `security_content_ctime(firstTime)`
    # | `security_content_ctime(lastTime)`
    # | `cisco_snmp_community_string_configuration_changes_filter`
  condition: selection
level: medium
