title: Cisco Stage Data
id: 7e900fe4-c34f-42da-9040-3956f264e69b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1560.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1560/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_moving_data.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1560.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'tftp'
          - 'rcp'
          - 'puts'
          - 'copy'
          - 'configure replace'
          - 'archive tar'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
