title: Cisco File Deletion
id: 0bc96bd3-a092-41a7-9c57-1c1842f44707
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1561.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1561/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/network/cisco/aaa/cisco_cli_file_deletion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1561.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
      keywords:
          - 'erase'
          - 'delete'
          - 'format'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
