title: Cisco Secure Firewall - Communication Over Suspicious Ports
id: 88ce469d-f526-4f8b-9609-b7a2b1983846
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1571.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1571/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___communication_over_suspicious_ports.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1571
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
    value: 'unknown'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
