title: SSL Certificates with Punycode
id: 311b2f77-7895-44c6-af05-0e0f2b090ba2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1573.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/splunk/security_content/blob/develop/detections/network/ssl_certificates_with_punycode.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1573
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    datamodel: 'Certificates.All_Certificates'
    punycode:
      - 'if(like(ssl_issuer_email_domain,'
      - '1'
    infield: 'ssl_issuer_email_domain'
    outfield: 'convertedPuny'
    jsonrecipe: '[{'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
