title: Cisco Secure Firewall - Connection to File Sharing Domain
id: 4cd35161-4cd3-4cd3-acd3-4cd351610000
status: stable
description: Detection rule for MITRE ATT&CK technique T1588.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___connection_to_file_sharing_domain.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1588.002
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # `cisco_secure_firewall` action IN ("Trust", "Allow", "allowed") EventType=ConnectionEvent url IN ("*//objects.githubusercontent.com*", "*anonfiles.com*", "*cdn.discordapp.com*", "*ddns.net*", "*dl.dropboxusercontent.com*", "*ghostbin.co*", "*glitch.me*", "*gofile.io*", "*hastebin.com*", "*mediafire.com*", "*mega.nz*", "*onrender.com*", "*pages.dev*", "*paste.ee*", "*pastebin.com*", "*pastebin.pl*", "*pastetext.net*", "*privatlab.com*", "*privatlab.net*", "*send.exploit.in*", "*sendspace.com*", "*storage.googleapis.com*", "*storjshare.io*", "*supabase.co*", "*temp.sh*", "*transfer.sh*", "*trycloudflare.com*", "*ufile.io*", "*w3spaces.com*", "*workers.dev*")
    #   | stats count min(_time) as firstTime max(_time) as lastTime 
    #     Values(src_port) as src_port
    #     Values(dest) as dest
    #     Values(dest_port) as dest_port
    #     Values(rule) as rule
    #     Values(url) as url
    #     Values(EVE_Process) as EVE_Process
    #     by src, transport, action
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)` 
    #   | `cisco_secure_firewall___connection_to_file_sharing_domain_filter`
  condition: selection
level: medium
