title: Cisco Secure Firewall - Blacklisted SSL Certificate Fingerprint
id: 80a91723-d5eb-4d1c-9c99-80b801bd543b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1588.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1588/004/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1588.004
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: '*'
    SSL_CertFingerprint: '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
