title: Cisco Secure Firewall - Blacklisted SSL Certificate Fingerprint
id: 41c725b7-41c7-41c7-a1c7-41c725b70000
status: stable
description: Detection rule for MITRE ATT&CK technique T1588.004
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1588.004
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # `cisco_secure_firewall` EventType=* SSL_CertFingerprint=*
    #   | lookup sslbl_ssl_certificate_blacklist SHA1 as SSL_CertFingerprint OUTPUT Listingdate, Listingreason
    #   | where isnotnull(Listingreason)
    #   | stats min(_time) as firstTime max(_time) as lastTime
    #           values(dest) as dest
    #           values(dest_port) as dest_port
    #           values(rule) as rule
    #           values(url) as url
    #           values(Listingreason) as Reasons
    #           values(Listingdate) as "SSL Cert Listing Dates"
    #           count by SSL_CertFingerprint src transport action
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_secure_firewall___blacklisted_ssl_certificate_fingerprint_filter`
  condition: selection
level: medium
