title: Cisco Secure Firewall - Possibly Compromised Host
id: f3010cd6-fc46-488d-9b36-f3a21c9eb02a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1587.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1587/001/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___possibly_compromised_host.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1587.001
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'IntrusionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
