title: Cisco Secure Firewall - Blocked Connection
id: f4311778-50e6-419a-9f5a-177f1caadb90
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1595/002/
  - https://github.com/splunk/security_content/blob/develop/detections/network/cisco_secure_firewall___blocked_connection.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1595.002
logsource:
  product: network
  service: firewall
  category: network_connection
detection:
  selection:
    EventType: 'ConnectionEvent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
