title: Cisco NVM - Suspicious Network Connection to IP Lookup Service API
id: 4a7c89c8-4a7c-4a7c-aa7c-4a7c89c80000
status: stable
description: Detection rule for MITRE ATT&CK technique T1590.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cisco_nvm___suspicious_network_connection_to_ip_lookup_service_api.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1590.005
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # `cisco_network_visibility_module_flowdata`
    #   dest_hostname IN (
    #           "*api.2ip.ua*", "*api.bigdatacloud.net*", "*api.ipify.org*", "*whatismyipaddress.com*",
    #           "*canireachthe.net*", "*checkip.amazonaws.com*", "*checkip.dyndns.org*", "*curlmyip.com*",
    #           "*db-ip.com*", "*edns.ip-api.com*", "*eth0.me*", "*freegeoip.app*", "*geoipy.com*", "*getip.pro*",
    #           "*icanhazip.com*", "*ident.me*", "*ifconfig.io*", "*ifconfig.me*", "*ip-api.com*", "*ip.360.cn*",
    #           "*ip.anysrc.net*", "*ip.taobao.com*", "*ip.tyk.nu*", "*ipaddressworld.com*", "*ipapi.co*",
    #           "*ipconfig.io*", "*ipecho.net*", "*ipinfo.io*", "*ipip.net*", "*iplocation.net*",
    #           "*ipof.in*", "*ipv6-test.com*", "*ipwho.is*", "*trackip.net*", "*inet-ip.info*",
    #           "*jsonip.com*", "*myexternalip.com*", "*seeip.org*",  "*wgetip.com*",
    #           "*whatismyip.akamai.com*", "*whois.pconline.com.cn*", "*wtfismyip.com*", "*ip.cn"
    #           )
    #   NOT process_name IN (
    #           "brave.exe", "chrome.exe", "firefox.exe", "iexplore.exe", "maxthon.exe",
    #           "MicrosoftEdge.exe", "msedge.exe", "msedgewebview2.exe", "opera.exe", "safari.exe",
    #           "seamonkey.exe", "vivaldi.exe", "whale.exe"
    #     )
    #   | stats count min(_time) as firstTime max(_time) as lastTime
    #           values(parent_process_arguments) as parent_process_arguments
    #           values(process_arguments) as process_arguments
    #           values(parent_process_hash) as parent_process_hash
    #           values(process_hash) as process_hash
    #           values(module_name_list) as module_name_list
    #           values(module_hash_list) as module_hash_list
    #           values(dest_port) as dest_port
    #           values(aliul) as additional_logged_in_users_list
    #           values(dest_hostname) as dest_hostname
    #           by src dest parent_process_path parent_process_integrity_level process_path process_name process_integrity_level process_id transport
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | table
    # 
    # ... [truncated]
  condition: selection
level: medium
