title: Windows DNS Gather Network Info
id: 1ee82d1f-1ee8-4ee8-aee8-1ee82d1f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1590.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_dns_gather_network_info.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1590.002
logsource:
  product: network
  service: firewall
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "dnscmd.exe"
    #   Processes.process = "* /enumrecords *" by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name("Processes")`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_dns_gather_network_info_filter`
  condition: selection
level: medium
