title: Rare Subscription-level Operations In Azure
id: 5dce0f0a-326a-454e-bf18-23b59892b420
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_rare_operations.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      keywords:
          - Microsoft.DocumentDB/databaseAccounts/listKeys/action
          - Microsoft.Maps/accounts/listKeys/action
          - Microsoft.Media/mediaservices/listKeys/action
          - Microsoft.CognitiveServices/accounts/listKeys/action
          - Microsoft.Storage/storageAccounts/listKeys/action
          - Microsoft.Compute/snapshots/write
          - Microsoft.Network/networkSecurityGroups/write
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
