title: Microsoft Intune Device Health Scripts
id: 109a272d-5b9c-462a-8a62-02cef1b1aeff
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.007.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1021/007/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1021.007
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: '*DeviceHealthScript*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
