title: AWS SSM Session Started to EC2 Instance
id: de12c1dc-3d5b-4f38-bace-4120e0e1b851
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1021/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/lateral_movement_aws_ssm_start_session_to_ec2_instance.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1021
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'ssm.amazonaws.com'
    event.action: 'StartSession'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
