title: O365 DLP Rule Triggered
id: 85fa69e8-6d64-4c6f-a83b-ad5e4de275e0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_dlp_rule_triggered.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Operation: 'DLPRuleMatch'
    src_user: 'UserId,'
    file_name: 'case(NOT'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
