title: Gsuite Outbound Email With Attachment To External Domain
id: d4d26b55-09b1-4b2d-b16c-e1e0cc242401
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gsuite_outbound_email_with_attachment_to_external_domain.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    field:
      - 'source.from_header_address'
      - 'destination{}.address'
    source_domain: 'internal_test_email.com'
    dest_domain: 'internal_test_email.com'
    phase: 'plan'
    severity: 'low'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
