title: Kubernetes Cron Job Creation
id: d8f26733-1b81-4c64-a947-b3803970a3ed
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.007.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1053/007/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/kubernetes_cron_job_creation.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1053.007
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    verb: 'create'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
