title: Azure Kubernetes CronJob
id: ea82ab83-419e-4572-8944-891231a1aa9a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_kubernetes_cronjob.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          operationName|startswith:
              - 'MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/BATCH'
              - 'MICROSOFT.CONTAINERSERVICE/MANAGEDCLUSTERS/BATCH'
          operationName|endswith:
              - '/CRONJOBS/WRITE'
              - '/JOBS/WRITE'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
