title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: 60b8a87d-98dc-45fc-80d1-5df77d5e5d82
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.003.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1069/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1069.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset:
      - 'azure.activitylogs'
      - 'o365.audit'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
