title: Microsoft Intune Device Health Scripts
id: 1c1ec62b-1a25-4f93-9d5f-0ef4fb8cba2a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1072.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1072/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1072
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: '*DeviceHealthScript*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
