title: User Added to an Administrator
id: c5acc0e0-19ab-41dc-906f-36a4c806d293
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_ad_user_added_to_admin_role.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          Operation: 'Add member to role.'
          Workload: 'AzureActiveDirectory'
          ModifiedProperties{}.NewValue|endswith:
              - 'Admins'
              - 'Administrator'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
