title: AWS EC2 Full Network Packet Capture Detected
id: 7cc17679-aa38-4e3f-91f1-303de2aa6e14
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1074.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/exfiltration_ec2_full_network_packet_capture_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1074
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'ec2.amazonaws.com'
    event.action: 'CreateTrafficMirrorSession'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
