title: Azure Subscription Permission Elevation Via ActivityLogs
id: 7b957dc5-ee1b-4e88-86d6-ca6868e79842
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_subscription_permissions_elevation_via_activitylogs.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          operationName: MICROSOFT.AUTHORIZATION/ELEVATEACCESS/ACTION
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
