title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: 8f6c3fe7-598a-465b-b407-00758a09bf1f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1082.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset:
      - 'azure.activitylogs'
      - 'o365.audit'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
