title: AWS IAM Principal Enumeration via UpdateAssumeRolePolicy
id: ac1d3b26-723b-4cfd-a849-ee209728aff1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1087/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/discovery_iam_principal_enumeration_via_update_assume_role_policy.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1087
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'UpdateAssumeRolePolicy'
    aws.cloudtrail.error_code: 'MalformedPolicyDocumentException'
    event.outcome: 'failure'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
