title: Added Credentials to Existing Application
id: fcc1c38b-63c4-432a-a610-28a6a8cdc444
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_app_credential_added.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098.001
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message:
              - Update application – Certificates and secrets management
              - Update Service principal/Update Application
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
