title: Azure AD FullAccessAsApp Permission Assigned
id: 70e9730e-82c5-4307-a0a6-0a4f67fe0ae4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1098/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_fullaccessasapp_permission_assigned.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1098.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    category: 'AuditLogs'
    operationName: '\'
    newvalue: 'mvindex('
    input: 'newvalue'
    Permissions: '{}.RequiredAppPermissions{}.EntitlementId'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
