title: Microsoft Intune Device Health Scripts
id: aaadf4a3-a3ab-4bdc-96e7-6f45169807d0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1105.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1105
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: '*DeviceHealthScript*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
