title: O365 Email Password and Payroll Compromise Behavior
id: e775d88a-04a7-4ace-9fe3-b9e0c839b002
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1114/001/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_email_password_and_payroll_compromise_behavior.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1114.001
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    mailtime: '_time'
    span:
      - '4hr'
      - '4hr'
    user:
      - 'lower(RecipientAddress)'
      - 'lower(UserId)'
    InternetMessageId:
      - 'lower(MessageId)'
      - 'lower(InternetMessageId),'
    max: '0'
    Workload: 'Exchange'
    path: 'AffectedItems{}'
    output: 'AffectedItemSplit'
    input: 'AffectedItemSplit'
    deltime: '_time'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
