title: Microsoft Graph Request Email Access by Unusual User and Client
id: ad4c9e0a-38a3-41ca-a0e7-35e3ea86cc82
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/collection_graph_email_access_by_unusual_public_client_via_graph.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1114
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'azure.graphactivitylogs'
    azure.graphactivitylogs.properties.c_idtyp: 'user'
    azure.graphactivitylogs.properties.scopes: 'Mail.Read'
    azure.graphactivitylogs.properties.app_id: '*'
    azure.graphactivitylogs.result_signature: '200'
    azure.graphactivitylogs.properties.client_auth_method: '0'
    http.request.method: '(GET'
    url.path: '(/v1.0/me/*cc'
    azure.graphactivitylogs.properties.requestUri: '(*mail*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
