title: O365 Mailbox Inbox Folder Shared with All Users
id: d90b649f-803d-47c5-99ef-8d692c704dd9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_mailbox_inbox_folder_shared_with_all_users.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1114
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Operation: 'ModifyFolderPermissions'
    Workload: 'Exchange'
    object: 'Inbox'
    MemberUpn: 'Everyone'
    isReadRole:
      - 'if(match('
      - '\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
