title: Azure AD High Number Of Failed Authentications For User
id: 7112d4cc-0d4a-4103-a174-710233e0fcb1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_high_number_of_failed_authentications_for_user.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.001
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    category: 'SignInLogs'
    errorCode: '50126'
    succeeded: 'false'
    span: '10m'
    value: 'null'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
