title: Password Spray Activity
id: 3c150638-2351-45c1-ac0c-71ed04e92b30
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_password_spray.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          riskEventType: 'passwordSpray'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
