title: Azure AD External Guest User Invited
id: f9e9714b-15c1-468f-8469-3cc88964d090
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1136/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_external_guest_user_invited.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1136
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: 'Invite'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
