title: AWS IAM Create User via Assumed Role on EC2 Instance
id: 0e254b71-e2c5-45da-8def-063c8de6e4af
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1136/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_iam_create_user_via_assumed_role_on_ec2_instance.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1136
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'CreateUser'
    event.outcome: 'success'
    aws.cloudtrail.user_identity.type: 'AssumedRole'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
