title: Azure AD External Guest User Invited
id: 2996d446-64a7-4018-941a-28917deea78e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1136/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_external_guest_user_invited.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1136.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: 'Invite'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
