title: Suspicious Inbox Manipulation Rules
id: e7a6fef4-3999-40c9-8c7e-0eeff904f889
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1140.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1140/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_inbox_manipulation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1140
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          riskEventType: 'mcasSuspiciousInboxManipulationRules'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
