title: Azure AD Concurrent Sessions From Different Ips
id: 20c9d7d1-7e98-4ef0-8b46-9fda119966d7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1185.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1185/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_concurrent_sessions_from_different_ips.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1185
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    succeeded: 'true'
    category: 'NonInteractiveUserSignInLogs'
    action: 'success'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
