title: O365 SharePoint Malware Detection
id: 225e4536-9d4a-4171-8893-85eba6f77ff1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_sharepoint_malware_detection.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Operation: 'FileMalwareDetected'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
