title: Risk Rule for Dev Sec Ops by Repository
id: 8085dea2-368d-4b99-b822-4cd608ae87ca
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/risk_rule_for_dev_sec_ops_by_repository.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    datamodel: 'Risk.All_Risk'
    analyticstories: 'Dev'
    risk_object_type: 'other'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
