title: Entra ID SharePoint Accessed by Unusual User and Microsoft Authentication Broker Client
id: 2811d02a-db2f-483f-abb7-84746fdb35fa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1213.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1213/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/collection_entra_id_auth_broker_sharepoint_access_for_user_principal.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1213.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'azure.signinlogs'
    azure.signinlogs.properties.app_id: '29d9ed98-a469-4536-ade2-f981bc1d605e'
    azure.signinlogs.properties.resource_id: '00000003-0000-0ff1-ce00-000000000000'
    azure.signinlogs.properties.incoming_token_type: 'refreshToken'
    azure.signinlogs.identity: '*'
    azure.signinlogs.properties.user_principal_name: '*'
    azure.signinlogs.properties.is_interactive: 'false'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
