title: Azure Blob Storage Permissions Modified
id: c7ec6f4d-dd26-4705-8fe3-3840f4c7f24c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1222.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1222/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/defense_evasion_storage_blob_permissions_modified.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1222
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    azure.activitylogs.operation_name: 'MICROSOFT.STORAGE/STORAGEACCOUNTS/BLOBSERVICES/CONTAINERS/BLOBS/MANAGEOWNERSHIP/ACTION'
    event.dataset: 'azure.activitylogs'
    event.outcome: '(Success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
