title: Azure AD New Custom Domain Added
id: eaaa5d4d-f5b7-4493-bf5b-2dfa9660606a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1484/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_new_custom_domain_added.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1484.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: 'Add'
    result: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
