title: Changes to Device Registration Policy
id: b959ee7e-92f0-4b05-9b9d-32b3d3936445
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_ad_device_registration_policy_changes.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1484
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          Category: 'Policy'
          ActivityDisplayName: 'Set device registration policies'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
