title: AWS IAM SAML Provider Updated
id: faadd95c-04af-4aa4-b719-abe195ff4f92
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1484/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/privilege_escalation_iam_saml_provider_updated.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1484.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'iam.amazonaws.com'
    event.action: 'UpdateSAMLProvider'
    event.outcome: 'success'
    source.address: 'sso.amazonaws.com'
    user_agent.original: 'sso.amazonaws.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
