title: Azure Application Deleted
id: 704d1b47-c80b-4e9d-b605-15ade0912bc0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1489.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1489/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_application_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1489
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message:
              - Delete application
              - Hard Delete application
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
