title: Azure Container Registry Created or Deleted
id: e9543be4-6f18-4311-92d0-0f7db4c0163f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1496.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1496/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_container_registry_created_or_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1496
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          operationName:
              - MICROSOFT.CONTAINERREGISTRY/REGISTRIES/WRITE
              - MICROSOFT.CONTAINERREGISTRY/REGISTRIES/DELETE
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
