title: AWS S3 Bucket Configuration Deletion
id: d734c258-227c-45c7-a74e-09de96ddfabe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1490.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/defense_evasion_s3_bucket_configuration_deletion.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 's3.amazonaws.com'
    event.action: '(DeleteBucketPolicy'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
