title: Delegated Permissions Granted For All Users
id: 8ce5b222-f425-45c6-aa59-c4e3c6e02fe5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1528.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1528/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_app_delegated_permissions_all_users.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1528
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message: Add delegated permission grant
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
