title: Delegated Permissions Granted For All Users
id: 81b64149-474e-4a7e-9ce1-43fbe7947e5c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1528.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1528/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_app_delegated_permissions_all_users.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1528
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message: Add delegated permission grant
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
