title: Azure Kubernetes Services (AKS) Kubernetes Pods Deleted
id: 8da0b043-dddc-4deb-93e4-faddf799aba9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1529.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/impact_kubernetes_pod_deleted.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1529
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    azure.activitylogs.operation_name: 'MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/PODS/DELETE'
    event.dataset: 'azure.activitylogs'
    event.outcome: '(Success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
