title: Microsoft Intune Manual Device Management
id: 44b30617-24aa-4218-a3e0-8e46a9344c6e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1529.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_manual_device_management.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1529
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    operationName: '*ManagedDevice*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
