title: CA Policy Removed by Non Approved Actor
id: 8c7c7d83-d5cd-4c75-acea-0fdad530ff4e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_aad_secops_ca_policy_removedby_bad_actor.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message: Delete conditional access policy
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
