title: AWS Lambda Function Policy Updated to Allow Public Invocation
id: f9d796ee-3570-40d8-af5a-2bc857627e58
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_lambda_backdoor_invoke_function_for_any_principal.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.action: 'AddPermission*'
    lambda: 'InvokeFunction'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
