title: Azure AD Only Single Factor Authentication Required
id: 13786a88-de6d-41d3-9377-b74e8ea3ed1c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1556/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/signin_logs/azure_ad_only_single_factor_auth_required.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1556.006
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          Status: 'Success'
          AuthenticationRequirement: 'singleFactorAuthentication'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
