title: AWS First Occurrence of STS GetFederationToken Request by User
id: 2c406dfc-c863-4a62-a23b-db0e10fc4499
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1550/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/defense_evasion_sts_get_federation_token.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1550
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'sts.amazonaws.com'
    event.action: 'GetFederationToken'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
