title: First Time Seen AWS Secret Value Accessed in Secrets Manager
id: 9794ab81-7408-4ab4-9e3c-9c365fec0eab
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1555/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/credential_access_new_terms_secretsmanager_getsecretvalue.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1555.006
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'secretsmanager.amazonaws.com'
    event.action: 'GetSecretValue'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
