title: GSuite Email Suspicious Attachment
id: fb7c995f-272b-4a21-a259-18b33d29ef20
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/gsuite_email_suspicious_attachment.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    phase: 'plan'
    severity: 'medium'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
