title: Azure Device or Configuration Modified or Deleted
id: 4c9b7b5c-05ca-4a9a-be37-10eb8c88fedd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1565.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1565/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_device_or_configuration_modified_or_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1565.001
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          properties.message:
              - Delete device
              - Delete device configuration
              - Update device
              - Update device configuration
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
