title: O365 BEC Email Hiding Rule Created
id: 60233fde-73da-4c90-91b6-28c771df22f1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_bec_email_hiding_rule_created.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1564
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Workload: 'Exchange'
    entropy_score: 'if(ut_shannon<=2,'
    len_score: 'if(len(Name)<=3,'
    read_score: 'if(MarkAsRead='
    folder_score: 'if(match(MoveToFolder,'
    suspicious_score: 'entropy_score+len_score+read_score+folder_score'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
