title: Entra ID OAuth Device Code Flow with Concurrent Sign-ins
id: f69b6124-47c0-446c-ae9b-7ae7b55e0a36
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/credential_access_azure_entra_susp_device_code_signin.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1566.002
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Require: '2+'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
