title: O365 Advanced Audit Disabled
id: 04e36f8f-3238-4740-b73e-16bafb55f78d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.008.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1562/008/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_advanced_audit_disabled.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1562.008
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    Operation: '\'
    property_name:
      - 'mvindex'
      - '\'
    additionalDetails: 'mvindex('
    split_value: 'split(additionalDetails,\'
    possible_plan: 'mvindex(split_value,'
    field: '\'
    DisabledPlans: '\\[(?P<DisabledPlans>[^\\]]+)\\]\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
