title: AWS CloudWatch Alarm Deletion
id: 32172115-23e9-40d9-9ee3-6ecaa27ab83c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1562/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/defense_evasion_cloudwatch_alarm_deletion.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1562.006
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'monitoring.amazonaws.com'
    event.action: 'DeleteAlarms'
    event.outcome: 'success'
    user_agent.original: 'AWS Internal'
    source.ip: '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
