title: Azure Active Directory Hybrid Health AD FS Service Delete
id: 7f7ca397-10d3-4bc0-a5dd-8b97e31cb7b7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1578.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1578/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_aadhybridhealth_adfs_service_delete.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1578.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          CategoryValue: 'Administrative'
          ResourceProviderValue: 'Microsoft.ADHybridHealthService'
          ResourceId|contains: 'AdFederationService'
          OperationNameValue: 'Microsoft.ADHybridHealthService/services/delete'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
