title: Okta Non-Standard VPN Usage
id: 1985bb73-9d05-446a-b500-9e6998cd9975
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1572.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1572/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/okta_non_standard_vpn_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1572
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    user:
      - 'coalesce('
      - 'mvindex(split(user,'
    status: 'case(match(_raw,'
    value: 'N/A'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
