title: AWS EC2 Deprecated AMI Discovery
id: 98ab3047-2b23-4632-bdba-3fc01483357c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1580.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1580/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/discovery_ec2_deprecated_ami_discovery.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1580
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'ec2.amazonaws.com'
    event.action: 'DescribeImages'
    event.outcome: 'success'
    aws.cloudtrail.flattened.request_parameters.includeDeprecated: 'true'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
