title: AWS Route 53 Private Hosted Zone Associated With a VPC
id: b2b4fba8-57f1-405a-8193-549a9cd932fe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1583.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1583/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_route_53_hosted_zone_associated_with_a_vpc.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1583
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 'route53.amazonaws.com'
    event.action: 'AssociateVPCWithHostedZone'
    event.outcome: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
