title: Azure Active Directory High Risk Sign-in
id: 32b5efb0-ba76-4441-96ce-38e9519e845d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_active_directory_high_risk_sign_in.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    category: 'UserRiskEvents'
    riskLevel: 'high'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
