title: SAML Token Issuer Anomaly
id: b2528a1b-d25e-4b09-9c0a-07e902d7733f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1606.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1606/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_token_issuer_anomaly.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1606
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
      selection:
          riskEventType: 'tokenIssuerAnomaly'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
