title: AWS S3 Bucket Enumeration or Brute Force
id: 2f9781a5-4d1c-43a9-845f-d88e4534a16d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1657.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1657/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/impact_aws_s3_bucket_enumeration_or_brute_force.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1657
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset: 'aws.cloudtrail'
    event.provider: 's3.amazonaws.com'
    aws.cloudtrail.error_code: 'AccessDenied'
    tls.client.server_name: '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
