title: Entra ID Sign-in BloodHound Suite User-Agent Detected
id: c6fd45c2-b3e4-4e82-8918-cfd71fc5ed09
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1673.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1673/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/azure/discovery_bloodhound_user_agents_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1673
logsource:
  product: azure
  service: activitylogs
  category: cloud_audit
detection:
  selection:
    event.dataset:
      - 'azure.activitylogs'
      - 'o365.audit'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
