title: Indirect Command Execution (WINDOWS - defender)
id: f1280462-a17b-4627-83e8-2e1c5338345b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1202.
  Threat Actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1202/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'bash.exe -'
      - 'bash -'
    ParentImage|endswith|contains:
      - '\bginfo.exe'
      - '\bginfo64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1202
  - actor.donex
