title: Match Legitimate Resource Name or Location (WINDOWS - sysmon)
id: 3b1d2ed0-6810-4213-9533-cce9ad8c859a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/create'
      - '-create'
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.apt41
