title: Process Injection (WINDOWS - sysmon)
id: e2152016-9fda-4ea7-a82c-4136dd844baa
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1055/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\CoercedPotato.exe'
    CommandLine|contains:
      - 'dllhost.exe'
      - 'dllhost'
    CommandLine|contains|contains:
      - ' --exploitId '
    CommandLine|contains|all|contains:
      - ' /am51'
      - ' /password'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055
  - actor.apt41
