title: Network Share Discovery (WINDOWS - sysmon)
id: 3d8a5cbc-85b6-46a2-91f1-ef28053ccf43
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1135.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1135/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cmd.exe'
      - '\powershell.exe'
      - '\pwsh.exe'
    Image|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|all|contains:
      - '/portable'
      - '/lng'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1135
  - actor.apt41
