title: Accessibility Features (WINDOWS - sysmon)
id: cc30400d-9f08-4931-9683-4c3f71c53713
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.008.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1546.008/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'copy '
      - '/y '
    ParentImage|endswith|contains:
      - '\winlogon.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\cscript.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.008
  - actor.apt41
