title: Scheduled Task/Job - GLOBAL (auditd)
id: e2cfaa3d-457b-49fd-8b85-1984a3c5ed79
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053 (Scheduled Task/Job).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_cron_jobs_creation_and_runtime.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053
  - actor.global
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.args|contains: '-l'
    process.name|contains: 'running job'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
