title: Default Accounts - GLOBAL (auditd)
id: 46c6304e-8f96-4a18-884d-c9f5a758a8b2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/kubernetes/initial_access_anonymous_request_authorized.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.global
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    kubernetes.audit.user.username|contains: 'system:anonymous'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
