title: Software Deployment Tools (WINDOWS - sysmon)
id: 8948b763-bb59-46bd-a3c8-4b7117edff06
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Cuba
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.cuba
