title: Scheduled Task (WINDOWS - sysmon)
id: f59bed78-618c-41f5-8fd8-41e6658312bc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.005.
  Threat Actor: Naikon
references:
  - https://attack.mitre.org/techniques/T1053.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\powershell.exe'
      - '\pwsh.exe'
    Image|endswith|contains:
      - '\schtasks.exe'
    CommandLine|contains|windash|contains:
      - ' /tn '
      - ' /tr '
      - ' /sc '
    CommandLine|contains|all|contains:
      - '/Create'
      - '/RU'
      - '/TR'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.005
  - actor.naikon
