title: Token Impersonation/Theft - RansomHub (security)
id: d958c656-e49a-4840-a9e2-4a9277172cd2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134.001 (Token Impersonation/Theft).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1134/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_access_token_abuse.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134.001
  - actor.ransomhub
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '9'
    LogonProcessName|contains: 'Advapi'
    AuthenticationPackageName|contains: 'Negotiate'
    ImpersonationLevel|contains: '%%1833' # Impersonation'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
