title: Local Account - RansomHub (security)
id: 8c72e8da-edcc-44e6-b453-ebcfcb95c0e7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1136.001 (Local Account).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hidden_user_creation.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1136.001
  - actor.ransomhub
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4720'
    TargetUserName|contains:
      - '$'
      - 'HomeGroupUser$'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
