title: Group Policy Modification - RansomHub (security)
id: 2b9ffe93-fe12-4b93-9b68-1fb4250c010a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1484.001 (Group Policy Modification).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1484/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_default_domain_gpo_modification.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1484.001
  - actor.ransomhub
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5136'
    ObjectClass|contains: 'groupPolicyContainer'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
