title: Active Directory Replication from Non Machine Account
id: abffe0f8-171d-42b9-bc27-c84068ab0557
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_ad_replication_non_machine_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4662
          AccessMask: '0x100'
          Properties|contains:
              - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
              - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
              - '89e95b76-444d-4c62-991a-0facbeda640c'
      filter:
          - SubjectUserName|endswith: '$'
          - SubjectUserName|startswith: 'MSOL_' # https://learn.microsoft.com/en-us/entra/identity/hybrid/connect/reference-connect-accounts-permissions#ad-ds-connector-account
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
