title: Possible Impacket SecretDump Remote Activity
id: 35fc187e-908c-4428-9768-0666ae7dd338
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 5145
          ShareName: '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$
          RelativeTargetName|contains|all:
              - 'SYSTEM32\'
              - '.tmp'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
