title: LSASS Access From Non System Account
id: f717b705-3b4d-4e93-a88b-37656f110c29
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_lsass_access_non_system_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID:
              - 4663
              - 4656
          AccessMask:
              - '0x100000'
              - '0x1010'    # car.2019-04-004
              - '0x1400'
              - '0x1410'    # car.2019-04-004
              - '0x1418'    # car.2019-04-004
              - '0x1438'    # car.2019-04-004
              - '0x143a'    # car.2019-04-004
              - '0x1f0fff'
              - '0x1f1fff'
              - '0x1f2fff'
              - '0x1f3fff'
              - '0x40'
              - '143a'    # car.2019-04-004
              - '1f0fff'
              - '1f1fff'
              - '1f2fff'
              - '1f3fff'
              # - '0x1000'  # minimum access requirements to query basic info from service
          ObjectType: 'Process'
          ObjectName|endswith: '\lsass.exe'
      filter_main_service_account:
          SubjectUserName|endswith: '$'
      filter_main_generic:
          ProcessName|contains:
              # Legitimate AV and EDR solutions
              - ':\Program Files\'
              - ':\Program Files (x86)\'
      filter_main_wmiprvse:
          ProcessName: 'C:\Windows\System32\wbem\WmiPrvSE.exe'
          AccessMask: '0x1410'
      filter_optional_steam:
          ProcessName|contains: '\SteamLibrary\steamapps\'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
