title: Linux Possible Access To Credential Files
id: 1a28e628-d7f8-4976-a69c-e2e4214c8e87
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.008.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1003/008/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_possible_access_to_credential_files.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1003.008
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
