title: Crash Dump Created By Operating System
id: 97701117-5e8a-4c44-8a96-28f0fcaa6558
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/system/microsoft_windows_wer_systemerrorreporting/win_system_crash_dump_created.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1005
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Provider_Name: 'Microsoft-Windows-WER-SystemErrorReporting'
          EventID: 1001
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
