title: Linux Possible Access To Credential Files
id: 7f5a54bd-7f5a-4f5a-af5a-7f5a54bd0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003.008
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_possible_access_to_credential_files.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1003.008
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN("cat",
    #   "nano*","vim*", "vi*")  AND Processes.process IN("*/etc/shadow*", "*/etc/passwd*")
    #   by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    #   Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    #   Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
    #   Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
    #   Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    #   | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `linux_possible_access_to_credential_files_filter`
  condition: selection
level: medium
