title: PowerShell Invoke-NinjaCopy script
id: 687dbd46-8c30-4d43-949e-03f8ed3d980a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_posh_invoke_ninjacopy.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text:
      - 'StealthReadFile'
      - 'sentinelbreakpoints'
    user.id: 'S-1-5-18'
    event.category: 'process'
    host.os.type: 'windows'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
