title: Linux Kernel Module Enumeration
id: aac8d560-b67e-4670-9764-877112b189ba
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1014.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_kernel_module_enumeration.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1014
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'kmod'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
