title: Share And Session Enumeration Using Net.EXE
id: d6a63b08-7c84-4d6a-8c96-4d496ac7c21b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1018.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1018/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_view_share_and_sessions_enum.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1018
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - '\net.exe'
                - '\net1.exe'
          - OriginalFileName:
                - 'net.exe'
                - 'net1.exe'
      selection_cli:
          CommandLine|contains: 'view'
      filter:
          CommandLine|contains: '\\\\'
      condition: all of selection_* and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
