title: Linux Kernel Module Enumeration
id: 606c1737-606c-406c-a06c-606c17370000
status: stable
description: Detection rule for MITRE ATT&CK technique T1014
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_kernel_module_enumeration.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1014
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process_name=kmod
    #   Processes.process IN ("*lsmod*", "*list*") by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_kernel_module_enumeration_filter`
  condition: selection
level: medium
