title: SCM Database Handle Failure
id: 1a68a35b-d225-4fd1-a740-949b49e04238
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1010.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1010/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_scm_database_handle_failure.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1010
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4656
          ObjectType: 'SC_MANAGER OBJECT'
          ObjectName: 'ServicesActive'
          AccessMask: '0xf003f'  # is used in the reference; otherwise too many FPs
          # Keywords: 'Audit Failure' <-> in the ref 'Keywords':-9214364837600034816
      filter:
          SubjectLogonId: '0x3e4'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
