title: Potential Remote PowerShell Session Initiated
id: 79c65862-aceb-4f84-96b6-2b5762342fb0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_susp_remote_powershell_session.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          DestinationPort:
              - 5985
              - 5986
          Initiated: 'true' # only matches of the initiating system can be evaluated
          SourceIsIpv6: 'false'
      filter_main_service_users:
          - User|contains: # covers many language settings for Network Service. Please expand
                - 'NETWORK SERVICE'
                - 'NETZWERKDIENST'
                - 'SERVICIO DE RED'
                - 'SERVIZIO DI RETE'
          - User|contains|all:
                - 'SERVICE R'
                - 'SEAU'
      filter_main_localhost:
          SourceIp:
              - '::1'
              - '127.0.0.1'
          DestinationIp:
              - '::1'
              - '127.0.0.1'
      filter_optional_avast:
          Image:
              - 'C:\Program Files\Avast Software\Avast\AvastSvc.exe'
              - 'C:\Program Files (x86)\Avast Software\Avast\AvastSvc.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
