title: HackTool - WinRM Access Via Evil-WinRM
id: ea7a5804-760a-439c-a52b-a8bae9f13de8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_evil_winrm.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\ruby.exe'
          CommandLine|contains|all:
              - '-i '
              - '-u '
              - '-p '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
