title: Windows Process Executed From Removable Media
id: 0af8b547-0af8-4af8-aaf8-0af8b5470000
status: stable
description: Detection rule for MITRE ATT&CK technique T1025
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_process_executed_from_removable_media.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1025
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(Processes.process)\
    #   \ as process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes\
    #   \ where Processes.process_current_directory=* AND NOT Processes.process_current_directory\
    #   \ IN (\"C:\\\\*\",\"*\\\\sysvol\\\\*\") \nby Processes.action Processes.dest Processes.original_file_name\
    #   \ Processes.parent_process Processes.parent_process_exec \nProcesses.parent_process_guid\
    #   \ Processes.parent_process_id Processes.parent_process_name \nProcesses.parent_process_path\
    #   \ Processes.process Processes.process_exec Processes.process_guid Processes.process_hash\
    #   \ \nProcesses.process_id Processes.process_integrity_level Processes.process_name\
    #   \ Processes.process_path \nProcesses.user Processes.user_id Processes.vendor_product\
    #   \ Processes.process_current_directory\n| `drop_dm_object_name(Processes)` \n| rex\
    #   \ field=process_current_directory \"^(?<object_handle>[^\\\\\\]+\\\\\\)\" \n| where\
    #   \ isnotnull(object_handle) \n| `security_content_ctime(firstTime)` \n| `security_content_ctime(lastTime)`\
    #   \ \n| join dest,object_handle \n  [| tstats `security_content_summariesonly` count\
    #   \ values(Registry.action) as action values(Registry.process_guid) as process_guid\
    #   \ values(Registry.process_id) as process_id values(Registry.registry_hive) as registry_hive\
    #   \ values(Registry.registry_key_name) as registry_key_name values(Registry.registry_value_name)\
    #   \ as registry_value_name values(Registry.registry_value_type) as registry_value_type\
    #   \ values(Registry.status) as status values(Registry.user) as user values(Registry.vendor_product)\
    #   \ as vendor_product from datamodel=Endpoint.Registry where Registry.registry_value_data=\"\
    #   *:\\\\*\" AND Registry.registry_path=\"*USBSTOR*\" AND Registry.registry_path IN\
    #   \ (\"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows Portable Devices\\\\Devices\\\\*\"\
    #   ,\"HKLM\\\\System\\\\CurrentControlSet\\\\Enum\\\\SWD\\\\WPDBUSENUM\\\\*\") 
    # ... [truncated]
  condition: selection
level: medium
