title: Privilege Escalation via Named Pipe Impersonation
id: f8ee4df6-9c36-402e-93ee-3411a8e2cd44
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_priv_escalation_via_named_pipe.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_name:
          - Image|endswith:
                - '\cmd.exe'
                - '\powershell.exe'
          - OriginalFileName:
                - 'Cmd.Exe'
                - 'PowerShell.EXE'
      selection_args:
          CommandLine|contains|all:
              - 'echo'
              - '>'
              - '\\\\.\\pipe\\'
      condition: all of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
