title: Powershell Token Obfuscation - Process Creation
id: 5113a584-cef5-4315-9e3e-67742e2b42d4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_token_obfuscation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.009
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          # Examples:
          #   IN`V`o`Ke-eXp`ResSIOn (Ne`W-ob`ject Net.WebClient).DownloadString
          #   &('In'+'voke-Expressi'+'o'+'n') (.('New-Ob'+'jec'+'t') Net.WebClient).DownloadString
          #   &("{2}{3}{0}{4}{1}"-f 'e','Expression','I','nvok','-') (&("{0}{1}{2}"-f'N','ew-O','bject') Net.WebClient).DownloadString
          - CommandLine|re: '\w+`(\w+|-|.)`[\w+|\s]'
          # - CommandLine|re: '\((\'(\w|-|\.)+\'\+)+\'(\w|-|\.)+\'\)' TODO: fixme
          - CommandLine|re: '"(\{\d\})+"\s*-f'
          #   ${e`Nv:pATh}
          - CommandLine|re: '(?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}'
      filter_main_envpath:
          CommandLine|contains: '${env:path}'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
