title: Windows Obfuscated Files or Information via RAR SFX
id: f92bb104-808b-456c-b18d-7744beea75c5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.013.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1027/013/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_obfuscated_files_or_information_via_rar_sfx.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1027.013
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventCode: '11'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
