title: Enable RDP In Other Port Number
id: 3f37a30d-3f37-4f37-af37-3f37a30d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1021
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/enable_rdp_in_other_port_number.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1021
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\CurrentControlSet\\Control\\Terminal
    #   Server\\WinStations\\RDP-Tcp*" Registry.registry_value_name = "PortNumber") by Registry.action
    #   Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    #   Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    #   Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    #   | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `enable_rdp_in_other_port_number_filter`
  condition: selection
level: medium
