title: New or Renamed User Account with
id: 3e5c5ddc-10d2-4dac-82d4-49f8ace6825d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_new_or_renamed_user_account_with_dollar_sign.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_create:
          EventID: 4720 # create user
          SamAccountName|contains: '$'
      selection_rename:
          EventID: 4781 # rename user
          NewTargetUserName|contains: '$'
      filter_main_homegroup:
          EventID: 4720
          TargetUserName: 'HomeGroupUser$'
      condition: 1 of selection_* and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
