title: HackTool - SharpLdapWhoami Execution
id: 0c195361-c248-494b-b587-a64c61f39e08
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1033.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1033/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_sharpldapwhoami.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1033
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_name:
          Image|endswith: '\SharpLdapWhoami.exe'
      selection_pe: # in case the file has been renamed after compilation
          - OriginalFileName|contains: 'SharpLdapWhoami'
          - Product: 'SharpLdapWhoami'
      selection_flags1:
          CommandLine|endswith:
              - ' /method:ntlm'
              - ' /method:kerb'
              - ' /method:nego'
              - ' /m:nego'
              - ' /m:ntlm'
              - ' /m:kerb'
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
