title: File Download Via Bitsadmin
id: 2fab336b-673e-4bc3-8bad-351920145dd0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bitsadmin_download.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\bitsadmin.exe'
          - OriginalFileName: 'bitsadmin.exe'
      selection_cmd:
          CommandLine|contains: ' /transfer '
      selection_cli_1:
          CommandLine|contains:
              - ' /create '
              - ' /addfile '
      selection_cli_2:
          CommandLine|contains: 'http'
      condition: selection_img and (selection_cmd or all of selection_cli_*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
