title: Suspicious Process Executed From Container File
id: 1747ff69-1747-4747-a747-1747ff690000
status: stable
description: Detection rule for MITRE ATT&CK technique T1036.008
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/suspicious_process_executed_from_container_file.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1036.008
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(Processes.process_name)
    #   as process_name min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
    #   where Processes.process IN ("*.ZIP\\*","*.ISO\\*","*.IMG\\*","*.CAB\\*","*.TAR\\*","*.GZ\\*","*.RAR\\*","*.7Z\\*")
    #   AND Processes.action="allowed" by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | regex process="(?i).*(ZIP|ISO|IMG|CAB|TAR|GZ|RAR|7Z)\\\\.+\.(BAT|BIN|CAB|CMD|COM|CPL|EX_|EXE|GADGET|INF1|INS|INX||HTM|HTML|ISU|JAR|JOB|JS|JSE|LNK|MSC|MSI|MSP|MST|PAF|PIF|PS1|REG|RGS|SCR|SCT|SHB|SHS|U3P|VB|VBE|VBS|VBSCRIPT|WS|WSF|WSH)\"?$"
    #   | rex field=process "(?i).+\\\\(?<file_name>[^\\\]+\.(ZIP|ISO|IMG|CAB|TAR|GZ|RAR|7Z))\\\\((.+\\\\)+)?(?<process_name>.+\.(BAT|BIN|CAB|CMD|COM|CPL|EX_|EXE|GADGET|INF1|INS|INX||HTM|HTML|ISU|JAR|JOB|JS|JSE|LNK|MSC|MSI|MSP|MST|PAF|PIF|PS1|REG|RGS|SCR|SCT|SHB|SHS|U3P|VB|VBE|VBS|VBSCRIPT|WS|WSF|WSH))\"?$"|
    #   `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `suspicious_process_executed_from_container_file_filter`
  condition: selection
level: medium
