title: DNS Exfiltration and Tunneling Tools Execution
id: 865994b2-e715-4f38-9b47-456a035d4149
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1048/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dns_exfiltration_tools_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1048.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          - Image|endswith: '\iodine.exe'
          - Image|contains: '\dnscat2'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
