title: Use Get-NetTCPConnection
id: 8e9a5681-c255-4e69-bd2f-60ab77184402
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1049.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1049/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_classic/posh_pc_susp_get_nettcpconnection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1049
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Data|contains: 'Get-NetTCPConnection'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
