title: HackTool - winPEAS Execution
id: 31e9d7cc-e68f-4144-8ea7-4a6c1479ad6d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1046.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_winpeas.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1046
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - OriginalFileName: 'winPEAS.exe'
          - Image|endswith:
                - '\winPEASany_ofs.exe'
                - '\winPEASany.exe'
                - '\winPEASx64_ofs.exe'
                - '\winPEASx64.exe'
                - '\winPEASx86_ofs.exe'
                - '\winPEASx86.exe'
      selection_cli_option:
          CommandLine|contains:
              - ' applicationsinfo' # Search installed applications information
              - ' browserinfo' # Search browser information
              - ' eventsinfo' # Display interesting events information
              - ' fileanalysis' # Search specific files that can contains credentials and for regexes inside files
              - ' filesinfo' # Search generic files that can contains credentials
              - ' processinfo' # Search processes information
              - ' servicesinfo' # Search services information
              - ' windowscreds' # Search windows credentials
      selection_cli_dl:
          CommandLine|contains: 'https://github.com/carlospolop/PEASS-ng/releases/latest/download/'
      selection_cli_specific:
          - ParentCommandLine|endswith: ' -linpeas'
          - CommandLine|endswith: ' -linpeas'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
