title: Tap Driver Installation - Security
id: 3ed27df0-3ed2-4ed2-aed2-3ed27df00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1048
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_tap_driver_installation.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1048
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 4697
    #         ServiceFileName|contains: 'tap0901'
    #     condition: selection
    # 
  condition: selection
level: medium
