title: Successful Account Login Via WMI
id: f44eac94-223b-4851-99fb-082293b799c8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1047.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_wmi_login.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1047
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          ProcessName|endswith: '\WmiPrvSE.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
