title: HackTool - HollowReaper Execution
id: 40664864-f68c-4380-94d4-34a62fb858fb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.012.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_hollowreaper.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055.012
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\HollowReaper.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
