title: Hacktool Ruler
id: 3bdaa2c9-419f-4f3e-aa40-6025c0d662ce
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_alert_ruler.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection1:
          EventID: 4776
          Workstation: 'RULER'
      selection2:
          EventID:
              - 4624
              - 4625
          WorkstationName: 'RULER'
      condition: (1 of selection*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
