title: DNS Query Request To OneLaunch Update Service
id: c85e98f3-600c-454f-80e7-f6c1c19d611e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_onelaunch_update_service.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          QueryName: 'update.onelaunch.com'
          Image|endswith: '\OneLaunch.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
