title: Suspicious Execution via Windows Subsystem for Linux
id: 02c544a7-8538-4c33-bd8d-c9e32c5dc7d1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1059/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_wsl_bash_exec.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1059.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    event.type: 'start'
    process.executable:
      - '?:\\Windows\\System32\\bash.exe'
      - '?:\\Users\\*\\AppData\\Local\\Packages\\*\\rootfs\\usr\\bin\\bash'
    process.command_line:
      - 'bash'
      - 'bash.exe'
    process.parent.name: 'wsl.exe'
    process.parent.command_line: 'bash*'
    process.name:
      - 'wslhost.exe'
      - 'wsl.exe'
    process.args:
      - 'curl'
      - '/mnt/c/*'
      - 'wsl-bootstrap'
      - '*.vscode-server*'
    process.parent.executable:
      - '?:\\Program Files\\Docker\\*.exe'
      - '?:\\Program Files (x86)\\Docker\\*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
