title: ManageEngine Endpoint Central Dctask64.EXE Potential Abuse
id: 00874280-dc76-49be-9285-5b360de7f10b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_dctask64_arbitrary_command_and_dll_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\dctask64.exe'
          - Hashes|contains:
                - 'IMPHASH=6834B1B94E49701D77CCB3C0895E1AFD'
                - 'IMPHASH=1BB6F93B129F398C7C4A76BB97450BBA'
                - 'IMPHASH=FAA2AC19875FADE461C8D89DCF2710A3'
                - 'IMPHASH=F1039CED4B91572AB7847D26032E6BBF'
      selection_cli:
          CommandLine|contains:
              - ' executecmd64 '
              - ' invokeexe '
              - ' injectDll '
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
