title: CMD Carry Out String Command Parameter
id: 2737325f-2737-4737-a737-2737325f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1059.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cmd_carry_out_string_command_parameter.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1059.003
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where `process_cmd` AND Processes.process
    #   IN ("*/c*", "*/k*") by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `cmd_carry_out_string_command_parameter_filter`
  condition: selection
level: medium
