title: PowerShell Keylogging Script
id: 841b289c-9cca-4d83-898c-76fcd245aa2e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1056/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_keylogger.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1056
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    user.id: 'S-1-5-18'
    powershell.file.script_block_text: 'sentinelbreakpoints'
    event.category: 'process'
    host.os.type: 'windows'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
