title: CredUI.DLL Loaded By Uncommon Process
id: 9364f580-de28-4d10-bebb-76e089aabe9e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/image_load/image_load_dll_credui_uncommon_process_load.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          - ImageLoaded|endswith:
                - '\credui.dll'
                - '\wincredui.dll'
          - OriginalFileName:
                - 'credui.dll'
                - 'wincredui.dll'
      filter_main_generic:
          Image|startswith:
              - 'C:\Program Files (x86)\'
              - 'C:\Program Files\'
              - 'C:\Windows\System32\'
              - 'C:\Windows\SysWOW64\'
              - 'C:\Windows\SystemApps\'
      filter_main_full:
          Image:
              - 'C:\Windows\explorer.exe'
              - 'C:\Windows\ImmersiveControlPanel\SystemSettings.exe'
              - 'C:\Windows\regedit.exe' # This FP is triggered for example when choosing the "Connect Network Registry" from the menu
      filter_optional_opera:
          Image|endswith: '\opera_autoupdate.exe'
      filter_optional_process_explorer:
          Image|endswith:
              - '\procexp64.exe'
              - '\procexp.exe'
      filter_optional_teams:
          Image|startswith: 'C:\Users\'
          Image|contains: '\AppData\Local\Microsoft\Teams\'
          Image|endswith: '\Teams.exe'
      filter_optional_onedrive:
          Image|startswith: 'C:\Users\'
          Image|contains: '\AppData\Local\Microsoft\OneDrive\'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
