title: Linux Decode Base64 to Shell
id: 3235694a-3235-4235-a235-3235694a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1059.004
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_decode_base64_to_shell.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1059.004
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where  Processes.process="*|*" `linux_shells`
    #   by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    #   Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    #   Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
    #   Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
    #   Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    #   | `drop_dm_object_name(Processes)` | rex field=process "base64\s+(?<decode_flag>-{1,2}d\w*)"
    #   | where isnotnull(decode_flag) | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `linux_decode_base64_to_shell_filter`
  condition: selection
level: medium
