title: Mavinject Inject DLL Into Running Process
id: 8c3b2924-f72f-4b98-83da-247ecdc9b2a7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mavinject_process_injection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains: ' /INJECTRUNNING '
      filter:
          ParentImage: 'C:\Windows\System32\AppVClient.exe' # This parent is the expected process to launch "mavinject"
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
