title: PUA - Mouse Lock Execution
id: a274cf49-e537-4287-b145-f39d0a11370a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_mouselock_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          - Product|contains: 'Mouse Lock'
          - Company|contains: 'Misc314'
          - CommandLine|contains: 'Mouse Lock_'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
