title: Rare Remote Thread Creation By Uncommon Source Image
id: 361fc3c2-0979-4fc7-b989-132a737d7b1f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_susp_relevant_source_image.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1055
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          SourceImage|endswith:
              - '\bash.exe'
              - '\cscript.exe'
              - '\cvtres.exe'
              - '\defrag.exe'
              - '\dialer.exe'
              - '\dnx.exe'
              - '\esentutl.exe'
              - '\excel.exe'
              - '\expand.exe'
              - '\find.exe'
              - '\findstr.exe'
              - '\forfiles.exe'
              - '\gpupdate.exe'
              - '\hh.exe'
              - '\installutil.exe'
              - '\lync.exe'
              - '\makecab.exe'
              - '\mDNSResponder.exe'
              - '\monitoringhost.exe' # Loads .NET CLR by default and thus a favorite for process injection for .NET in-memory offensive tools.
              - '\msbuild.exe'
              - '\mshta.exe'
              - '\mspaint.exe'
              - '\outlook.exe'
              - '\ping.exe'
              - '\provtool.exe'
              - '\python.exe'
              - '\regsvr32.exe'
              - '\robocopy.exe'
              - '\runonce.exe'
              - '\sapcimc.exe'
              - '\smartscreen.exe'
              - '\spoolsv.exe'
              - '\tstheme.exe'
              - '\userinit.exe'
              - '\vssadmin.exe'
              - '\vssvc.exe'
              - '\w3wp.exe'
              - '\winscp.exe'
              - '\winword.exe'
              - '\wmic.exe'
              - '\wscript.exe'
      filter_main_conhost:
          SourceImage:
              - 'C:\Windows\System32\Defrag.exe'
              - 'C:\Windows\System32\makecab.exe'
          TargetImage: 'C:\Windows\System32\conhost.exe'
      filter_main_provtol_svchost:
          SourceImage: 'C:\Windows\System32\provtool.exe'
          TargetImage: 'C:\Windows\System32\svchost.exe'
      filter_main_provtool_system:
          SourceImage: 'C:\Windows\System32\provtool.exe'
          TargetImage: 'System'
      filter_main_userinit:
          SourceImage: 'C:\Windows\System32\userinit.exe'
          TargetImage: 'C:\Windows\explorer.exe'
      filter_main_winword:
          SourceImage|endswith: '\WINWORD.EXE'
          TargetImage|startswith:
              - 'C:\Program Files (x86)\' # C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
              - 'C:\Program Files\' # C:\Program Files\Microsoft Office\root\vfs\ProgramFilesCommonX64\Microsoft Shared\Office16\AI\ai.exe
      filter_main_ms_office:
          # Raised by following issue: https://github.com/SigmaHQ/sigma/issues/5529
          SourceImage|startswith:
              - 'C:\Program Files\Microsoft Office\'
              - 'C:\Program Files (x86)\Microsoft Office\'
          TargetImage: 'System'
      filter_optional_explorer_vmtools:
          SourceImage|endswith: '\SysWOW64\explorer.exe'
          TargetImage:
              - 'C:\Program Files (x86)\VMware\VMware Tools\vmtoolsd.exe'
              - 'C:\Program Files\VMware\VMware Tools\vmtoolsd.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
