title: Persistence and Execution at Scale via GPO Scheduled Task
id: 5cb72011-917e-4839-9b65-0567ee780fbd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_gpo_scheduledtasks.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.005
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_5136:
          EventID: 5136
          AttributeLDAPDisplayName:
              - 'gPCMachineExtensionNames'
              - 'gPCUserExtensionNames'
          AttributeValue|contains:
              - 'CAB54552-DEEA-4691-817E-ED4A4D1AFC72'
              - 'AADCED64-746C-4633-A97C-D61349046527'
      selection_5145:
          EventID: 5145
          ShareName|endswith: '\SYSVOL' # looking for the string \\*\SYSVOL
          RelativeTargetName|endswith: 'ScheduledTasks.xml'
          AccessList|contains:
              - 'WriteData'
              - '%%4417'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
