title: Linux Service File Created In Systemd Directory
id: 14bb9076-14bb-44bb-a4bb-14bb90760000
status: stable
description: Detection rule for MITRE ATT&CK technique T1053.006
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_service_file_created_in_systemd_directory.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1053.006
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name = *.service
    #   Filesystem.file_path IN ("*/etc/systemd/system*", "*/lib/systemd/system*", "*/usr/lib/systemd/system*",
    #   "*/run/systemd/system*", "*~/.config/systemd/*", "*~/.local/share/systemd/*","*/etc/systemd/user*",
    #   "*/lib/systemd/user*", "*/usr/lib/systemd/user*", "*/run/systemd/user*") by Filesystem.action
    #   Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash
    #   Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path Filesystem.file_acl
    #   Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user
    #   Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` | `security_content_ctime(lastTime)`
    #   | `security_content_ctime(firstTime)` | `linux_service_file_created_in_systemd_directory_filter`
  condition: selection
level: medium
