title: Reconnaissance Activity
id: 181fa23d-5b12-414d-981d-afa7bdd1e2f3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_net_recon_activity.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1069.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4661
          AccessMask: '0x2d'
          ObjectType:
              - 'SAM_USER'
              - 'SAM_GROUP'
          ObjectName|startswith: 'S-1-5-21-'
          ObjectName|endswith:
              - '-500'
              - '-512'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
