title: Reconnaissance Activity
id: 044d3946-044d-444d-a44d-044d39460000
status: stable
description: Detection rule for MITRE ATT&CK technique T1069.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_net_recon_activity.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1069.002
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 4661
    #         AccessMask: '0x2d'
    #         ObjectType:
    #             - 'SAM_USER'
    #             - 'SAM_GROUP'
    #         ObjectName|startswith: 'S-1-5-21-'
    #         ObjectName|endswith:
    #             - '-500'
    #             - '-512'
    #     condition: selection
    # 
  condition: selection
level: medium
