title: Audit CVE Event
id: 5fad5604-fcc5-45a9-abb3-5e5a81ee82df
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1068.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1068/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1068
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Provider_Name:
              - 'Microsoft-Windows-Audit-CVE'
              - 'Audit-CVE'
          EventID: 1
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
