title: Potential Secure Deletion with SDelete
id: 76849e92-3268-48ef-b829-f368b8c7be82
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_sdelete_potential_secure_deletion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID:
              - 4656
              - 4663
              - 4658
          ObjectName|endswith:
              - '.AAA'
              - '.ZZZ'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
