title: Admin User Remote Logon
id: 682eec71-682e-482e-a82e-682eec710000
status: stable
description: Detection rule for MITRE ATT&CK technique T1078.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1078.003
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 4624
    #         LogonType: 10
    #         AuthenticationPackageName: Negotiate
    #         TargetUserName|startswith: 'Admin'
    #     condition: selection
    # 
  condition: selection
level: medium
