title: Create or delete windows shares using net exe
id: 0b71d470-0b71-4b71-ab71-0b71d4700000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/create_or_delete_windows_shares_using_net_exe.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1070.005
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(Processes.user) as
    #   user values(Processes.parent_process) as parent_process min(_time) as firstTime
    #   max(_time) as lastTime from datamodel=Endpoint.Processes where `process_net` by
    #   Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    #   Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    #   Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
    #   Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
    #   Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    #   | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
    #   | search process IN ("*share* /delete*", "*share* /REMARK:*", "*share* /CACHE:*")
    #   | `create_or_delete_windows_shares_using_net_exe_filter`
  condition: selection
level: medium
