title: Admin User Remote Logon
id: a0cb2f33-837f-425a-a5e2-b3c9ca68117e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 10
          AuthenticationPackageName: Negotiate
          TargetUserName|startswith: 'Admin'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
