title: Zip A Folder With PowerShell For Staging In Temp - PowerShell
id: 80cdc5d3-6301-48a5-83f2-51b0a6c3edab
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1074.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1074/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_classic/posh_pc_susp_zip_compress.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1074.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Data|contains:
              - 'Compress-Archive -Path*-DestinationPath $env:TEMP'
              - 'Compress-Archive -Path*-DestinationPath*\AppData\Local\Temp\'
              - 'Compress-Archive -Path*-DestinationPath*:\Windows\Temp\'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
