title: Unauthorized System Time Modification
id: 7f77b317-f5c8-4c28-9cd2-67ff4957e8de
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_time_modification.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4616
      filter_main_svchost:
          ProcessName: 'C:\Windows\System32\svchost.exe'
          SubjectUserSid: 'S-1-5-19'
      filter_optional_vmtools:
          ProcessName:
              - 'C:\Program Files\VMware\VMware Tools\vmtoolsd.exe'
              - 'C:\Program Files (x86)\VMware\VMware Tools\vmtoolsd.exe'
              - 'C:\Windows\System32\VBoxService.exe'
              - 'C:\Windows\System32\oobe\msoobe.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
