title: Powershell Sensitive File Discovery
id: 040c80f8-fd3c-4b12-b105-16dd85b81626
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1083.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_sensitive_file_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1083
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_action:
          ScriptBlockText|contains:
              - ls
              - get-childitem
              - gci
      selection_recurse:
          ScriptBlockText|contains: '-recurse'
      selection_file:
          ScriptBlockText|contains:
              - '.pass'
              - '.kdbx'
              - '.kdb'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
