title: Suspicious Use of PsLogList
id: 3b987ba8-3b98-4b98-ab98-3b987ba80000
status: stable
description: Detection rule for MITRE ATT&CK technique T1087.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psloglist.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1087.001
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - OriginalFileName: 'psloglist.exe'
    #         - Image|endswith:
    #               - '\psloglist.exe'
    #               - '\psloglist64.exe'
    #     selection_cli_eventlog:
    #         CommandLine|contains:
    #             - ' security'
    #             - ' application'
    #             - ' system'
    #     selection_cli_flags:
    #         CommandLine|contains|windash:
    #             - ' -d'
    #             - ' -x'
    #             - ' -s'
    #             - ' -c' # Clear event log after displaying
    #             - ' -g' # Export an event log as an evt file.
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
