title: RDP over Reverse SSH Tunnel WFP
id: 07942662-9ed3-4264-81cb-b1adcff2c62f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1090/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_rdp_reverse_tunnel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1090.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 5156
      sourceRDP:
          SourcePort: 3389
          DestAddress:
              - '127.*'
              - '::1'
      destinationRDP:
          DestPort: 3389
          SourceAddress:
              - '127.*'
              - '::1'
      filter_app_container:
          FilterOrigin: 'AppContainer Loopback'
      filter_thor:  # checking BlueKeep vulnerability
          Application|endswith:
              - '\thor.exe'
              - '\thor64.exe'
      condition: selection and ( sourceRDP or destinationRDP ) and not 1 of filter*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
