title: Query Tor Onion Address - DNS Client
id: 4be0b061-06e0-4643-accf-fc436039f92a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1090/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/dns_client/win_dns_client_tor_onion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1090.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 3008
          QueryName|endswith:
              - '.hiddenservice.net'
              - '.onion.ca'
              - '.onion.cab'
              - '.onion.casa'
              - '.onion.city'
              - '.onion.direct'
              - '.onion.dog'
              - '.onion.glass'
              - '.onion.gq'
              - '.onion.guide'
              - '.onion.in.net'
              - '.onion.ink'
              - '.onion.it'
              - '.onion.link'
              - '.onion.lt'
              - '.onion.lu'
              - '.onion.ly'
              - '.onion.mn'
              - '.onion.network'
              - '.onion.nu'
              - '.onion.pet'
              - '.onion.plus'
              - '.onion.pt'
              - '.onion.pw'
              - '.onion.rip'
              - '.onion.sh'
              - '.onion.si'
              - '.onion.to'
              - '.onion.top'
              - '.onion.ws'
              - '.onion'
              - '.s1.tor-gateways.de'
              - '.s2.tor-gateways.de'
              - '.s3.tor-gateways.de'
              - '.s4.tor-gateways.de'
              - '.s5.tor-gateways.de'
              - '.t2w.pw'
              - '.tor2web.ae.org'
              - '.tor2web.blutmagie.de'
              - '.tor2web.com'
              - '.tor2web.fi'
              - '.tor2web.io'
              - '.tor2web.org'
              - '.tor2web.xyz'
              - '.torlink.co'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
