title: Ngrok Usage with Remote Desktop Service
id: 7d9c80a3-e64b-44bc-9abb-9637cf4d992a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1090/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/terminalservices/win_terminalservices_rdp_ngrok.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1090
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 21
          Address|contains: '16777216'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
