title: Cloudflared Tunnel Connections Cleanup
id: 6a201fd4-c594-42ca-9c5e-2e56c18163ee
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1102.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1102/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cloudflared_tunnel_cleanup.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1102
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - ' tunnel '
              - 'cleanup '
          CommandLine|contains:
              - '-config '
              - '-connector-id '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
