title: HackTool - WinPwn Execution - ScriptBlock
id: 4401cce6-aa82-45cf-8eb9-3688c7448725
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1106.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1106/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_hktl_winpwn.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1106
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains:
              - 'Offline_Winpwn'
              - 'WinPwn '
              - 'WinPwn.exe'
              - 'WinPwn.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
