title: Windows Local Administrator Credential Stuffing
id: 0e33217c-0e33-4e33-ae33-0e33217c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.004
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_local_administrator_credential_stuffing.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1110.004
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # `wineventlog_security` EventCode=4625 OR EventCode=4624 Logon_Type=3 TargetUserName=Administrator
    #   | bucket span=5m _time | stats dc(Computer) AS unique_targets values(Computer) as
    #   host_targets values(dest) as dest values(src) as src values(user) as user by _time,
    #   IpAddress, TargetUserName, EventCode, action, app, authentication_method, signature,
    #   signature_id | where unique_targets > 30 | `windows_local_administrator_credential_stuffing_filter`
  condition: selection
level: medium
