title: Automated Collection Command Prompt
id: 5f28418d-7a6d-4dca-9769-487ac9211043
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1119.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1119
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_ext:
          CommandLine|contains:
              - '.doc'
              - '.docx'
              - '.xls'
              - '.xlsx'
              - '.ppt'
              - '.pptx'
              - '.rtf'
              - '.pdf'
              - '.txt'
      selection_other_dir:
          CommandLine|contains|all:
              - 'dir '
              - ' /b '
              - ' /s '
      selection_other_findstr:
          OriginalFileName: 'FINDSTR.EXE'
          CommandLine|contains:
              - ' /e '
              - ' /si '
      condition: selection_ext and 1 of selection_other_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
