title: Windows Local Administrator Credential Stuffing
id: 726529d8-e226-4a25-bf29-d33d46742e14
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_local_administrator_credential_stuffing.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventCode:
      - '4625'
      - '4624'
    Logon_Type: '3'
    TargetUserName: 'Administrator'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
