title: Suspicious Rejected SMB Guest Logon From IP
id: b4b3c465-9bf5-496a-aed9-e7f573a8379d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/smbclient/security/win_smbclient_security_susp_failed_guest_logon.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 31017
          UserName: ''
          ServerName|startswith: '\1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
