title: Fsutil Drive Enumeration
id: 4ffa78c1-2aaf-42de-917f-79b7f4d323c0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1120.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1120/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_fsutil_drive_enumeration.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1120
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\fsutil.exe'
          - OriginalFileName: 'fsutil.exe'
      selection_cli:
          CommandLine|contains: 'drives'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
