title: Execution via local SxS Shared Module
id: 7849d9fa-ef0c-4fe4-a594-89fe9eba6c2b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1129.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1129/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_shared_modules_local_sxs_dll.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1129
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    file.extension: 'dll'
    file.path: 'C:\\*\\*.exe.local\\*.dll'
    C: '\\*\\*.exe.local\\*.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
