title: Remote Thread Creation Ttdinject.exe Proxy
id: 48ab1f66-2060-4f67-bf6e-3c7e66af8af8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1127.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1127/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_ttdinjec.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1127
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          SourceImage|endswith: '\ttdinject.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
