title: PowerShell Script with Webcam Video Capture Capabilities
id: 8fbce571-4900-47a8-8903-3f12f3367ae5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1125.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_webcam_video_capture.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1125
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text: 'NewFrameEventHandler'
    event.category: 'process'
    host.os.type: 'windows'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
