title: Potential Credential Access via Trusted Developer Utility
id: b95d3e88-33c1-4af6-bb46-c2ea1133b0f4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1127.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1127/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_credential_dumping_msbuild.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1127.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name: 'MSBuild.exe'
    event.action: 'Image loaded*'
    dll.name:
      - 'vaultcli.dll'
      - 'SAMLib.DLL'
    file.name:
      - 'vaultcli.dll'
      - 'SAMLib.DLL'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
