title: AspNetCompiler Execution
id: 03b0826a-fb50-4dd9-9081-ad2a530d1136
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1127.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1127/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_aspnet_compiler_exectuion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1127
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|contains:
              - ':\Windows\Microsoft.NET\Framework\'
              - ':\Windows\Microsoft.NET\Framework64\'
              - ':\Windows\Microsoft.NET\FrameworkArm\'
              - ':\Windows\Microsoft.NET\FrameworkArm64\'
          Image|endswith: '\aspnet_compiler.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
