title: ETW Registry Disabled
id: 726aa7b1-726a-426a-a26a-726aa7b10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1127
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/etw_registry_disabled.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1127
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path="*\\SOFTWARE\\Microsoft\\.NETFramework*"
    #   Registry.registry_value_name = ETWEnabled Registry.registry_value_data=0x00000000)
    #   by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive
    #   Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    #   Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    #   | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `etw_registry_disabled_filter`
  condition: selection
level: medium
