title: Office Test Registry Persistence
id: 387cc2a9-0936-4cb7-9474-5ae1419a9eb7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1137/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_msoffice_startup_registry.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1137.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.path: '*\\Software\\Microsoft\\Office Test\\Special\\Perf\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
