title: Suspicious Windows ANONYMOUS LOGON Local Account Created
id: 72c868c2-f30a-4c77-a882-5b214fe999dc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1136/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_local_anon_logon_created.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1136.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4720
          SamAccountName|contains|all:
              - 'ANONYMOUS'
              - 'LOGON'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
