title: HackTool - NoFilter Execution
id: e0f14656-477a-47be-b284-62df8860b6e7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1134.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1134/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hktl_nofilter.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1134
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_5447:
          EventID: 5447
          FilterName|contains: 'RonPolicy'
      selection_5449:
          EventID: 5449
          ProviderContextName|contains: 'RonPolicy'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
