title: Office Application Startup - Office Test
id: f25229e7-663b-45e8-9d11-899144b74d87
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1137/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_event/registry_event_office_test_regadd.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1137.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          TargetObject|contains: '\Software\Microsoft\Office test\Special\Perf'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
