title: Potential Persistence Via Outlook Form
id: 83c18e01-c95d-4ad3-ad09-0d57da4346e7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1137/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_office_outlook_newform.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1137.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\outlook.exe'
          TargetFilename|contains:
              - '\AppData\Local\Microsoft\FORMS\IPM'
              - '\Local Settings\Application Data\Microsoft\Forms' # Windows XP
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
