title: Creation of a Hidden Local User Account
id: ad509664-1b39-44ef-9d4d-cb69ec443c2d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1136/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_evasion_hidden_local_account_creation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1136
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.path:
      - 'HKLM\\SAM\\SAM\\Domains\\Account\\Users\\Names\\*$\\'
      - 'MACHINE\\SAM\\SAM\\Domains\\Account\\Users\\Names\\*$\\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
