title: Potential Access Token Abuse
id: b436bc59-4d1b-4a2a-a75c-ef0000947f2a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1134.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1134/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_access_token_abuse.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1134.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 9
          LogonProcessName: 'Advapi'
          AuthenticationPackageName: 'Negotiate'
          ImpersonationLevel: '%%1833' # Impersonation
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
