title: Outlook Macro Execution Without Warning Setting Enabled
id: 0e857869-0e85-4e85-ae85-0e8578690000
status: stable
description: Detection rule for MITRE ATT&CK technique T1137
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_office_outlook_enable_macro_execution.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1137
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetObject|endswith: '\Outlook\Security\Level'
    #         Details|contains: '0x00000001' # Enable all Macros
    #     condition: selection
    # 
  condition: selection
level: medium
