title: Browser Extension Install
id: 0ff1bdaf-f6c8-449a-81f2-2e47ecf928b7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1176.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1176/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_browser_extension_install.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1176
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    event.type: 'creation'
    file.name:
      - '*.xpi'
      - 'langpack-*@firefox.mozilla.org.xpi'
      - 'uBlock0@raymondhill.net.xpi'
      - '*.crx'
    file.path:
      - '?:\\Users\\*\\AppData\\Roaming\\*\\Profiles\\*\\Extensions\\*.xpi'
      - '?:\\Users\\*\\AppData\\Local\\*\\*\\User Data\\Webstore Downloads\\*'
    process.name: 'firefox.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
