title: Potential Masquerading as Business App Installer
id: 73ca3f19-4e65-4030-8192-017e1f74ca71
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1189.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_masquerading_business_apps_installer.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1189
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.executable: '?:\\Users\\*\\Downloads\\*'
    process.name:
      - '*slack*.exe'
      - '*webex*.exe'
      - 'teams*.exe'
      - '*discord*.exe'
      - '*whatsapp*.exe'
      - '*zoom*installer*.exe'
      - 'zoom.exe'
      - '*outlook*.exe'
      - 'MSOutlookHelp-PST-Viewer.exe'
      - '*thunderbird*.exe'
      - '*grammarly*.exe'
      - '*dropbox*.exe'
      - '*tableau*.exe'
      - '*googledrive*.exe'
      - '*office*setup*.exe'
      - '*okta*.exe'
      - '*onedrive*.exe'
      - '*chrome*.exe'
      - '*firefox*.exe'
      - '*microsoftedge*.exe'
      - '*msedge*.exe'
      - '*brave*.exe'
      - '*GoogleCloud*.exe'
      - '*github*.exe'
      - '*notion*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
