title: BITS Job Persistence
id: 4aadafd7-4aad-4aad-aaad-4aadafd70000
status: stable
description: Detection rule for MITRE ATT&CK technique T1197
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/bits_job_persistence.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1197
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where `process_bitsadmin` Processes.process
    #   IN (*create*, *addfile*, *setnotifyflags*, *setnotifycmdline*, *setminretrydelay*,
    #   *setcustomheaders*, *resume* ) by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `bits_job_persistence_filter`
  condition: selection
level: medium
