title: SUNBURST Command and Control Activity
id: 812bbc3a-ec35-428c-a866-61855b8365c9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1195.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1195/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_sunburst_c2_activity_detected.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1195
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name:
      - 'ConfigurationWizard.exe'
      - 'SolarwindsDiagnostics.exe'
    http.request.body.content:
      - '*/swip/Upload.ashx*'
      - 'POST*'
      - 'PUT*'
      - '*/swip/SystemDescription*'
      - '*/swip/Events*'
      - 'GET*'
      - 'HEAD*'
      - '*solarwinds.com*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
