title: Octopus Scanner Malware
id: ae72ac7d-79cb-41f3-b59b-9189855c68d7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1195.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1195/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_mal_octopus_scanner.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1195.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          TargetFilename|endswith:
              - '\AppData\Local\Microsoft\Cache134.dat'
              - '\AppData\Local\Microsoft\ExplorerSync.db'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
