title: Device Installation Blocked
id: 3a1345d4-6649-49f5-8207-ae9a94ac94ef
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1200.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1200/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_device_installation_blocked.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1200
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 6423
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
