title: Kerberoasting spn request with RC4 encryption
id: 7f882b38-7f88-4f88-af88-7f882b380000
status: stable
description: Detection rule for MITRE ATT&CK technique T1208
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/kerberoasting_spn_request_with_rc4_encryption.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1208
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # `wineventlog_security` EventCode=4769 ServiceName!="*$" (TicketOptions=0x40810000
    #   OR TicketOptions=0x40800000 OR TicketOptions=0x40810010) TicketEncryptionType=0x17
    #   | stats count min(_time) as firstTime max(_time) as lastTime by Computer, user,
    #   service_id, service, TicketEncryptionType, TicketOptions | rename Computer as dest
    #   | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `kerberoasting_spn_request_with_rc4_encryption_filter`
  condition: selection
level: medium
