title: Windows MSC EvilTwin Directory Path Manipulation
id: 2e92299c-2e92-4e92-ae92-2e92299c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1203
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_msc_eviltwin_directory_path_manipulation.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1203
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime 
    #   from datamodel=Endpoint.Processes where Processes.process_name="mmc.exe"
    #   by Processes.dest Processes.user Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_id Processes.process_name Processes.process_path Processes.action 
    #   Processes.original_file_name Processes.parent_process_exec Processes.parent_process_guid 
    #   Processes.parent_process_id Processes.process_exec Processes.process_guid Processes.process_hash 
    #   Processes.process_integrity_level Processes.user_id Processes.vendor_product
    # | `drop_dm_object_name(Processes)` 
    # | regex process="(?i).*mmc\.exe.*((Windows\s+\\\\System32)|(Windows\s+System32)|(\\\\Windows\s+\\\\System32)|(Program\s+Files\s+\\\\)|(Program\s+Files\s+\(\\w+\)\s+\\\\)|(Progra~1\s+\\\\))"
    # | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `windows_msc_eviltwin_directory_path_manipulation_filter`
  condition: selection
level: medium
