title: RegAsm.EXE Execution Without CommandLine Flags or Files
id: 545cc5c2-ae4f-4caf-af4e-8320b072ab8b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_regasm_no_flag_or_dll_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.009
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\RegAsm.exe'
          - OriginalFileName: 'RegAsm.exe'
      selection_cli:
          CommandLine|endswith:
              - 'RegAsm'
              - 'RegAsm.exe'
              - 'RegAsm.exe"'
              - "RegAsm.exe'"
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
