title: Kerberos Manipulation
id: 898b091c-cbed-4a51-b162-bb46de66b846
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1212.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1212/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_kerberos_manipulation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1212
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID:
              - 675
              - 4768
              - 4769
              - 4771
          Status:
              - '0x9'
              - '0xA'
              - '0xB'
              - '0xF'
              - '0x10'
              - '0x11'
              - '0x13'
              - '0x14'
              - '0x1A'
              - '0x1F'
              - '0x21'
              - '0x22'
              - '0x23'
              - '0x24'
              - '0x26'
              - '0x27'
              - '0x28'
              - '0x29'
              - '0x2C'
              - '0x2D'
              - '0x2E'
              - '0x2F'
              - '0x31'
              - '0x32'
              - '0x3E'
              - '0x3F'
              - '0x40'
              - '0x41'
              - '0x43'
              - '0x44'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
