title: InstallUtil Process Making Network Connections
id: 8749f0fb-fecb-4b7c-a4de-fa7ffd7611d5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1218/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_installutil_beacon.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1218.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name:
      - 'installutil.exe'
      - 'installutil.exe'
    network.direction:
      - 'outgoing'
      - 'egress'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
