title: DLL Loaded From Suspicious Location Via Cmspt.EXE
id: 93c637df-8892-4707-ae10-d3db6c119789
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/image_load/image_load_cmstp_load_dll_from_susp_location.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\cmstp.exe'
          ImageLoaded|contains:
              # Add more suspicious paths as you see fit in your env
              - '\PerfLogs\'
              - '\ProgramData\'
              - '\Users\'
              - '\Windows\Temp\'
              - 'C:\Temp\'
          ImageLoaded|endswith:
              - '.dll'
              - '.ocx'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
