title: Active Directory Lateral Movement Identified
id: 380ea873-380e-480e-a80e-380ea8730000
status: stable
description: Detection rule for MITRE ATT&CK technique T1210
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/active_directory_lateral_movement_identified.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1210
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
    #   as lastTime sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
    #   as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
    #   annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
    #   as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
    #   as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
    #   as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
    #   dc(source) as source_count from datamodel=Risk.All_Risk where All_Risk.analyticstories="Active
    #   Directory Lateral Movement" All_Risk.risk_object_type="system" by All_Risk.risk_object
    #   All_Risk.risk_object_type All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | where
    #   source_count >= 4 | `active_directory_lateral_movement_identified_filter`
  condition: selection
level: medium
