title: Control Panel Items
id: 5d4da773-18b1-4a97-9d84-b7e1e72819dc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_control_panel_item.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_reg_img:
          - Image|endswith: '\reg.exe'
          - OriginalFileName: 'reg.exe'
      selection_reg_cli:
          CommandLine|contains|all:
              - 'add'
              - 'CurrentVersion\Control Panel\CPLs'
      selection_cpl:
          CommandLine|endswith: '.cpl'
      filter_cpl_sys:
          CommandLine|contains:
              - '\System32\'
              - '%System%'
              - '|C:\Windows\system32|'
      filter_cpl_igfx:
          CommandLine|contains|all:
              - 'regsvr32 '
              - ' /s '
              - 'igfxCPL.cpl'
      condition: all of selection_reg_* or (selection_cpl and not 1 of filter_cpl_*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
