title: Mavinject Inject DLL Into Running Process
id: 7c4642ea-c531-46f3-93c4-0af402bdada8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.013.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/013/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_mavinject_process_injection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.013
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains: ' /INJECTRUNNING '
      filter:
          ParentImage: 'C:\Windows\System32\AppVClient.exe' # This parent is the expected process to launch "mavinject"
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
