title: Audit CVE Event
id: 4f7366c4-3a7a-48c2-91c2-a5484dc8918c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1210.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1210/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1210
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Provider_Name:
              - 'Microsoft-Windows-Audit-CVE'
              - 'Audit-CVE'
          EventID: 1
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
