title: Suspicious CustomShellHost Execution
id: b07b58f5-3587-44db-86c6-81d2aa4eb56c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1216.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1216/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_customshellhost_susp_exec.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1216
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ParentImage|endswith: '\CustomShellHost.exe'
      filter_main_explorer:
          Image: 'C:\Windows\explorer.exe'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
