title: Linux Change File Owner To Root
id: f390b001-73ad-4f61-aa9c-675bd57b7a25
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1222.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1222/002/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_change_file_owner_to_root.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1222.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'chown'
    process:
      - '*chown'
      - '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
