title: WMIC Loading Scripting Libraries
id: 95e31afb-b43d-410f-96f5-b0c4a9c866c9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1220.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1220/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/image_load/image_load_wmic_remote_xsl_scripting_dlls.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1220
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\wmic.exe'
          ImageLoaded|endswith:
              - '\jscript.dll'
              - '\vbscript.dll'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
