title: PowerShell Script Change Permission Via Set-Acl - PsScript
id: ccf6bbd8-6c62-436f-bc7c-4cbe84a62a71
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1222.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1222/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_set_acl.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1222
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - 'Set-Acl '
              - '-AclObject '
              - '-Path '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
