title: Excessive Attempt To Disable Services
id: 734b54ca-734b-434b-a34b-734b54ca0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1489
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/excessive_attempt_to_disable_services.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1489
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` values(Processes.action) as action
    #   values(Processes.original_file_name) as original_file_name values(Processes.parent_process)
    #   as parent_process values(Processes.parent_process_exec) as parent_process_exec values(Processes.parent_process_guid)
    #   as parent_process_guid values(Processes.parent_process_id) as parent_process_id
    #   values(Processes.parent_process_path) as parent_process_path values(Processes.process)
    #   as process values(Processes.process_exec) as process_exec values(Processes.process_guid)
    #   as process_guid values(Processes.process_hash) as process_hash values(Processes.process_id)
    #   as process_id values(Processes.process_integrity_level) as process_integrity_level
    #   values(Processes.process_path) as process_path values(Processes.user_id) as user_id
    #   values(Processes.vendor_product) as vendor_product  count min(_time) as firstTime
    #   max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name
    #   = "sc.exe" AND Processes.process="*config*" OR Processes.process="*Disabled*" by
    #   Processes.process_name Processes.parent_process_name Processes.dest Processes.user
    #   _time span=1m | where count >=4 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `excessive_attempt_to_disable_services_filter`
  condition: selection
level: medium
