title: Creation or Modification of a new GPO Scheduled Task or Service
id: a6c055ff-7287-4322-9a10-4a4a575feed7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/privilege_escalation_gpo_schtask_service_creation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1484
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    file.name:
      - 'ScheduledTasks.xml'
      - 'Services.xml'
    file.path:
      - '?:\\Windows\\SYSVOL\\domain\\Policies\\*\\MACHINE\\Preferences\\ScheduledTasks\\ScheduledTasks.xml'
      - '?:\\Windows\\SYSVOL\\domain\\Policies\\*\\MACHINE\\Preferences\\Services\\Services.xml'
    process.executable: 'C:\\Windows\\System32\\dfsrs.exe'
    C: '\\Windows\\System32\\dfsrs.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
