title: Application Uninstalled
id: 8839f62e-e03a-4f64-a554-cadb20b73f1f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1489.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1489/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/msiinstaller/win_builtin_remove_application.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1489
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Provider_Name: 'MsiInstaller'
          EventID:
              - 1034 # Windows Installer removed the product
              - 11724 # Product Removal Successful
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
