title: Powershell Detect Virtualization Environment
id: 081d4feb-5254-4a8d-bdbd-0dc34aabba75
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1497.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1497/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_detect_vm_env.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1497.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_action:
          ScriptBlockText|contains:
              - Get-WmiObject
              - gwmi
      selection_module:
          ScriptBlockText|contains:
              - MSAcpi_ThermalZoneTemperature
              - Win32_ComputerSystem
      condition: all of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
