title: Modification Of Wallpaper
id: b3676368-9a3d-47d4-a12d-c514c7386401
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1491.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1491/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/modification_of_wallpaper.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1491
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventCode: '13'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
