title: Potential Crypto Mining Activity
id: fd58e09e-f6f5-4be5-9e6d-20ce8f605393
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1496.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1496/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_crypto_mining_monero.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1496
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains:
              - ' --cpu-priority='
              - '--donate-level=0'
              - ' -o pool.'
              - ' --nicehash'
              - ' --algo=rx/0 '
              - 'stratum+tcp://'
              - 'stratum+udp://'
              # base64 encoded: --donate-level=
              - 'LS1kb25hdGUtbGV2ZWw9'
              - '0tZG9uYXRlLWxldmVsP'
              - 'tLWRvbmF0ZS1sZXZlbD'
              # base64 encoded: stratum+tcp:// and stratum+udp://
              - 'c3RyYXR1bSt0Y3A6Ly'
              - 'N0cmF0dW0rdGNwOi8v'
              - 'zdHJhdHVtK3RjcDovL'
              - 'c3RyYXR1bSt1ZHA6Ly'
              - 'N0cmF0dW0rdWRwOi8v'
              - 'zdHJhdHVtK3VkcDovL'
      filter:
          CommandLine|contains:
              - ' pool.c '
              - ' pool.o '
              - 'gcc -'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
