title: Potentially Suspicious Desktop Background Change Using Reg.EXE
id: 1a9157d8-51b3-4a41-8775-1ac8c5b27473
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1491.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1491/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_desktop_background_change.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1491.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      # TODO: Improve this to also focus on variation using PowerShell and other CLI tools
      selection_reg_img:
          - Image|endswith: '\reg.exe'
          - OriginalFileName: 'reg.exe'
      selection_reg_flag:
          CommandLine|contains: 'add'
      selection_keys:
          CommandLine|contains:
              - 'Control Panel\Desktop'
              - 'CurrentVersion\Policies\ActiveDesktop'
              - 'CurrentVersion\Policies\System'
      selection_cli_reg_1:
          CommandLine|contains|all:
              - '/v NoChangingWallpaper'
              - '/d 1' # Prevent changing desktop background
      selection_cli_reg_2:
          CommandLine|contains|all:
              - '/v Wallpaper'
              - '/t REG_SZ'
      selection_cli_reg_3:
          CommandLine|contains|all:
              - '/v WallpaperStyle'
              - '/d 2' # Stretch
      condition: all of selection_reg_* and selection_keys and 1 of selection_cli_reg_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
