title: Windows Chromium Browser No Security Sandbox Process
id: 1cd38e08-1cd3-4cd3-acd3-1cd38e080000
status: stable
description: Detection rule for MITRE ATT&CK technique T1497
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_chromium_browser_no_security_sandbox_process.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1497
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where 
    #   Processes.process_name IN ("Chrome.exe","Brave.exe", "Opera.exe", "Vivaldi.exe", "msedge.exe")
    #   Processes.process = "*--no-sandbox*" 
    #   by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    #   Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    #   Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
    #   Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
    #   Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
    #   | `drop_dm_object_name(Processes)` 
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)`
    #   | `windows_chromium_browser_no_security_sandbox_process_filter`
  condition: selection
level: medium
