title: Backup Files Deleted
id: 5d9bcd80-e869-41e1-a9f9-baf08ad4beed
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1490.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_delete/file_delete_win_delete_backup_file.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '\cmd.exe'
              - '\powershell.exe'
              - '\pwsh.exe'
              - '\wt.exe'
              - '\rundll32.exe'
              - '\regsvr32.exe'
          TargetFilename|endswith:
              - '.VHD'
              - '.bac'
              - '.bak'
              - '.wbcat'
              - '.bkf'
              - '.set'
              - '.win'
              - '.dsk'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
