title: Replace Desktop Wallpaper by Powershell
id: 677674fb-8c4b-4c01-9050-cbbf932ae4f7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1491.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1491/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_wallpaper.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1491.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_1:
          ScriptBlockText|contains|all:
              - 'Get-ItemProperty'
              - 'Registry::'
              - 'HKEY_CURRENT_USER\Control Panel\Desktop\'
              - 'WallPaper'
      selection_2:
          ScriptBlockText|contains: SystemParametersInfo(20,0,*,3)
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
