title: ETW Logging/Processing Option Disabled On IIS Server
id: b0ce0dc8-e1ff-46d0-a7d5-ae109af4565a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1505/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/iis-configuration/win_iis_logging_etw_disabled.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1505.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 29
          Configuration|endswith: '@logTargetW3C'
          OldValue|contains: 'ETW'
      filter_main_etw_added:
          NewValue|contains: 'ETW'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
