title: Security Software Discovery Via Powershell Script
id: 997dc60c-878a-4e17-a821-70e28a8458ea
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1518.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1518/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_get_process_security_software_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1518.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_cmdlet:
          ScriptBlockText|contains:
              - 'get-process | \?'
              - 'get-process | where'
              - 'gps | \?'
              - 'gps | where'
      selection_field:
          ScriptBlockText|contains:
              - 'Company -like'
              - 'Description -like'
              - 'Name -like'
              - 'Path -like'
              - 'Product -like'
      selection_keywords:
          ScriptBlockText|contains:
              # Note: These strings are using wildcard assuming the search is using the "-like" operator.
              #       You can add specific variant with the actual process names to increase coverage
              - '\*avira\*'
              - '\*carbonblack\*'
              - '\*cylance\*'
              - '\*defender\*'
              - '\*kaspersky\*'
              - '\*malware\*'
              - '\*sentinel\*'
              - '\*symantec\*'
              - '\*virus\*'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
