title: High Frequency Copy Of Files In Network Share
id: 28f3f748-7fbd-4721-8c76-cf327543ca8b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1537.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1537/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/high_frequency_copy_of_files_in_network_share.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1537
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventCode: '5145'
    ObjectType: 'File'
    AccessMask: '0x2'
    span: '5m'
    upperThreshold: '(avgShareName'
    isOutlier:
      - 'if(avgShareName'
      - '1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
