title: User Logoff Event
id: 0c57b3c1-0c57-4c57-ac57-0c57b3c10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1531
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_user_logoff.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID:
    #             - 4634
    #             - 4647
    #     condition: selection
    # 
  condition: selection
level: medium
