title: Suspicious GetTypeFromCLSID ShellExecute
id: e0639d19-6f09-403a-b37a-e248145cbb36
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.015.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/015/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_gettypefromclsid.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.015
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - '::GetTypeFromCLSID('
              - '.ShellExecute('
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
