title: Service Installed By Unusual Client - Security
id: ce55bfe7-0751-4ef7-bdce-ad5383df53aa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1543.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1543/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_service_installation_by_unusal_client.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1543
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_eid:
          EventID: 4697
      selection_pid:
          - ClientProcessId: 0
          - ParentProcessId: 0
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
