title: Potential Port Monitor or Print Processor Registration Abuse
id: c1786587-7293-47e3-a816-566fc68ef767
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.012.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1547/012/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/privilege_escalation_port_monitor_print_pocessor_abuse.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1547.012
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.path:
      - 'HKLM\\SYSTEM\\*ControlSet*\\Control\\Print\\Monitors\\*'
      - '\\REGISTRY\\MACHINE\\SYSTEM\\*ControlSet*\\Control\\Print\\Environments\\Windows*\\Print Processors\\*'
    registry.data.strings: '*.dll'
    user.id: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
