title: Suspicious PlistBuddy Usage
id: d2e55d27-9f08-47ba-a7b2-7c70202ae9cd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1543.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1543/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/suspicious_plistbuddy_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1543.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'PlistBuddy'
    process:
      - '*LaunchAgents*'
      - '*RunAtLoad*'
      - '*true*)'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
