title: Potential Persistence Via App Paths Default Property
id: d0dbb3ac-7fcb-444d-9219-06d6d40ef4c0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.012.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_persistence_app_paths.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.012
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\App Paths'
          TargetObject|endswith:
              - '(Default)'
              - 'Path'
          Details|contains:
              # Add more suspicious paths or binaries as you see fit.
              - '\Users\Public'
              - '\AppData\Local\Temp\'
              - '\Windows\Temp\'
              - '\Desktop\'
              - '\Downloads\'
              - '%temp%'
              - '%tmp%'
              - 'iex'
              - 'Invoke-'
              - 'rundll32'
              - 'regsvr32'
              - 'mshta'
              - 'cscript'
              - 'wscript'
              - '.bat'
              - '.hta'
              - '.dll'
              - '.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
