title: Installation of Security Support Provider
id: 96427879-8ba4-4631-b7e6-9bfd83888d24
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.005.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1547/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_via_lsa_security_support_provider_registry.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1547.005
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.value: 'Security Packages'
    registry.path:
      - '*\\SYSTEM\\*ControlSet*\\Control\\Lsa\\Security Packages'
      - '*\\SYSTEM\\*ControlSet*\\Control\\Lsa\\OSConfig\\Security Packages'
    process.executable:
      - 'C:\\Windows\\System32\\msiexec.exe'
      - 'C:\\Windows\\SysWOW64\\msiexec.exe'
    C: '\\Windows\\System32\\msiexec.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
