title: Change Default File Association Via Assoc
id: 1474daa8-eb5c-4665-8bdf-a963c8ed9c56
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_assoc_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\cmd.exe'
          - OriginalFileName: 'Cmd.Exe'
      selection_cli:
          CommandLine|contains: 'assoc'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
