title: Registry Persistence via AppCert DLL
id: 458e7b31-19a5-44b8-8780-50d95dc85e47
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.009.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/009/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_appcertdlls_registry.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546.009
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.path: '*\\SYSTEM\\*ControlSet*\\Control\\Session Manager\\AppCertDLLs\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
