title: Print Processor Registry Autostart
id: 41985eee-4198-4198-a198-41985eee0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1547.012
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/print_processor_registry_autostart.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1547.012
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count  min(_time) as firstTime
    #   max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path
    #   ="*\\Control\\Print\\Environments\\Windows x64\\Print Processors*" by Registry.action
    #   Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    #   Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    #   Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    #   | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)`
    #   | `print_processor_registry_autostart_filter`
  condition: selection
level: medium
