title: UEFI Persistence Via Wpbbin - FileCreation
id: 882f0905-9202-47cd-98a3-6ee0647164f5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1542.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1542/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_wpbbin_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1542.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          TargetFilename: 'C:\Windows\System32\wpbbin.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
