title: Potential Privilege Escalation via Local Kerberos Relay over LDAP
id: 46a4b60f-d024-4799-8e18-e0593716c6b8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_privesc_kerberos_relay_over_ldap.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 3
          AuthenticationPackageName: 'Kerberos'
          IpAddress: '127.0.0.1'
          TargetUserSid|startswith: 'S-1-5-21-'
          TargetUserSid|endswith: '-500'
      filter_main_ip_null:
          IpPort: '0'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
