title: Windows Registry BootExecute Modification
id: 58e24c74-58e2-48e2-a8e2-58e24c740000
status: stable
description: Detection rule for MITRE ATT&CK technique T1542
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_registry_bootexecute_modification.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1542
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime FROM datamodel=Endpoint.Registry WHERE Registry.registry_path="*\\System\\CurrentControlSet\\Control\\Session
    #   Manager\\BootExecute" by Registry.action Registry.dest Registry.process_guid Registry.process_id
    #   Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
    #   Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
    #   Registry.vendor_product | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_registry_bootexecute_modification_filter`
  condition: selection
level: medium
