title: Registry Persistence via AppInit DLL
id: bd60b516-a8b5-4e0b-95e0-af93222a45f2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.010.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/010/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_appinitdlls_registry.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546.010
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    registry.value: 'AppInit_Dlls'
    process.executable:
      - '?:\\Windows\\System32\\DriverStore\\FileRepository\\*\\Display.NvContainer\\NVDisplay.Container.exe'
      - '?:\\Program Files\\NVIDIA Corporation\\Display.NvContainer\\NVDisplay.Container.exe'
    variations: 'HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_Dlls'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
