title: Windows Autostart Execution LSASS Driver Registry Modification
id: ff7f36f5-88bb-4a0a-bf66-4f8036d380d4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.008.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1547/008/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_autostart_execution_lsass_driver_registry_modification.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1547.008
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Registry'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
