title: Linux Add User Account
id: 675a0338-335f-4230-ab94-aa04bc4956fa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1548/003/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_add_user_account.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1548.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
