title: HackTool - SecurityXploded Execution
id: 7928d36a-575a-4abc-b995-3a923ec5f6b2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_secutyxploded.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          - Company: SecurityXploded
          - Image|endswith: 'PasswordDump.exe'
          - OriginalFileName|endswith: 'PasswordDump.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
