title: Persistence Via New SIP Provider
id: e03844b6-d8a8-468d-8851-1d94159412ad
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_sip_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_root:
          TargetObject|contains:
              - '\SOFTWARE\Microsoft\Cryptography\Providers\'
              - '\SOFTWARE\Microsoft\Cryptography\OID\EncodingType'
              - '\SOFTWARE\WOW6432Node\Microsoft\Cryptography\Providers\'
              - '\SOFTWARE\WOW6432Node\Microsoft\Cryptography\OID\EncodingType'
      selection_dll:
          TargetObject|contains:
              - '\Dll'
              - '\$DLL'
      filter:
          Details:
              # Add more legitimate SIP providers according to your env
              - WINTRUST.DLL
              - mso.dll
      filter_poqexec:
          Image: 'C:\Windows\System32\poqexec.exe'
          TargetObject|contains: '\CryptSIPDll'
          Details: 'C:\Windows\System32\PsfSip.dll'
      condition: all of selection_* and not 1 of filter*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
