title: Windows ISO LNK File Creation
id: 437505a5-770d-4b11-b7e3-c614138b79d2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1556/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_iso_lnk_file_creation.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1556.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Filesystem'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
