title: RottenPotato Like Attack Pattern
id: eb8caf4e-7a3a-44da-a423-00a2555d9bb7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1557.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1557/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_rottenpotato.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1557.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 3
          TargetUserName: 'ANONYMOUS LOGON'
          WorkstationName: '-'
          IpAddress:
              - '127.0.0.1'
              - '::1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
