title: Windows Password Managers Discovery
id: 30ff7da2-30ff-40ff-a0ff-30ff7da20000
status: stable
description: Detection rule for MITRE ATT&CK technique T1555.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_password_managers_discovery.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1555.005
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where Processes.process = "*dir *"
    #   OR  Processes.process = "*findstr*" AND Processes.process IN ( "*.kdbx*", "*credential*",
    #   "*key3.db*","*pass*", "*cred*", "*key4.db*", "*accessTokens*", "*access_tokens*",
    #   "*.htpasswd*", "*Ntds.dit*") by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_password_managers_discovery_filter`
  condition: selection
level: medium
