title: Kerberos Pre-Authentication Flag Disabled in UserAccountControl
id: 071dc6cf-071d-471d-a71d-071dc6cf0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1558.004
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/kerberos_pre_authentication_flag_disabled_in_useraccountcontrol.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1558.004
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # `wineventlog_security` EventCode=4738 MSADChangedAttributes="*\'Don\'t Require Preauth\'
    #   - Enabled*" |rename Account_Name as user | table EventCode, user, dest, Security_ID,
    #   MSADChangedAttributes | `kerberos_pre_authentication_flag_disabled_in_useraccountcontrol_filter`
  condition: selection
level: medium
