title: DNS Query Request By Regsvr32.EXE
id: ecb56880-c965-4d19-bdd6-156831e3bed3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1559.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1559/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_regsvr32_dns_query.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1559.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\regsvr32.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
