title: Windows Registry SIP Provider Modification
id: 01bd575d-01bd-41bd-a1bd-01bd575d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1553.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_registry_sip_provider_modification.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1553.003
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count values(Registry.registry_key_name)
    #   as registry_key_name values(Registry.registry_path) as registry_path min(_time)
    #   as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path
    #   IN ("*\\SOFTWARE\\Microsoft\\Cryptography\\Providers\\*", "*\\SOFTWARE\\Microsoft\\Cryptography\\OID\\EncodingType*",
    #   "*\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\Providers\\*", "*\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\OID\\EncodingType*")
    #   Registry.registry_value_name IN ("Dll","$DLL") by Registry.action Registry.dest
    #   Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
    #   Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
    #   Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
    #   | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)`|
    #   `windows_registry_sip_provider_modification_filter`
  condition: selection
level: medium
