title: Findstr GPP Passwords
id: b4e31f95-9ec3-428a-8d64-b8d251ef23e1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - '\find.exe'
                - '\findstr.exe'
          - OriginalFileName:
                - 'FIND.EXE'
                - 'FINDSTR.EXE'
      selection_cli:
          CommandLine|contains|all:
              - 'cpassword'
              - '\sysvol\'
              - '.xml'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
