title: Outgoing Logon with New Credentials
id: 857ed148-a0a2-4e30-ba3d-e7203c4295a4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1550/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_logon_newcredentials.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1550
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 9
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
