title: Certificate Exported Via PowerShell
id: 90a32dd6-ef66-411a-9b70-6799478bd723
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_export_certificate.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.004
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains:
              - 'Export-PfxCertificate '
              - 'Export-Certificate '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
