title: Successful Overpass the Hash Attempt
id: ab3b42ef-c1f0-4037-8a37-d82b84167cee
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1550/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_overpass_the_hash.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1550.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 9
          LogonProcessName: seclogo
          AuthenticationPackageName: Negotiate
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
