title: Cisco Isovalent - Access To Cloud Metadata Service
id: 2c17b9e2-2c17-4c17-ac17-2c17b9e20000
status: stable
description: Detection rule for MITRE ATT&CK technique T1552.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cisco_isovalent___access_to_cloud_metadata_service.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1552.005
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # `cisco_isovalent_process_connect` | rename process_connect.parent.binary as binary | `excluded_cloud_binaries`
    #   | stats count 
    #           min(_time) as firstTime 
    #           max(_time) as lastTime 
    #           values(dest_port) as dest_port
    #           values(src_ip) as src_ip
    #       by cluster_name pod_name pod_image_name pod_namespace node_name dest_ip
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `cisco_isovalent___access_to_cloud_metadata_service_filter`
  condition: selection
level: medium
