title: Windows Password Managers Discovery
id: 099961d0-af5a-4986-a147-bf038eb47b77
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1555/005/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_password_managers_discovery.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1555.005
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process:
      - '*dir'
      - '*findstr*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
