title: CobaltStrike Service Installations - Security
id: 6d573e72-4a6a-42cb-a285-b94d1868cd80
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1569.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1569/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1569.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      event_id:
          EventID: 4697
      selection1:
          ServiceFileName|contains|all:
              - 'ADMIN$'
              - '.exe'
      selection2:
          ServiceFileName|contains|all:
              - '%COMSPEC%'
              - 'start'
              - 'powershell'
      selection3:
          ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
      selection4:
          ServiceFileName|base64offset|contains: "IEX (New-Object Net.Webclient).DownloadString('http://127.0.0.1:"
      condition: event_id and 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
