title: Potential MSTSC Shadowing Activity
id: 8f67323a-dff6-4e9b-b056-c32831ddbdaa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1563.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1563/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mstsc_rdp_hijack_shadowing.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1563.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - 'noconsentprompt'
              - 'shadow:'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
