title: ISATAP Router Address Was Set
id: 4926f8f7-1238-4fdf-91ca-6d2747c9b06c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1565.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1565/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/system/microsoft_windows_Iphlpsvc/win_system_isatap_router_address_set.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1565.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4100
          Provider_Name: 'Microsoft-Windows-Iphlpsvc'
      filter_main_localhost:
          IsatapRouter:
              - '127.0.0.1'
              - '::1'
      filter_optional_null:
          IsatapRouter: null
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
