title: ETW Trace Evasion Activity
id: b7079bee-4e87-4686-8d39-907209f584e3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_etw_trace_evasion.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.006
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_clear_1:
          CommandLine|contains|all:
              - 'cl'
              - '/Trace'
      selection_clear_2:
          CommandLine|contains|all:
              - 'clear-log'
              - '/Trace'
      selection_disable_1:
          CommandLine|contains|all:
              - 'sl'
              - '/e:false'
      selection_disable_2:
          CommandLine|contains|all:
              - 'set-log'
              - '/e:false'
      selection_disable_3:   # ETW provider removal from a trace session
          CommandLine|contains|all:
              - 'logman'
              - 'update'
              - 'trace'
              - '--p'
              - '-ets'
      selection_pwsh_remove:   # Autologger provider removal
          CommandLine|contains: 'Remove-EtwTraceProvider'
      selection_pwsh_set:   # Provider “Enable” property modification
          CommandLine|contains|all:
              - 'Set-EtwTraceProvider'
              - '0x11'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
