title: Arbitrary File Download Via ConfigSecurityPolicy.EXE
id: a67edf74-a701-42f8-b7f8-4fc676ea0857
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1567.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1567/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_configsecuritypolicy_download_file.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1567
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_img:
          - CommandLine|contains: ConfigSecurityPolicy.exe
          - Image|endswith: '\ConfigSecurityPolicy.exe'
          - OriginalFileName: 'ConfigSecurityPolicy.exe'
      selection_url:
          CommandLine|contains:
              - 'ftp://'
              - 'http://'
              - 'https://'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
