title: 7zip CommandLine To SMB Share Path
id: 140278bc-1402-4402-a402-140278bc0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1560.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/7zip_commandline_to_smb_share_path.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1560.001
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    #   as lastTime from datamodel=Endpoint.Processes where (Processes.process_name ="7z.exe"
    #   OR Processes.process_name = "7za.exe" OR Processes.process_name = "7zr.exe" OR Processes.original_file_name
    #   = "7z.exe" OR Processes.original_file_name =  "7za.exe" OR Processes.original_file_name
    #   =  "7zr.exe") AND (Processes.process="*\\C$\\*" OR Processes.process="*\\Admin$\\*"
    #   OR Processes.process="*\\IPC$\\*") by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `7zip_commandline_to_smb_share_path_filter`
  condition: selection
level: medium
