title: Windows Event Auditing Disabled
id: ef2a8e6b-7ae5-4de7-a8f7-68a57ba2134a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_disable_event_auditing.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.002
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID: 4719
          AuditPolicyChanges|contains:
              - '%%8448' # This is "Success removed"
              - '%%8450' # This is "Failure removed"
      filter_main_guid:
          # Note: We filter these GUID to avoid alert duplication as these are covered by ab4561b1-6c7e-48a7-ad08-087cfb9ce8f1
          SubcategoryGuid:
              - '{0CCE9210-69AE-11D9-BED3-505054503030}' # Audit Security State Change
              - '{0CCE9211-69AE-11D9-BED3-505054503030}' # Audit Security System Extension
              - '{0CCE9212-69AE-11D9-BED3-505054503030}' # Audit System Integrity
              - '{0CCE9215-69AE-11D9-BED3-505054503030}' # Audit Logon
              - '{0CCE9217-69AE-11D9-BED3-505054503030}' # Audit Account Lockout
              - '{0CCE921B-69AE-11D9-BED3-505054503030}' # Audit Special Logon
              - '{0CCE922B-69AE-11D9-BED3-505054503030}' # Audit Process Creation
              - '{0CCE922F-69AE-11D9-BED3-505054503030}' # Audit Audit Policy Change
              - '{0CCE9230-69AE-11D9-BED3-505054503030}' # Audit Authentication Policy Change
              - '{0CCE9235-69AE-11D9-BED3-505054503030}' # Audit User Account Management
              - '{0CCE9236-69AE-11D9-BED3-505054503030}' # Audit Computer Account Management
              - '{0CCE9237-69AE-11D9-BED3-505054503030}' # Audit Security Group Management
              - '{0CCE923F-69AE-11D9-BED3-505054503030}' # Audit Credential Validation
              - '{0CCE9240-69AE-11D9-BED3-505054503030}' # Audit Kerberos Service Ticket Operations
              - '{0CCE9242-69AE-11D9-BED3-505054503030}' # Audit Kerberos Authentication Service'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
