title: Suspicious PowerShell WindowStyle Option
id: 50f99102-0132-4b95-9444-9893f76e93ce
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_windowstyle.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains|all:
              - 'powershell'
              - 'WindowStyle'
              - 'Hidden'
      filter:
          ScriptBlockText|contains|all:
              - ':\Program Files\Amazon\WorkSpacesConfig\Scripts\'
              - '$PSScriptRoot\Module\WorkspaceScriptModule\WorkspaceScriptModule'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
