title: Potential Data Stealing Via Chromium Headless Debugging
id: 1ce654ee-5187-4eec-bf29-fce3fd5a29cd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_headless_debugging.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.003
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - '--remote-debugging-' # Covers: --remote-debugging-address, --remote-debugging-port, --remote-debugging-socket-name, --remote-debugging-pipe....etc
              - '--user-data-dir'
              - '--headless'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
