title: Metasploit Or Impacket Service Installation Via SMB PsExec
id: 55cb38fe-55cb-45cb-a5cb-55cb38fe0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1570
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_metasploit_or_impacket_smb_psexec_service_install.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1570
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 4697
    #         ServiceFileName|re: '^%systemroot%\\[a-zA-Z]{8}\.exe$'
    #         ServiceName|re: '(^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)'
    #         ServiceStartType: 3  # on-demand start, see https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4697
    #         ServiceType: '0x10'
    #     filter:
    #         ServiceName: 'PSEXESVC'
    #     condition: selection and not filter
    # 
  condition: selection
level: medium
