title: DLL Execution Via Register-cimprovider.exe
id: 5f9c9516-a5d4-48eb-95b1-b99e9897bfa8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_registry_cimprovider_dll_load.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          Image|endswith: '\register-cimprovider.exe'
          CommandLine|contains|all:
              - '-path'
              - 'dll'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
