title: Potential Exploitation of an Unquoted Service Path Vulnerability
id: 3041e559-33a5-41a2-9e94-ca2745159ac0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.009.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1574/009/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/privilege_escalation_unquoted_service_path.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1574.009
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.executable: '?:\\Program.exe'
    C: '\\Program'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
