title: Trusted Path Bypass via Windows Directory Spoofing
id: f1216a9c-6182-4c3b-a50a-a10d6b3047e2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/image_load/image_load_win_trusted_path_bypass.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.007
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          ImageLoaded|contains:
              - ':\Windows \System32\'  # Note the space between "Windows" and "System32"
              - ':\Windows \SysWOW64\'  # Note the space between "Windows" and "SysWOW64"
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
