title: Microsoft Defender Blocked from Loading Unsigned DLL
id: f46c9603-e22f-44c3-b6ed-1fde7bc73aa3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security_mitigations/win_security_mitigations_defender_load_unsigned_dll.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection:
          EventID:
              - 11
              - 12 # MDE: ExploitGuardNonMicrosoftSignedBlocked
          ProcessPath|endswith:
              - '\MpCmdRun.exe'
              - '\NisSrv.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
