title: Relevant Anti-Virus Signature Keywords In Application Log
id: ed3cccbc-e671-407b-8331-4115086006c2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1588.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1588/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/Other/win_av_relevant_match.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1588
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      keywords:
          - 'Adfind'
          - 'ASP/BackDoor '
          - 'ATK/'
          - 'Backdoor.ASP'
          - 'Backdoor.Cobalt'
          - 'Backdoor.JSP'
          - 'Backdoor.PHP'
          - 'Blackworm'
          - 'Brutel'
          - 'BruteR'
          - 'Chopper'
          - 'Cobalt'
          - 'COBEACON'
          - 'Cometer'
          - 'CRYPTES'
          - 'Cryptor'
          - 'Destructor'
          - 'DumpCreds'
          - 'Exploit.Script.CVE'
          - 'FastReverseProxy'
          - 'Filecoder'
          - 'GrandCrab '
          - 'HackTool'
          - 'HKTL'
          - 'HTool-'
          - '/HTool'
          - '.HTool'
          - 'IISExchgSpawnCMD'
          - 'Impacket'
          - 'JSP/BackDoor '
          - 'Keylogger'
          - 'Koadic'
          - 'Krypt'
          - 'Lazagne'
          - 'Metasploit'
          - 'Meterpreter'
          - 'MeteTool'
          - 'mikatz'
          - 'Mimikatz'
          - 'Mpreter'
          - 'MsfShell'
          - 'Nighthawk'
          - 'Packed.Generic.347'
          - 'PentestPowerShell'
          - 'Phobos'
          - 'PHP/BackDoor '
          - 'Potato'
          - 'PowerSploit'
          - 'PowerSSH'
          - 'PshlSpy'
          - 'PSWTool'
          - 'PWCrack'
          - 'PWDump'
          - 'Ransom'
          - 'Rozena'
          - 'Ryzerlo'
          - 'Sbelt'
          - 'Seatbelt'
          - 'SecurityTool '
          - 'SharpDump'
          - 'Shellcode'
          - 'Sliver'
          - 'Splinter'
          - 'Swrort'
          - 'Tescrypt'
          - 'TeslaCrypt'
          - 'TurtleLoader'
          - 'Valyria'
          - 'Webshell'
          # - 'FRP.'
          # - 'Locker'
          # - 'PWS.'
          # - 'PWSX'
          # - 'Razy'
          # - 'Ryuk'
      filter_optional_generic:
          - 'anti_ransomware_service.exe'
          - 'Anti-Ransomware'
          - 'Crack'
          - 'cyber-protect-service.exe'
          - 'encryptor'
          - 'Keygen'
      filter_optional_information:
          Level: 4  # Information level
      filter_optional_restartmanager:
          Provider_Name: 'Microsoft-Windows-RestartManager'
      condition: keywords and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
