title: Linux Medusa Rootkit
id: 824bad21-a259-447c-98b9-eb612f12ec50
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1589.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1589/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_medusa_rootkit.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1589.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Filesystem'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
