title: Windows RDP File Execution
id: 47fc5751-47fc-47fc-a7fc-47fc57510000
status: stable
description: Detection rule for MITRE ATT&CK technique T1598.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_rdp_file_execution.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1598.002
logsource:
  product: windows
  service: security
detection:
  selection:
    # Original splunk detection logic
    # | tstats count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
    #   where Processes.process IN ("*\\AppData\\Local\\Temp\\*", "*\\Olk\\Attachments\\*",
    #   "*\\AppData\\Local\\Microsoft\\Outlook\\*", "*\\Content.Outlook\\*", "*\\Downloads\\*")
    #   AND Processes.process="*.rdp*" by Processes.action Processes.dest Processes.original_file_name
    #   Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
    #   Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
    #   Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
    #   Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
    #   Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | eval
    #   execution_type=case( match(process, "\\\\Temp\\\\.*\\.(zip|7z|rar|cab|tgz|gz|tar|iso|img|vhd|vhdx).*\\.*\\.rdp"),
    #   "temp_archive_execution", match(process, "\\\\Downloads\\\\"), "downloads_execution",
    #   match(process, "\\\\Temp\\\\"), "temp_execution", match(process, "\\\\Microsoft\\\\Outlook\\\\"),
    #   "outlook_execution", match(process, "\\\\Olk\\\\Attachments\\\\"), "outlook_execution",
    #   match(process, "\\\\Content.Outlook\\\\"), "outlook_execution", true(), "other"
    #   ), risk_score=case( execution_type="temp_archive_execution", "Critical", execution_type
    #   IN ("temp_execution", "outlook_execution"), "High", execution_type="downloads_execution",
    #   "Medium", true(), "Low" ), risk_reason=case( execution_type="temp_archive_execution",
    #   "RDP file executed directly from archive/disk image in Temp directory", execution_type="downloads_execution",
    #   "RDP file executed from Downloads directory (Could be legitimate admin activity)",
    #   execution_type="temp_execution", "RDP file executed from Temp directory", execution_type="outlook_execution",
    #   "RDP file executed from Ou
    # ... [truncated]
  condition: selection
level: medium
