title: Windows Detect Network Scanner Behavior
id: 91372fcf-06a2-4b0b-8f3a-d51428270f9c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1595/001/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_detect_network_scanner_behavior.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1595.001
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    datamodel: 'Network_Traffic.All_Traffic'
    sourcetype: 'XmlWinEventLog'
    app: '*\\*'
    span: '5m'
    field: 'app'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
