title: Suspicious Download from Office Domain
id: 91a4ba0f-9d59-48a2-ab2a-19a243a74526
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1608.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1608/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_download_office_domain.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1608
logsource:
  product: windows
  service: security
  category: process_creation
detection:
      selection_download:
          - Image|endswith:
                - '\curl.exe'
                - '\wget.exe'
          - CommandLine|contains:
                - 'Invoke-WebRequest'
                - 'iwr '
                - 'curl '
                - 'wget '
                - 'Start-BitsTransfer'
                - '.DownloadFile('
                - '.DownloadString('
      selection_domains:
          CommandLine|contains:
              - 'https://attachment.outlook.live.net/owa/'
              - 'https://onenoteonlinesync.onenote.com/onenoteonlinesync/'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
