title: System Information Discovery (LINUX - auditd)
id: 8efa8b6e-2ead-41cd-9773-d5ed90d0273d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1082.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1082/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    name|contains:
      - '/sys/class/dmi/id/bios_version'
      - '/sys/class/dmi/id/product_name'
      - '/sys/class/dmi/id/chassis_vendor'
    SYSCALL|contains:
      - 'sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1082
  - actor.teamtnt
