title: Windows Service (LINUX - auditd)
id: 16f9b908-0a39-4a78-8429-bc1c91cdc502
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.teamtnt
