title: Credentials In Files (LINUX - auditd)
id: d93f2e2b-b709-4479-901f-666fe739f25a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.001.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1552.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    |all|contains:
      - 'grep'
      - 'password'
    Image|endswith|contains:
      - '/trufflehog'
    CommandLine|contains|contains:
      - ' docker --image '
      - ' Git '
      - ' GitHub '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.001
  - actor.teamtnt
