title: Code Signing (WINDOWS - security)
id: 2c3e9277-7c6c-4344-b203-d7eb4eb36727
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: CopyKittens
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.copykittens
