title: Archive via Utility (M365 - entra_id)
id: d40be34b-b786-4032-8c70-3e8305b1dcf2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: HAFNIUM
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.hafnium
