title: Server Software Component - BianLian (defender)
id: 9844b598-0da0-4e2f-9f02-e071a391c287
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505 (Server Software Component).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1505/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_shell_activity_by_web_server.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505
  - actor.bianlian
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'apache'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
