title: Spearphishing Link (M365)
id: eeebcbed-ca91-4c1e-8994-af0312ce126f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    AttachmentExtension|in:
      - 'exe'
      - 'dll'
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
