title: Web Shell (LINUX - auditd)
id: 173da23e-f325-47aa-b15f-85e546e04cc7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: Fox Kitten
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'execve'
      - 'execveat'
    ParentImage|endswith|contains:
      - '/httpd'
      - '/lighttpd'
      - '/nginx'
    ParentCommandLine|contains|all|contains:
      - '/bin/java'
      - 'tomcat'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.fox_kitten
