title: Match Legitimate Resource Name or Location (WINDOWS - defender)
id: ad2680c9-8623-4ae5-937a-7568e4c694cb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: APT39
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/create'
      - '-create'
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.apt39
