title: Spearphishing Attachment (MACOS - unified_logging)
id: ab8c4b92-1797-4a62-b757-8e9ed3a38754
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.001.
  Threat Actor: Cobalt Group
references:
  - https://attack.mitre.org/techniques/T1566.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/hdiutil'
    CommandLine|contains|contains:
      - 'attach '
      - 'mount '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.001
  - actor.cobalt_group
