title: LSASS Memory (WINDOWS - defender)
id: cb75e31b-3524-4a50-9bfa-9f3bfca6baad
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.001.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1003.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' -u '
      - ' --full '
      - ' -f '
    Image|endswith|contains:
      - '\TrolleyExpress.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.001
  - actor.gallium
