title: System Owner/User Discovery (WINDOWS - defender)
id: b2582515-dc4c-44cb-847b-93b93b639896
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SharpLdapWhoami.exe'
    CommandLine|contains|all|contains:
      - 'Get-ADComputer '
      - ' -Filter \*'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.gallium
