title: Scheduled Task (WINDOWS - defender)
id: 43f1eb01-6c10-4407-8e3d-ce9bcbd15560
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.005.
  Threat Actor: GALLIUM
references:
  - https://attack.mitre.org/techniques/T1053.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\powershell.exe'
      - '\pwsh.exe'
    Image|endswith|contains:
      - '\schtasks.exe'
    CommandLine|contains|windash|contains:
      - ' /tn '
      - ' /tr '
      - ' /sc '
    CommandLine|contains|all|contains:
      - '/Create'
      - '/RU'
      - '/TR'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.005
  - actor.gallium
