title: Credentials In Files (WINDOWS - defender)
id: 2e74521f-f703-4bcb-9181-4dce195d5536
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.001.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1552.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -s '
    CommandLine|contains|contains:
      - 'Offline_Winpwn'
      - 'WinPwn '
      - 'WinPwn.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.001
  - actor.teamtnt
