title: Screen Capture - Vect RaaS (unified_logging)
id: 3015bd31-1902-423c-a1c6-8a10ea5cacfb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_screencapture.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.vect_raas
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/usr/sbin/screencapture'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
