title: Exfiltration Over Unencrypted Non-C2 Protocol - Kazu (security)
id: 68c71446-cc57-43f8-8030-fb7a20afa8b5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1048.003 (Exfiltration Over Unencrypted Non-C2 Protocol).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_webdav_client_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1048.003
  - actor.kazu
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ParentProcessName|contains: '\svchost.exe'
    CommandLine|contains: 'C:\windows\system32\davclnt.dll,DavSetCookie'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
