title: Exploit Public-Facing Application - Kazu (security)
id: 10b20ad8-918e-4d65-8b5a-375a56ed3551
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1190 (Exploit Public-Facing Application).
  Associated threat actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_failed_logon_source.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1190
  - actor.kazu
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4625'
    IpAddress|contains:
      - '-'
      - '10.0.0.0/8'
      - '127.0.0.0/8'
      - '172.16.0.0/12'
      - '192.168.0.0/16'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
