title: SMB/Windows Admin Shares - Devman's Ransomware (unified_logging)
id: a805bb2c-34f8-4c89-a497-99deb016d2b9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.002 (SMB/Windows Admin Shares).
  Associated threat actor: Devman's Ransomware
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/lateral_movement_mounting_smb_share.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.002
  - actor.devman's_ransomware
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line|contains: 'osascript*mount volume*smb://*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
