title: File and Directory Discovery (WINDOWS - sysmon)
id: f23e4149-a5d9-4762-b944-b3a3dbc7f7a3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.donex
