title: Hidden Window (WINDOWS - sysmon)
id: 4c93f73e-0aea-41e3-95e0-a340b985e9d5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.003.
  Threat Actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1564.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - '--headless'
      - 'dump-dom'
      - 'http'
    Image|endswith|contains:
      - '\brave.exe'
      - '\chrome.exe'
      - '\msedge.exe'
    CommandLine|contains|contains:
      - '--headless'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.003
  - actor.donex
