title: SSH (WINDOWS - defender)
id: f5936c26-f94b-47bf-a722-f363ed77ffb6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.ransomhub
