title: Hide Artifacts (WINDOWS - defender)
id: 8bccc595-c67d-4961-abdb-d74ffaf4a5fc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.ransomhub
