title: Lateral Tool Transfer (WINDOWS - defender)
id: 7da616ff-b074-4055-90a9-40be7ba1e228
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.ransomhub
