title: Default Accounts - Beast (security)
id: f6f48202-8e49-412e-a7a3-9736a7f1ba32
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: Beast
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.beast
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '10'
    AuthenticationPackageName|contains: 'Negotiate'
    TargetUserName|contains: 'Admin'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
