title: Local Account - LockBit (auditd)
id: b765d1b0-4620-4c59-a0a2-51dfdd85f51a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.001 (Local Account).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.001
  - actor.lockbit
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains:
      - '/lastlog'
      - '/id'
      - '/lsof'
    cmd|contains:
      - '''x:0:'''
      - '/cat'
      - '/ed'
      - '/head'
      - '/more'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
