title: Archive via Utility - LockBit (auditd)
id: ac587e6c-463e-42ab-8cf2-a507c505da3f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1560.001 (Archive via Utility).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1560/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_data_compressed.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1560.001
  - actor.lockbit
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'execve'
      - 'execve'
      - 'execve'
    a0|contains:
      - 'zip'
      - 'gzip'
      - 'tar'
    a1|contains:
      - '-k'
      - '-c'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
