title: Domain Account (GOOGLE - workspace)
id: dff567e3-b2a5-4f7a-98f3-71aa2a078d8b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.002.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1087.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.002
  - actor.inc_ransom
