title: Non-Application Layer Protocol - SafePay (workspace)
id: 365f6e8f-d719-469a-bd93-45d175b2b58c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1095 (Non-Application Layer Protocol).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_connection_attempt_by_non_ssh_root_session.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1095
  - actor.safepay
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.executable|contains:
      - '/bin/ssh'
      - '/usr/bin/sshpass'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
