title: Ingress Tool Transfer - SafePay (workspace)
id: e4878b48-1926-43cf-86e6-3de400430625
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1105 (Ingress Tool Transfer).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/command_and_control_google_drive_malicious_file_download.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1105
  - actor.safepay
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains:
      - 'Microsoft Edge'
      - 'wget.exe'
    process.command_line|contains: '*confirm=no_antivirus*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
