title: System Service Discovery - Nitrogen (auditd)
id: fee1a5b1-eef0-41d4-8a4e-a5e6f4a4d152
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1007 (System Service Discovery).
  Associated threat actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1007
  - actor.nitrogen
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains: '/crontab'
    cmd|contains: ' -l'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
