title: Exploitation for Privilege Escalation - Nitrogen (auditd)
id: c80f19e0-fd9c-4b1c-a449-72d34f7139d2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1068 (Exploitation for Privilege Escalation).
  Associated threat actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1068/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_coinminer.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1068
  - actor.nitrogen
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    a1|contains: '--cpu-priority'
    a2|contains: '--cpu-priority'
    a3|contains: '--cpu-priority'
    a4|contains: '--cpu-priority'
    a5|contains: '--cpu-priority'
    a6|contains: '--cpu-priority'
    a7|contains: '--cpu-priority'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
