title: Valid Accounts (WINDOWS - security)
id: 78f109e3-e8f0-4985-98a3-054680aef783
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: MUSTANG PANDA
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.mustang_panda
