title: Account Discovery (WINDOWS - security)
id: 63653a09-254c-488e-ba5c-f5947b27825d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.
  Threat Actor: MUSTANG PANDA
references:
  - https://attack.mitre.org/techniques/T1087/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - ' applicationsinfo'
      - ' browserinfo'
      - ' eventsinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087
  - actor.mustang_panda
