title: Code Signing (WINDOWS - security)
id: 5206a17c-9166-47d1-98a4-596a26f92a5a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.mustang_panda
