title: Executable Installer File Permissions Weakness (WINDOWS - security)
id: 71d750b0-3b31-49d3-ba83-93abc4278c73
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.005.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1574.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ' -m '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.005
  - actor.mustang_panda
