title: T1003.003 (WINDOWS - security)
id: 3cb58f0b-f3bd-40b1-807e-fdf96bf1458c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    NewProcessName|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    CommandLine|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.lockbit
