title: Process Injection (WINDOWS - security)
id: 13b26d15-22de-4cdf-a58f-18aa8e821e15
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1055/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\CoercedPotato.exe'
    CommandLine|contains:
      - 'dllhost.exe'
      - 'dllhost'
    CommandLine|contains|contains:
      - ' --exploitId '
    CommandLine|contains|all|contains:
      - ' /am51'
      - ' /password'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055
  - actor.lockbit
