title: Software Deployment Tools (WINDOWS - security)
id: ac567b76-cf74-4033-a860-d25967ce579e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.lockbit
