title: Token Impersonation/Theft (WINDOWS - security)
id: b59339b2-7001-4378-8f56-b2a6039988c4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1134.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    FilterName|contains|contains:
      - 'RonPolicy'
    ServiceFileName|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.001
  - actor.lockbit
