title: Domain Account (WINDOWS - security)
id: caac954d-f814-4a4b-b2fe-b222f8ac089f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.lockbit
