title: Windows File and Directory Permissions Modification (WINDOWS - security)
id: 1c08c6a9-bdce-4d09-9496-483672493215
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1222.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1222.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectServer|contains:
      - 'DS'
    CommandLine|contains|all|contains:
      - '/f '
      - '/r'
    Image|endswith|contains:
      - '\takeown.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1222.001
  - actor.lockbit
