title: Group Policy Modification (WINDOWS - security)
id: 78ef6564-05ac-444c-b3d2-4e2fd8fd6842
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectClass|contains:
      - 'groupPolicyContainer'
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.lockbit
