title: Bypass User Account Control (WINDOWS)
id: c4b26a3d-d4a9-458a-a186-da5616607eb1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.002.
references:
  - https://attack.mitre.org/techniques/T1548.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548.002
