title: Lateral Tool Transfer (WINDOWS - security)
id: 2ae6a218-895f-48e6-9cf3-c7a51c9c4047
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|re|contains:
      - '^%systemroot%\\[a-zA-Z]{8}\.exe$'
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.lockbit
