title: SMB/Windows Admin Shares (WINDOWS - defender)
id: aa5726ab-eab6-47d3-8ce2-11a50520791b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.002.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1021.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'computername='
    CommandLine|contains|all|contains:
      - ' use '
      - ' http'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.002
  - actor.sandworm_team
