title: Software Deployment Tools (WINDOWS - defender)
id: c4b8a280-21c4-4ad0-87bf-2b643b7a75c5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.sandworm_team
