title: OS Credential Dumping - Devman's Ransomware (auditd)
id: 37dbf5b9-2bd1-4227-8e95-ef585204ab0b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Devman's Ransomware
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_keylogging_with_pam_d.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.devman's_ransomware
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/etc/pam.d/system-auth'
      - '/etc/pam.d/password-auth'
      - 'TTY'
      - 'USER_TTY'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
