title: System Information Discovery - Devman's Ransomware (auditd)
id: d9525356-f882-4d5f-b871-25f0524450c2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: Devman's Ransomware
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_system_info_discovery.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.devman's_ransomware
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/etc/lsb-release'
      - '/etc/redhat-release'
      - '/etc/issue'
      - 'EXECVE'
    a0|contains:
      - 'grep'
      - 'vbox'
      - 'vm'
      - 'xen'
      - 'virtio'
    a1|contains: 'list'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
