title: Archive via Utility (LINUX - auditd)
id: db425142-78c7-4575-bb8f-c6cc2881066f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: APT1
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'execve'
    a0|contains:
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.apt1
