title: Disable or Modify System Firewall (WINDOWS - sysmon)
id: 92e7d77f-94db-4335-bf7f-c6749472fd1c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.004.
  Threat Actor: FIN7
references:
  - https://attack.mitre.org/techniques/T1562.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'firewall '
      - 'add '
      - 'tcp '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.004
  - actor.fin7
