title: Protocol Tunneling (WINDOWS - sysmon)
id: 214b91f4-f234-44c2-96b7-321fb23b2cb7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1572.
  Threat Actor: FIN7
references:
  - https://attack.mitre.org/techniques/T1572/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - ' -R '
    Description|contains:
      - 'Command-line SSH, Telnet, and Rlogin client'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1572
  - actor.fin7
