title: Rootkit - SafeLocker (workspace)
id: caa2d805-357d-4ca2-85f2-7554c6fa45f7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1014 (Rootkit).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1014
  - actor.safelocker
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
