title: Email Collection - SafeLocker (workspace)
id: a53da3d7-dc23-47b9-843b-5a60d46841b3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1114 (Email Collection).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_workspace_custom_gmail_route_created_or_modified.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1114
  - actor.safelocker
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_GMAIL_SETTING'
    google_workspace.event.type|contains: 'EMAIL_SETTINGS'
    google_workspace.admin.setting.name|contains: 'EMAIL_ROUTE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
