title: LSA Secrets (WINDOWS - security)
id: 32caec15-c5ac-4ce5-8dc3-7f6675d55350
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: APT33
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.apt33
