title: System Network Configuration Discovery (LINUX - auditd)
id: ff105d7e-0b3c-4b1c-9297-70f587b39f28
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: ZIRCONIUM
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/firewall-cmd'
      - '/ufw'
      - '/iptables'
    CommandLine|contains|contains:
      - '/etc/resolv.conf'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.zirconium
