title: Clear Windows Event Logs (WINDOWS - sysmon)
id: 6a669f38-d09e-48f1-bc3c-bfe29146ff96
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'clear-log '
      - ' cl '
      - 'set-log '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
  - actor.shinra
