title: Indirect Command Execution (WINDOWS - sysmon)
id: 7103d449-d93c-433c-a513-00b0984ef8b6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1202.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1202/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'bash.exe -'
      - 'bash -'
    ParentImage|endswith|contains:
      - '\bginfo.exe'
      - '\bginfo64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1202
  - actor.shinra
