title: OS Credential Dumping (LINUX - auditd)
id: 1ed5d401-1223-44cd-858a-d26a74985dba
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains:
      - '/etc/pam.d/system-auth'
      - '/etc/pam.d/password-auth'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.mustang_panda
