title: Code Signing (LINUX - auditd)
id: ecba5128-c1c2-4615-8415-2e370365ff88
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.mustang_panda
