title: Archive via Utility (LINUX - auditd)
id: 4044ed30-1da7-48ba-8677-273b6b6f1214
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: Mustang Panda
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'execve'
    a0|contains:
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.mustang_panda
