title: Mshta (WINDOWS - defender)
id: 1f3c1b7f-ee41-41cc-918d-e2f962ed311a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.005.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1218.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cscript.exe'
      - '\excel.exe'
      - '\mshta.exe'
    CommandLine|contains|contains:
      - 'javascript'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.005
  - actor.kimsuky
