title: Network Share Discovery (WINDOWS - defender)
id: af75599b-8efd-46af-a493-d287b121c962
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1135.
  Threat Actor: APT38
references:
  - https://attack.mitre.org/techniques/T1135/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cmd.exe'
      - '\powershell.exe'
      - '\pwsh.exe'
    Image|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|all|contains:
      - '/portable'
      - '/lng'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1135
  - actor.apt38
