title: Domain Accounts - Interlock (security)
id: ee5c8b5b-cdc9-4fd6-8c6c-bdde34f737d8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.002 (Domain Accounts).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1078/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.002
  - actor.interlock
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '10'
    AuthenticationPackageName|contains: 'Negotiate'
    TargetUserName|contains: 'Admin'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
