title: Process Injection (WINDOWS - security)
id: f81788e4-4f17-4d95-a8a0-d3fbf166a990
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1055/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\CoercedPotato.exe'
    CommandLine|contains:
      - 'dllhost.exe'
      - 'dllhost'
    CommandLine|contains|contains:
      - ' --exploitId '
    CommandLine|contains|all|contains:
      - ' /am51'
      - ' /password'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055
  - actor.apt32
