title: Credentials in Registry (WINDOWS - security)
id: e588745e-8d49-41e7-b8ca-28f2cbdb3470
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.002.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1552.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'Key'
    Image|endswith|contains:
      - 'reg.exe'
    CommandLine|contains|all|contains:
      - ' query '
      - '/t '
      - 'REG_SZ'
    CommandLine|contains|contains:
      - '\Software\Aerofox\Foxmail\V3.1'
      - '\Software\Aerofox\FoxmailPreview'
      - '\Software\DownloadManager\Passwords'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.002
  - actor.apt32
