title: Impair Defenses (LINUX)
id: 5b2803e3-0eae-4459-a40c-4553426023a0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.
references:
  - https://attack.mitre.org/techniques/T1562/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562
