title: Hidden Window (LINUX - auditd)
id: 2fab87a7-f11a-4228-b225-a367a0c3f392
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.003.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.003
  - actor.spectra
