title: Impair Defenses (LINUX - auditd)
id: 600f1460-1ce3-400b-a013-0dcafa4aa170
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1562/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562
  - actor.spectra
