title: Windows Service (LINUX)
id: e42fc4f3-c5c6-465f-a6c0-e6da73033e58
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
