title: System Information Discovery - Hunt-Dharma-Crysis (security)
id: 3d2a7d6c-3bd7-4a60-9ffa-8a891c30bc9b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_virtual_machine_fingerprinting_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.hunt-dharma-crysis
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.args|contains: 'Manufacturer*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
