title: Service Execution - Hunt-Dharma-Crysis (security)
id: 210b6ad1-9ed8-4fe0-8244-144f26cae9fa
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1569.002 (Service Execution).
  Associated threat actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1569/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1569.002
  - actor.hunt-dharma-crysis
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'ADMIN$'
      - '.exe'
      - '%COMSPEC%'
      - 'start'
    ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
