title: Spearphishing Link (MACOS - unified_logging)
id: 19e9ac29-c8cf-4f15-b0d1-c96fc8b59173
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.oilrig
