title: Web Service (WINDOWS - defender)
id: 4a386102-3b8e-4cbc-9104-7bb5ab60e56b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1102.
  Threat Actor: FIN8
references:
  - https://attack.mitre.org/techniques/T1102/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - '-config '
      - '-credentials-contents '
      - '-credentials-file '
    ParentImage|contains|all|contains:
      - '\ManageEngine\ServiceDesk\'
      - '\java.exe'
    Image|endswith|contains:
      - '\AppVLP.exe'
      - '\bash.exe'
      - '\bitsadmin.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1102
  - actor.fin8
