title: Encrypted/Encoded File - GLOBAL (workspace)
id: 5895f1fb-fbcd-4667-ab78-e2bb6e912045
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.013 (Encrypted/Encoded File).
  Associated threat actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1027/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_encoding_rot13_python_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.013
  - actor.global
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains: 'python*'
    file.name|contains: 'rot_??.cpython-*.pyc*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
