title: Spearphishing Link (MACOS - unified_logging)
id: c000e6ba-a027-42c5-bfc9-f94646409067
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.002.
  Threat Actor: FIN7
references:
  - https://attack.mitre.org/techniques/T1566.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.002
  - actor.fin7
