title: Screen Capture (WINDOWS - security)
id: 48492270-cb30-4124-8595-8665e2c3ca7b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1113.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1113/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\Psr.exe'
    CommandLine|contains|contains:
      - '/start'
      - '-start'
    CommandLine|contains|all|contains:
      - 'Microsoft\Windows\WindowsAI'
      - 'DisableAIDataAnalysis'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1113
  - actor.kimsuky
