title: External Remote Services (WINDOWS - security)
id: dafd7cbc-d169-4900-89b8-41899cc9a48c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.kimsuky
