title: Web Shell (WINDOWS - security)
id: 5a519000-f843-4751-b538-08ae9d994a53
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'install'
      - 'module'
    ParentImage|endswith|contains:
      - '\sqlservr.exe'
    Image|endswith|contains:
      - '\bash.exe'
      - '\bitsadmin.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '&ipconfig&echo'
      - '&quser&echo'
      - '&whoami&echo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.kimsuky
