title: External Remote Services (LINUX - auditd)
id: 1c8eeb1e-6089-470a-8bbe-0f8a7b01ddb8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: GOLD SOUTHFIELD
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/TeamViewer_Service'
    Image|endswith|contains:
      - '/TeamViewer_Desktop'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.gold_southfield
