title: Local Accounts (LINUX - auditd)
id: 4af47064-49a1-4cbb-9413-f65576bcb2cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.003.
  Threat Actor: FIN7
references:
  - https://attack.mitre.org/techniques/T1078.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078.003
  - actor.fin7
