title: Masquerade Account Name (GOOGLE - workspace)
id: cc913635-e735-4dca-9112-2c80cfbd5644
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.010.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1036.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.010
  - actor.dragonfly
