title: Server (GOOGLE - workspace)
id: b0280670-7552-43cb-b42d-6eb1ec9572d6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1584.004.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1584.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1584.004
  - actor.dragonfly
