title: T1003 (M365 - entra_id)
id: 58666f1f-7017-4438-953b-f72d6edf6553
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.cactus_ransomware
