title: Disable or Modify System Firewall (LINUX - auditd)
id: ec38e14e-a6bf-47f0-9394-46e3aa574593
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.004.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1562.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SERVICE_STOP'
    a0|endswith|contains:
      - 'iptables'
    a0|contains:
      - 'iptables'
    unit|contains:
      - 'firewalld'
      - 'iptables'
      - 'ufw'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.004
  - actor.oilrig
