title: Local Account - BQTLock (auditd)
id: 4fa9432e-b203-4d5d-8d2c-fa670a8ff9e0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1136.001 (Local Account).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_create_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1136.001
  - actor.bqtlock
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - 'ADD_USER' # This is logged without having to configure audit rules on both Ubuntu and Centos'
    exe|contains: '/useradd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
