title: Web Service - Benzona (security)
id: 94e13496-0926-420b-9dfa-7f5321944fe5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1102 (Web Service).
  Associated threat actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1102/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/beaconing/command_and_control_beaconing.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1102
  - actor.benzona
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'WaAppAgent.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
