title: Data Manipulation - Benzona (security)
id: a4bbbd6e-deae-486f-89d0-47ab37a529bc
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1565 (Data Manipulation).
  Associated threat actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1565/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/impact_hosts_file_modified.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1565
  - actor.benzona
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/private/etc/hosts'
      - '?:\\Windows\\System32\\drivers\\etc\\hosts'
    process.executable|contains:
      - 'C:\\Program Files\\Fortinet\\FortiClient\\FCDBLog.exe'
      - '/usr/local/demisto/server'
    process.args|contains: '/etc/hosts'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
