title: Inhibit System Recovery (WINDOWS - sysmon)
id: d8cd7e1c-e4d7-4b4e-ac12-944e096de7ea
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1490.
  Threat Actor: 0mega
references:
  - https://attack.mitre.org/techniques/T1490/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Win32_ShadowCopy'
    CommandLine|contains|all|contains:
      - 'copy '
      - '\\\\\?\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1490
  - actor.0mega
