title: Exfiltration Over Web Service (LINUX - auditd)
id: 8ee20db0-e482-45e7-98f0-46f589ed2dec
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/curl'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.cephalus
