title: DLL Side-Loading (LINUX - auditd)
id: 862fec85-a41f-4ac1-b86f-5f56b4ce880e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.002.
  Threat Actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1574.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.002
  - actor.cephalus
