title: T1190 (GOOGLE - workspace)
id: 745cd5d2-6299-49c1-be13-b1b174d5331f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: Benzona
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.benzona
