title: T1235 (GOOGLE - workspace)
id: 1181432c-5fff-451e-8148-32f029e4e30f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1235.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1235/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1235
  - actor.kazu
