title: Obfuscated Files or Information (MACOS - unified_logging)
id: 197e0258-94f0-4e8e-9f43-43df7c34462f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/usr/bin/base64'
    CommandLine|contains|contains:
      - '-d'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.yashma-ator-vietnamita
