title: Disable or Modify Tools (MACOS - unified_logging)
id: ecc71b5b-1102-4b9f-89d7-5a9092867546
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/bin/launchctl'
    CommandLine|contains|contains:
      - 'unload'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.yashma-ator-vietnamita
