title: Command and Scripting Interpreter (LINUX - auditd)
id: f57ce9b5-3f42-454c-a618-700d33d9a3a9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains:
      - '/var/run/haldrund.pid'
      - '/var/run/xinetd.lock'
      - '/var/run/kdevrund.pid'
    Image|endswith|contains:
      - '/capsh'
    CommandLine|contains|contains:
      - 'BEGIN {system'
    CommandLine|endswith|contains:
      - ' --'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
  - actor.stormous
