title: T1505.003 (LINUX - auditd)
id: 294335b3-188d-4b28-9617-346a79f9fb22
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.stormous
