title: Windows Service (LINUX - auditd)
id: a9b21e31-ef18-445e-9dff-b7c4ad86eecf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'mknod'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.stormous
