title: T1053 (M365 - entra_id)
id: b4ff380e-fc1b-4214-bd14-8468435d182e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1053/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053
  - actor.vect_raas
