title: Exfiltration Over Unencrypted Non-C2 Protocol (WINDOWS - security)
id: ad086a76-dd0b-48c8-9b80-15185049a05e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1048.003.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1048.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\svchost.exe'
    ParentCommandLine|contains|contains:
      - '-s WebClient'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1048.003
  - actor.ransomhub
