title: Account Manipulation (WINDOWS)
id: 27064825-b510-46a2-baf7-7f4536ed3847
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1098.
references:
  - https://attack.mitre.org/techniques/T1098/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1098
