title: Domain Account (WINDOWS - security)
id: eb50f6aa-1c81-4102-b7ad-fa45d02625ab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.ransomhub
