title: Windows File and Directory Permissions Modification (WINDOWS - security)
id: b666d03b-a986-4b20-a5fb-cb485466a7cc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1222.001.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1222.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectServer|contains:
      - 'DS'
    CommandLine|contains|all|contains:
      - '/f '
      - '/r'
    Image|endswith|contains:
      - '\takeown.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1222.001
  - actor.ransomhub
