title: Hide Artifacts (WINDOWS - security)
id: c2197ba7-66f7-461b-bf14-6c1136ff8086
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.ransomhub
