title: Shared Modules (LINUX - auditd)
id: 4d90931b-5c23-4994-ad89-ddb8dd7c58ac
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1129.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1129/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1129
  - actor.rhysida
