title: Phishing for Information (LINUX - auditd)
id: 29d80ce7-6967-4d4c-9088-6b694863bdcf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1598.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1598/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1598
  - actor.rhysida
