title: System Information Discovery - Qilin (entra_id)
id: dcb24778-6af0-4117-8fc0-ff494c891c8c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_virtual_machine_fingerprinting_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.qilin
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.args|contains: 'Manufacturer*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
