title: Encrypted Channel - AvosLocker (defender)
id: 958c38d2-a966-4dec-bb04-5adb3a684d12
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1573 (Encrypted Channel).
  Associated threat actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_encrypted_channel_freesslcert.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1573
  - actor.avoslocker
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    dns.question.name|contains:
      - '*letsencrypt.org'
      - '*.freessl.org'
    process.executable|contains:
      - 'C:\\Windows\\System32\\*.exe'
      - 'C:\\Windows\\notepad.exe'
    process.name|contains:
      - 'svchost.exe'
      - 'msedge.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
