title: Security Account Manager - Hunters International (sysmon)
id: 73fe593b-ce77-4620-878d-6b83ae117231
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.002 (Security Account Manager).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_copy_ntds_sam_volshadowcp_cmdline.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.002
  - actor.hunters_international
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'esentutl.exe'
    process.args|contains:
      - '*/y*'
      - '*/d*'
    process.pe.original_file_name|contains: 'esentutl.exe'
    process.command_line|contains:
      - '*\\ntds.dit*'
      - '*\\User Data\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
