title: Drive-by Compromise - Hunters International (workspace)
id: 24f00fe3-9a00-4041-9664-3e1f94b11457
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1189 (Drive-by Compromise).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_cross_site_scripting.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1189
  - actor.hunters_international
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    url.fragment|contains:
      - '<iframe*'
      - '*onmouseover=*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
