title: Valid Accounts (WINDOWS)
id: fb43b32e-ae05-46ff-9a1c-837f288ab195
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
