title: Credentials from Web Browsers (M365 - entra_id)
id: 8162b389-b4ea-4afb-a1ae-82a479a2d23f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.003.
  Threat Actor: Leafminer
references:
  - https://attack.mitre.org/techniques/T1555.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555.003
  - actor.leafminer
