title: Keylogging - Lynx (auditd)
id: 01a25be6-56b8-4581-875c-341fff390d85
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1056.001 (Keylogging).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1056/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_keylogging_with_pam_d.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1056.001
  - actor.lynx
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/etc/pam.d/system-auth'
      - '/etc/pam.d/password-auth'
      - 'TTY'
      - 'USER_TTY'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
