title: Video Capture - Lynx (auditd)
id: 9b5b1ea8-299d-43e6-af68-fb50703bbc8f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1125 (Video Capture).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/collection_potential_video_recording_or_screenshot_activity.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1125
  - actor.lynx
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    host.os.type|contains: 'linux'
    event.type|contains: 'start'
    event.action|contains: 'exec'
    process.name|contains: 'gnome-screenshot'
    process.args|contains: '-h'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
