title: Credentials In Files - Lynx (auditd)
id: 72d36af2-36e3-41c6-9d9f-11b7b14d4b7e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1552.001 (Credentials In Files).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1552/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_find_cred_in_files.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1552.001
  - actor.lynx
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'EXECVE'
      - 'grep'
      - 'password'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
