title: Local Account (M365 - entra_id)
id: d99fda41-8c7a-4f7e-a2db-78d0b68d4933
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.kimsuky
