title: Search Open Websites/Domains (M365 - entra_id)
id: 1d3e3ad0-fd67-4bea-92d4-d61d519f8687
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1593.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1593/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1593
  - actor.kimsuky
