title: Encrypted/Encoded File (MACOS - unified_logging)
id: 586adc18-2224-4d29-81c9-452a671b115f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.013.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1027.013/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.013
  - actor.global
