title: Network Service Discovery (MACOS - unified_logging)
id: 999015b2-82cf-47df-9e89-d9abe2949b84
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1046.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1046/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/nmap'
      - '/telnet'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1046
  - actor.global
