title: Default Accounts (MACOS - unified_logging)
id: 18845502-bb85-45e7-93f2-b9dd0e200a78
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.001.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1078.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/sysadminctl'
    CommandLine|contains|contains:
      - ' -d '
    CommandLine|contains|all|contains:
      - ' -guestAccount'
      - ' on'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078.001
  - actor.global
