title: Exploitation for Client Execution (MACOS - unified_logging)
id: 480c6605-064e-4709-8012-2a9247dc27a1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - 'com.apple.WebKit.WebContent'
      - 'firefox'
      - 'Google Chrome Helper'
    Image|endswith|contains:
      - '/bash'
      - '/curl'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
  - actor.global
