title: Query Registry - SafeLocker (entra_id)
id: 661107d7-a654-4996-8a08-d5c9f9b93650
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1012 (Query Registry).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1012/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_query_registry_via_reg.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1012
  - actor.safelocker
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.name|contains: 'reg.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
