title: Non-Application Layer Protocol - SafeLocker (entra_id)
id: ece3c100-89fa-4f55-9afc-25127b97b1f1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1095 (Non-Application Layer Protocol).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/command_and_control_connection_attempt_by_non_ssh_root_session.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1095
  - actor.safelocker
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.executable|contains:
      - '/bin/ssh'
      - '/usr/bin/sshpass'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
