title: DCSync - Ignoble Scorpius (security)
id: 00a546f5-c478-480e-af2b-0a200e54d15f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.006 (DCSync).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_ad_replication_non_machine_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.006
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4662'
    AccessMask|contains:
      - '0x100'
      - '1131f6aa-9c07-11d1-f79f-00c04fc2dcd2'
      - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
      - '89e95b76-444d-4c62-991a-0facbeda640c'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
