title: NTDS - Ignoble Scorpius (security)
id: 5d4d1fbc-e9d3-4f30-afe2-e3e58b3c34e8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.003 (NTDS).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.003
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5145'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$'
      - 'SYSTEM32\'
      - '.tmp'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
