title: LSASS Memory - Ignoble Scorpius (security)
id: defe551d-907b-4878-9257-078a73782fce
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.001 (LSASS Memory).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_lsass_access_non_system_account.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.001
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectType|contains: 'Process'
    ObjectName|contains: '\lsass.exe'
    SubjectUserName|contains:
      - '$'
      - ':\Program Files\'
      - ':\Program Files (x86)\'
    ProcessName|contains:
      - 'C:\Windows\System32\wbem\WmiPrvSE.exe'
      - '\SteamLibrary\steamapps\'
    AccessMask|contains: '0x1410'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
