title: Remote Desktop Protocol - Ignoble Scorpius (security)
id: d076f5d0-ef51-4f46-a98e-01f9ec5721bf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.001 (Remote Desktop Protocol).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1021/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_rdp_localhost_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.001
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains:
      - '10'
      - '::1'
      - '127.0.0.1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
