title: SMB/Windows Admin Shares - Ignoble Scorpius (security)
id: 6bdd888e-22fe-4a68-9194-11117c50d1d0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.002 (SMB/Windows Admin Shares).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_admin_share_access.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.002
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5140'
    ShareName|contains: 'Admin$'
    SubjectUserName|contains: '$'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
