title: Drive-by Compromise - Ignoble Scorpius (security)
id: 53c5ddf8-7c96-4e82-8f3e-55d340c0bf8e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1189 (Drive-by Compromise).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_cross_site_scripting.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1189
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    url.fragment|contains:
      - '<iframe*'
      - '*onmouseover=*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
