title: Kerberoasting - Ignoble Scorpius (security)
id: d4f89e7f-6181-4ec8-8258-4d79ed8f2620
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558.003 (Kerberoasting).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1558/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_kerberoasting_activity.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558.003
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4769'
    Status|contains: '0x0' # Translated as status from failure code field. Query only for successes'
    TicketEncryptionType|contains: '0x17' # RC4 ticket encryption type'
    TargetUserName|contains: '$@' # Ignore requests from machines'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
