title: Indicator Removal - DORRRA (sysmon)
id: 0e8c2004-89aa-487b-8ff7-cfe9e485811a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070 (Indicator Removal).
  Associated threat actor: DORRRA
references:
  - https://attack.mitre.org/techniques/T1070/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_deleting_websvr_access_logs.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070
  - actor.dorrra
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.path|contains:
      - 'C:\\inetpub\\logs\\LogFiles\\*.log'
      - '/var/www/*/logs/access.log'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
