title: Application Window Discovery (WINDOWS - security)
id: c4afddc2-b1d7-40e6-99e2-d0f53f2d6826
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1010.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1010
  - actor.yashma-ator-vietnamita
