title: Query Registry (WINDOWS - security)
id: 77d16cbb-2b15-4c61-bd71-0f82889ee537
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'Key'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.yashma-ator-vietnamita
