title: File Deletion (WINDOWS - security)
id: 17190ff0-1d11-4ec7-8d4f-832e2c84294e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.004.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1070.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
    CommandLine|contains|contains:
      - 'del '
      - 'erase '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.004
  - actor.yashma-ator-vietnamita
