title: Disable or Modify Tools (MACOS - unified_logging)
id: a56af7a5-d86c-4f88-b82a-6ba7ce1f1158
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains:
      - '/bin/launchctl'
    CommandLine|contains|contains:
      - 'unload'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.vect_raas
