title: Command and Scripting Interpreter (WINDOWS - sysmon)
id: 9ccc360b-9d91-4bc0-8a17-27f456fc52a4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.
  Threat Actor: APT37
references:
  - https://attack.mitre.org/techniques/T1059/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\csrss.exe'
      - '\ctfmon.exe'
      - '\dllhost.exe'
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '^^'
      - '^|^'
      - ',;,'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059
  - actor.apt37
