title: Valid Accounts (WINDOWS - security)
id: 4a3e1cb1-d37a-4bc1-90e9-b454239eec6f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Arkana
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.arkana
