title: LSASS Memory (WINDOWS - security)
id: f65b96e3-aedd-472d-83af-faedbaba0193
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.001.
  Threat Actor: APT1
references:
  - https://attack.mitre.org/techniques/T1003.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    AccessMask|contains:
      - '0x100000'
      - '0x1010'
      - '0x1400'
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
    ProcessName|endswith|contains:
      - '\lsass.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.001
  - actor.apt1
