title: AWS RDS Master Password Change
id: 3b4d90fa-e6c8-4e91-8dac-41e02eb795aa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1020.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1020/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_rds_change_master_password.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1020
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection_source:
          eventSource: rds.amazonaws.com
          responseElements.pendingModifiedValues.masterUserPassword|contains: '*'
          eventName: ModifyDBInstance
      condition: selection_source
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
