title: AWS IAM Successful Group Deletion
id: 0f930df1-0f93-4f93-af93-0f930df10000
status: stable
description: Detection rule for MITRE ATT&CK technique T1069.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_iam_successful_group_deletion.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1069.003
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # `cloudtrail` eventSource=iam.amazonaws.com eventName=DeleteGroup errorCode=success (userAgent!=*.amazonaws.com) 
    #   | rename user_name as user
    #   | stats count min(_time) as firstTime max(_time) as lastTime by signature dest user user_agent src vendor_account vendor_region vendor_product
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `aws_iam_successful_group_deletion_filter`
  condition: selection
level: medium
