title: ASL AWS IAM Successful Group Deletion
id: 2b3cc8a1-1429-4647-a000-54270da86f6c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1069/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_iam_successful_group_deletion.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1069.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation: 'DeleteGroup'
    status: 'Success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
