title: AWS Successful Console Login Without MFA
id: ea3d322f-cd9d-40fb-a54c-1348d1ef53cb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_console_login_success_without_mfa.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.004
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventName: 'ConsoleLogin'
          additionalEventData.MFAUsed: 'NO'
          responseElements.ConsoleLogin: 'Success'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
