title: Malicious Usage Of IMDS Credentials Outside Of AWS Infrastructure
id: 15830aac-4d6c-45ce-a50f-6754501f3fcb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_imds_malicious_usage.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          userIdentity.arn|re: '.+:assumed-role/aws:.+'
      filter_main_generic:
          - eventSource: 'ssm.amazonaws.com'
          - eventName: 'RegisterManagedInstance'
          - sourceIPAddress: 'AWS Internal'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
