title: AWS STS GetCallerIdentity Enumeration Via TruffleHog
id: e7589f80-c7eb-478d-a02e-d49f6d172ea9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1087/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_sts_getcalleridentity_trufflehog.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1087.004
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 'sts.amazonaws.com'
          eventName: 'GetCallerIdentity'
          userAgent|contains: 'TruffleHog'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
