title: AWS IAM Backdoor Users Keys
id: 201a767d-739d-43f1-92fa-78cb8040f15a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_iam_backdoor_users_keys.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection_source:
          eventSource: iam.amazonaws.com
          eventName: CreateAccessKey
      filter:
          userIdentity.arn|contains: responseElements.accessKey.userName
      condition: selection_source and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
