title: AWS High Number Of Failed Authentications For User
id: eeaf97e5-9e9f-4b1e-8b10-50de7eff17de
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_high_number_of_failed_authentications_for_user.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'ConsoleLogin'
    action: 'failure'
    span: '10m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
