title: AWS High Number Of Failed Authentications From Ip
id: 34cf027a-efbc-4144-a1dc-7ba4d05cac20
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/004/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_high_number_of_failed_authentications_from_ip.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.004
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'ConsoleLogin'
    action: 'failure'
    span: '10m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
