title: AWS Exfiltration via Anomalous GetObject API Activity
id: 1ae12bbe-7428-4fba-a088-63b0f2969c65
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1119.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_exfiltration_via_anomalous_getobject_api_activity.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1119
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'GetObject'
    span: '10m'
    action: 'annotate'
    probable_cause: '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
