title: AWS Credential Access RDS Password reset
id: 4021a3e7-4021-4021-a021-4021a3e70000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_credential_access_rds_password_reset.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1110.002
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # `cloudtrail` eventSource="rds.amazonaws.com" eventName=ModifyDBInstance "requestParameters.masterUserPassword"=*
    #   | rename user_name as user
    #   | stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.dBInstanceIdentifier) as database_id by signature dest user user_agent src vendor_account vendor_region vendor_product
    #   | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `aws_credential_access_rds_password_reset_filter`
  condition: selection
level: medium
