title: ASL AWS Credential Access RDS Password reset
id: 1f1d8ae5-bd31-4474-b121-70ad3deca4bd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_credential_access_rds_password_reset.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.002
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation:
      - 'ModifyDBInstance'
      - 'ModifyDBCluster'
    input: 'api.request.data'
    masterUserPassword: '*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
