title: AWS ElastiCache Security Group Created
id: 4a164333-9059-4b35-8161-5830bff14442
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1136/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_elasticache_security_group_created.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1136.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: elasticache.amazonaws.com
          eventName: 'CreateCacheSecurityGroup'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
