title: AWS Concurrent Sessions From Different Ips
id: 621da8e0-621d-421d-a21d-621da8e00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1185
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_concurrent_sessions_from_different_ips.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1185
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # `cloudtrail` eventName = DescribeEventAggregates src_ip!="AWS Internal" 
    #   | bin span=5m _time 
    #   | rename user_name as user
    #   | stats min(_time) as firstTime max(_time) as lastTime values(user_agent) as user_agent values(signature) as signature values(src) as src values(dest) as dest dc(src) as distinct_ip_count by _time user vendor_account vendor_region vendor_product
    #   | where distinct_ip_count > 1 
    #   |  `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
    #   | `aws_concurrent_sessions_from_different_ips_filter`
  condition: selection
level: medium
