title: Ingress/Egress Security Group Modification
id: e7193bed-3f64-4aa4-ac8c-7509fdad0fc2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1190.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_security_group_change_ingress_egress.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1190
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 'ec2.amazonaws.com'
          eventName:
              - 'AuthorizeSecurityGroupEgress'
              - 'AuthorizeSecurityGroupIngress'
              - 'RevokeSecurityGroupEgress'
              - 'RevokeSecurityGroupIngress'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
