title: AWS High Number Of Failed Authentications For User
id: e9cb55c8-d789-4741-894d-9eb248a2c620
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1201.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1201/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_high_number_of_failed_authentications_for_user.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1201
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'ConsoleLogin'
    action: 'failure'
    span: '10m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
