title: ASL AWS ECR Container Upload Outside Business Hours
id: cff471ec-5c0e-4a58-9f5d-ebb2012558cb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_ecr_container_upload_outside_business_hours.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation: 'PutImage'
    hour: 'strftime(time/pow(10,3),'
    weekday:
      - 'strftime(time/pow(10,3),'
      - 'Saturday'
      - 'Sunday'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
