title: AWS ECR Container Upload Outside Business Hours
id: 7c23615b-7c23-4c23-ac23-7c23615b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_ecr_container_upload_outside_business_hours.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1204
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # `cloudtrail` eventSource=ecr.amazonaws.com eventName=PutImage date_hour>=20
    #   OR date_hour<8 OR date_wday=saturday OR date_wday=sunday 
    #   | rename requestParameters.* as * 
    #   | rename repositoryName AS repository 
    #   | rename user_name as user
    #   | stats count min(_time) as firstTime max(_time) as lastTime by signature user user_agent src vendor_account vendor_region vendor_product repository 
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `aws_ecr_container_upload_outside_business_hours_filter`
  condition: selection
level: medium
