title: ASL AWS ECR Container Upload Outside Business Hours
id: 219f3669-6b99-4166-8003-14b770e6ce69
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1204.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1204/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_ecr_container_upload_outside_business_hours.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1204
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation: 'PutImage'
    hour: 'strftime(time/pow(10,3),'
    weekday:
      - 'strftime(time/pow(10,3),'
      - 'Saturday'
      - 'Sunday'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
