title: AWS ECR Container Scanning Findings High
id: 5d105238-5d10-4d10-ad10-5d1052380000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_ecr_container_scanning_findings_high.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1204.003
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # `cloudtrail` eventSource=ecr.amazonaws.com eventName=DescribeImageScanFindings
    #   | spath path=responseElements.imageScanFindings.findings{} output=findings 
    #   | mvexpand findings 
    #   | spath input=findings 
    #   | search severity=HIGH 
    #   | rename name as finding_name, description as finding_description, requestParameters.imageId.imageDigest as imageDigest, requestParameters.repositoryName as repository
    #   | rename user_name as user
    #   | stats count min(_time) as firstTime max(_time) as lastTime by signature dest user user_agent src vendor_account vendor_region vendor_product finding_name finding_description imageDigest repository
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `aws_ecr_container_scanning_findings_high_filter`
  condition: selection
level: medium
