title: AWS EC2 Disable EBS Encryption
id: 373ce3aa-184d-4f10-88d5-ed9cb44f4caa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1486.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_ec2_disable_encryption.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1486
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: ec2.amazonaws.com
          eventName: DisableEbsEncryptionByDefault
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
