title: AWS S3 Bucket Versioning Disable
id: f09ec646-d28d-45e3-a4c1-9b887dad0082
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1490.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_disable_bucket_versioning.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: s3.amazonaws.com
          eventName: PutBucketVersioning
          requestParameters|contains: 'Suspended'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
