title: AWS S3 Bucket Versioning Disable
id: 05011fb9-3aad-4b86-978a-6d184d9af1cd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1490.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_disable_bucket_versioning.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: s3.amazonaws.com
          eventName: PutBucketVersioning
          requestParameters|contains: 'Suspended'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
