title: AWS ECS Task Definition That Queries The Credential Endpoint
id: ba1ae110-19a9-4150-b4aa-e5dd91b13955
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1525.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1525/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_ecs_task_definition_cred_endpoint_query.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1525
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 'ecs.amazonaws.com'
          eventName:
              - 'DescribeTaskDefinition'
              - 'RegisterTaskDefinition'
              - 'RunTask'
          requestParameters.containerDefinitions.command|contains: '$AWS_CONTAINER_CREDENTIALS_RELATIVE_URI'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
