title: AWS Successful Console Authentication From Multiple IPs
id: 5e7de139-92c5-4b8b-99e3-a94dfad1537b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1535.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1535/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_successful_console_authentication_from_multiple_ips.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1535
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'ConsoleLogin'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
