title: AWS STS AssumeRole Misuse
id: 1143b1ac-41bf-4005-9527-68051881c20e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_sts_assumerole_misuse.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          userIdentity.type: AssumedRole
          userIdentity.sessionContext.sessionIssuer.type: Role
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
