title: ASL AWS Multi-Factor Authentication Disabled
id: 7b5464df-5df1-426a-9b00-6aed0c14bbd4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.006.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1556/006/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_multi_factor_authentication_disabled.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1556.006
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation:
      - 'DeleteVirtualMFADevice'
      - 'DeactivateMFADevice)'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
