title: AWS Identity Center Identity Provider Change
id: cb50ccf0-3afc-4dce-8b52-9fbecc6fb57d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1556/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_sso_idp_change.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1556
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource:
              - 'sso-directory.amazonaws.com'
              - 'sso.amazonaws.com'
          eventName:
              - 'AssociateDirectory'
              - 'DisableExternalIdPConfigurationForDirectory'
              - 'DisassociateDirectory'
              - 'EnableExternalIdPConfigurationForDirectory'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
