title: PUA - AWS TruffleHog Execution
id: 21b37cfa-d516-4ee3-8c24-48ce7eeb2493
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_pua_trufflehog.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          userAgent: 'TruffleHog'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
