title: ASL AWS Credential Access GetPasswordData
id: d7056c0e-3361-44fa-8587-806ddc790e8b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_credential_access_getpassworddata.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation: 'GetPasswordData'
    input: 'api.request.data'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
