title: New Network ACL Entry Added
id: 5dfad2a4-ce2d-4437-b4d7-dd5feb9fb223
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_new_acl_entries.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.007
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 'ec2.amazonaws.com'
          eventName: 'CreateNetworkAclEntry'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
