title: AWS CloudTrail Important Change
id: 007e9905-9c69-474f-a6aa-47a0c2c60f2c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.008.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/008/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_disable_logging.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.008
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection_source:
          eventSource: cloudtrail.amazonaws.com
          eventName:
              - StopLogging
              - UpdateTrail
              - DeleteTrail
      condition: selection_source
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
