title: AWS GuardDuty Detector Deleted Or Updated
id: e021bc9e-389d-44d2-a5ad-cd6509d8c2ac
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_cloudtrail_guardduty_detector_deleted_or_updated.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.001
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection_event_source:
          eventSource: 'guardduty.amazonaws.com'
      selection_action_delete:
          eventName: 'DeleteDetector'
      selection_action_update:
          eventName: 'UpdateDetector'
          requestParameters.enable: 'false'
      selection_status_success:
          errorCode: 'Success'
      selection_status_null:
          errorCode: null
      condition: selection_event_source and 1 of selection_action_* and 1 of selection_status_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
