title: Cloud Security Groups Modifications by User
id: d05c9594-4033-4ebe-97d3-905b24eaf146
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1578.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1578/005/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/cloud_security_groups_modifications_by_user.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1578.005
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    datamodel: 'Change'
    object_category: 'security_group'
    action:
      - 'modified'
      - 'deleted'
      - 'created)'
    span: '30m'
    upperBound: '(avg_changes+std_changes*3)'
    isOutlier:
      - 'if(unique_security_groups'
      - '1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
