title: AWS Successful Console Authentication From Multiple IPs
id: b6504327-7efe-480f-9954-1968158b8518
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_successful_console_authentication_from_multiple_ips.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventName: 'ConsoleLogin'
    span: '5m'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
