title: ASL AWS Credential Access GetPasswordData
id: 91dca86e-1f5c-4a33-b96d-8e572563d843
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_credential_access_getpassworddata.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    operation: 'GetPasswordData'
    input: 'api.request.data'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
