title: Potential Bucket Enumeration on AWS
id: 4c2e2e30-4e1e-49c9-a473-e4a07a8fc577
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1580.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1580/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_enum_buckets.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1580
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 's3.amazonaws.com'
          eventName: 'ListBuckets'
      filter:
          userIdentity.type: 'AssumedRole'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
