title: AWS Bedrock High Number List Foundation Model Failures
id: 68c66938-68c6-48c6-a8c6-68c669380000
status: stable
description: Detection rule for MITRE ATT&CK technique T1595
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_bedrock_high_number_list_foundation_model_failures.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1595
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    # Original splunk detection logic
    # -
    #   `cloudtrail` eventSource=bedrock.amazonaws.com eventName=ListFoundationModels errorCode=AccessDenied  | rename user_name as user 
    #   | stats count min(_time) as firstTime max(_time) as lastTime values(errorCode) as errorCodes values(errorMessage) as errorMessages by src user user_agent vendor_account vendor_product dest signature vendor_region
    #   | where count > 9
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)`
    #   | `aws_bedrock_high_number_list_foundation_model_failures_filter`
  condition: selection
level: medium
