title: AWS Bedrock High Number List Foundation Model Failures
id: a3eed714-c9fb-445c-a287-e0100295915a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1595/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/aws_bedrock_high_number_list_foundation_model_failures.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1595
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
  selection:
    eventSource: 'bedrock.amazonaws.com'
    eventName: 'ListFoundationModels'
    errorCode: 'AccessDenied'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
