title: AWS KMS Imported Key Material Usage
id: db8a2122-c2d3-4d48-8945-93812de7aa6f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1608.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1608/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_kms_import_key_material.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1608.003
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 'kms.amazonaws.com'
          eventName:
              - 'ImportKeyMaterial'
              - 'DeleteImportedKeyMaterial'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
