title: Potential Bucket Enumeration on AWS
id: 5499344a-7bc5-4243-8a0a-70673bdb4e6c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1619.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1619/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_enum_buckets.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1619
logsource:
  product: aws
  service: cloudtrail
  category: cloud_audit
detection:
      selection:
          eventSource: 's3.amazonaws.com'
          eventName: 'ListBuckets'
      filter:
          userIdentity.type: 'AssumedRole'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
