title: Screen Capture - BQTLock (sysmon)
id: 11815806-5de6-434a-8f13-e07af2b0d8d6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_screen_grabber.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.bqtlock
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
