title: Malicious File (WINDOWS - sysmon)
id: 93bd51eb-1bd0-4e2d-b29a-f996a863c632
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.002.
  Threat Actor: Indrik Spider
references:
  - https://attack.mitre.org/techniques/T1204.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'cod.msc'
      - 'fdp.msc'
      - 'ftr.msc'
    Image|endswith|contains:
      - '\AppVLP.exe'
      - '\bash.exe'
      - '\cmd.exe'
    OriginalFileName|contains:
      - 'popupwrapper.exe'
    ParentImage|endswith|contains:
      - '\OUTLOOK.EXE'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.002
  - actor.indrik_spider
