title: Hijack Execution Flow (LINUX)
id: 912a2900-681e-4291-ab86-8ef5de3e7083
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.
references:
  - https://attack.mitre.org/techniques/T1574/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574
