title: Phishing (MACOS - unified_logging)
id: 3c6fe7d4-7f21-4d8b-ae67-256a23451353
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.nitrogen
