title: Malicious Link - Lynx (defender)
id: 814e2aba-ab42-4a56-a03c-a67c94e294a4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1204.001 (Malicious Link).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1204/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_clickfix_filefix_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1204.001
  - actor.lynx
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessParentFileName|contains: '\explorer.exe'
    ProcessCommandLine|contains:
      - '#'
      - 'account'
      - 'anti-bot'
      - 'botcheck'
      - 'captcha'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
