title: T1068 (GOOGLE - workspace)
id: 883285f4-8ad8-4e5b-aa29-c19c81a0cb42
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1068.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1068/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1068
  - actor.akira
