title: Process Hollowing - LockBit (security)
id: e4d2c192-ea06-43d0-83fc-a39c5bcbd893
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1055.012 (Process Hollowing).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1055/012/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/privilege_escalation_unusual_parentchild_relationship.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1055.012
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'mscorsvw.exe'
      - 'WerFaultSecure.exe'
    process.parent.name|contains: 'conhost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
