title: Default Accounts - LockBit (security)
id: 2c456a8d-7040-415c-8d83-030e61f43727
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '10'
    AuthenticationPackageName|contains: 'Negotiate'
    TargetUserName|contains: 'Admin'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
