title: Local Accounts - LockBit (security)
id: 27702a2f-6678-454a-9e04-919ac7745b0f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.003 (Local Accounts).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1078/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.003
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '10'
    AuthenticationPackageName|contains: 'Negotiate'
    TargetUserName|contains: 'Admin'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
