title: Local Account - LockBit (security)
id: af8f93e8-090c-4513-b144-674bc8bda641
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.001 (Local Account).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_admin_recon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.001
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'wmic.exe'
    process.parent.name|contains: 'net.exe'
    process.args|contains:
      - 'group'
      - 'useraccount'
    user.id|contains:
      - 'S-1-5-18'
      - 'S-1-5-20'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
