title: Token Impersonation/Theft - LockBit (security)
id: a5d9d7fe-3c3b-4425-8685-6b3226bb2805
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134.001 (Token Impersonation/Theft).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1134/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_access_token_abuse.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134.001
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '9'
    LogonProcessName|contains: 'Advapi'
    AuthenticationPackageName|contains: 'Negotiate'
    ImpersonationLevel|contains: '%%1833' # Impersonation'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
