title: Drive-by Compromise - LockBit (security)
id: b87bb1cc-0dcc-4ddc-8978-5cb38860e6e1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1189 (Drive-by Compromise).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_cross_site_scripting.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1189
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    url.fragment|contains:
      - '<iframe*'
      - '*onmouseover=*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
