title: Internal Defacement - LockBit (security)
id: e40640be-855c-47de-b69e-ee22c6499919
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1491.001 (Internal Defacement).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1491/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_reg_desktop_background_change.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1491.001
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - 'add'
      - 'Control Panel\Desktop'
      - 'CurrentVersion\Policies\ActiveDesktop'
      - 'CurrentVersion\Policies\System'
      - '/v NoChangingWallpaper'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
