title: Indicator Blocking - LockBit (security)
id: 88aef9d3-3ab2-4a13-bf4d-f18136b303d6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.006 (Indicator Blocking).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1562/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_audit_policy_disabled_winlog.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.006
  - actor.lockbit
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    event.code|contains: '4719'
    host.os.type|contains: 'windows'
    winlog.event_data.AuditPolicyChangesDescription|contains: 'Success removed'
    winlog.event_data.SubCategory|contains: 'Logon'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
