title: File and Directory Discovery - Yashma-Ator-Vietnamita (unified_logging)
id: 199d87bc-9519-474f-9f8c-ff7508bafd42
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_file_dir_discovery.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.yashma-ator-vietnamita
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains: 'tree.com'
    process.args|contains: 'dir'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
