title: Web Protocols (WINDOWS - security)
id: 7dab0412-e549-4054-bdf0-76c2d0e1763b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.001.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1071.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.exe tunnel'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|contains|contains:
      - '\servers\Stable-'
    ParentImage|endswith|contains:
      - '\server\node.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071.001
  - actor.vice_society
