title: Account Discovery (WINDOWS - security)
id: b32ce604-e5a7-4232-9ce2-2fdb6cfe0b6f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1087/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Workstation|contains:
      - 'RULER'
    CommandLine|contains|contains:
      - ' applicationsinfo'
      - ' browserinfo'
      - ' eventsinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087
  - actor.vice_society
