title: Exploit Public-Facing Application (WINDOWS - security)
id: 6946022b-295c-4c36-9d65-84a7335258fc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
    ParentImage|endswith|contains:
      - '\ScreenConnect.Service.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\csc.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.vice_society
