title: Screen Capture - Vect RaaS (defender)
id: c6a9e532-74bb-419b-9845-2d8b1620c885
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_screen_grabber.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.vect_raas
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
