title: Account Manipulation (GOOGLE - workspace)
id: 070b821e-f724-4f1a-88fa-f8c83796de69
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1098.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1098/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1098
  - actor.lockbit
