title: Group Policy Modification (GOOGLE - workspace)
id: 75a54c65-a1bd-4c1e-b0b4-5a90913f8556
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.lockbit
