title: SMB/Windows Admin Shares - Cl0p (unified_logging)
id: f3e5e524-eb40-4563-baa6-05413c76361e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.002 (SMB/Windows Admin Shares).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1021/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/lateral_movement_mounting_smb_share.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.002
  - actor.cl0p
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line|contains: 'osascript*mount volume*smb://*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
