title: LSA Secrets (WINDOWS - security)
id: cccae5d4-dc39-47a3-b89b-eadd0a7e1314
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: MuddyWater
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.muddywater
