title: Cached Domain Credentials - INC Ransom (defender)
id: 8b5d98bf-368f-422f-8728-3363280982c3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.005 (Cached Domain Credentials).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1003/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_creddumper.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.005
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
      - 'gsecdump'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
