title: Match Legitimate Resource Name or Location - INC Ransom (defender)
id: 8ad56f06-549a-4151-8a72-bb17fde4c264
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1036.005 (Match Legitimate Resource Name or Location).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1036/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_communication_apps_suspicious_child_process.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1036.005
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'thunderbird.exe'
    process.executable|contains:
      - '?:\\Windows\\splwow64.exe'
      - '?:\\Windows\\System32\\spool\\drivers\\x64\\3\\*.EXE'
    process.code_signature.subject_name|contains: 'Mozilla Corporation'
    process.name|contains: 'cmd.exe'
    process.command_line|contains: 'C:\\Windows\\system32\\cmd.exe /d /s /c \'
    process.args|contains:
      - 'C:\\WINDOWS/System32/nvidia-smi.exe'
      - 'C:\\Windows\\System32\\DriverStore\\FileRepository/*/nvidia-smi.exe*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
