title: Scheduled Task/Job - INC Ransom (defender)
id: 83ebbd1d-300a-4d71-b058-49662e697471
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053 (Scheduled Task/Job).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_cron_jobs_creation_and_runtime.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.args|contains: '-l'
    process.name|contains: 'running job'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
