title: Shared Modules - INC Ransom (defender)
id: ac31ff33-62cc-4cbb-986d-160507cd4c4b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1129 (Shared Modules).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1129/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_shared_modules_local_sxs_dll.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1129
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.extension|contains: 'dll'
    file.path|contains: 'C:\\*\\*.exe.local\\*.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
