title: Video Capture - INC Ransom (defender)
id: 7fdbccb1-a106-4a86-af72-cfc632cd3607
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1125 (Video Capture).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_webcam_video_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1125
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'NewFrameEventHandler'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
