title: Rundll32 - INC Ransom (defender)
id: 831f697e-7901-4f57-b797-3dfc6d5783a6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.011 (Rundll32).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_cmdline_dump_tool.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.011
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.pe.original_file_name|contains: 'diskshadow.exe'
    process.name|contains: 'diskshadow.exe'
    process.args|contains: '/s'
    process.command_line|contains: '*comsvcs*#*24*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
