title: Exploitation of Remote Services - INC Ransom (defender)
id: 34bc1a61-6079-4bcb-ac77-08e33471a85c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1210 (Exploitation of Remote Services).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1210/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/lateral_movement_malicious_remote_file_creation.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1210
  - actor.inc_ransom
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'System'
      - 'sftp-server'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
