title: Active Scanning (WINDOWS - security)
id: f45704f0-0254-4116-aa44-2540f1089a4a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.stormous
