title: Kerberoasting (WINDOWS - security)
id: bb8764ee-6617-4607-9db3-578e9aa0a781
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1558.003.
  Threat Actor: Cuba
references:
  - https://attack.mitre.org/techniques/T1558.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Status|contains:
      - '0x0'
    LogonProcessName|contains:
      - 'User32LogonProcesss'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1558.003
  - actor.cuba
