title: NTDS - LockBit (sysmon)
id: 1e4ac5c1-c339-4924-8166-9323632d2464
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.003 (NTDS).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_cmdline_dump_tool.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.003
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.pe.original_file_name|contains: 'diskshadow.exe'
    process.name|contains: 'diskshadow.exe'
    process.args|contains: '/s'
    process.command_line|contains: '*comsvcs*#*24*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
