title: Default Accounts - LockBit (sysmon)
id: 4207f253-e6bd-4ed4-b649-50212ba23d38
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.001 (Default Accounts).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1078/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/kubernetes/initial_access_anonymous_request_authorized.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.001
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    kubernetes.audit.user.username|contains: 'system:anonymous'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
