title: Valid Accounts - LockBit (sysmon)
id: 645ae923-24af-40bf-86ad-13957300eadb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078 (Valid Accounts).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_login_failures.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.action|contains: 'failed-log-in-too-many-times-to'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
