title: Password Spraying - LockBit (sysmon)
id: c63d347b-141e-4233-8ac3-bab56b52b92f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1110.003 (Password Spraying).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1110.003
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
