title: Network Share Discovery - LockBit (sysmon)
id: 9c5dfbb4-99b7-4690-80e3-7d0898b23973
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1135 (Network Share Discovery).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_posh_invoke_sharefinder.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1135
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Invoke-ShareFinder'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
