title: Domain Trust Discovery - LockBit (sysmon)
id: 2bac4a53-4193-4095-bd82-9be1a8773e11
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1482 (Domain Trust Discovery).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1482/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_ad_explorer_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1482
  - actor.lockbit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'ADExplorer*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
