title: OS Credential Dumping - RansomHub (defender)
id: 71b50390-583c-46cf-a180-4e557b2b0e19
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/credential_access_gitleaks_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.ransomhub
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'gitleaks.exe'
      - 'gitleaks'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
