title: Exfiltration Over Unencrypted Non-C2 Protocol - RansomHub (defender)
id: 4ef555be-d9fb-4853-870b-85a1913f3871
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1048.003 (Exfiltration Over Unencrypted Non-C2 Protocol).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_webdav_client_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1048.003
  - actor.ransomhub
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessParentFileName|contains: '\svchost.exe'
    ProcessCommandLine|contains: 'C:\windows\system32\davclnt.dll,DavSetCookie'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
