title: Domain Account - RansomHub (defender)
id: 6f5f756d-9387-428b-8155-eeb0897a598b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1087.002 (Domain Account).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1087/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_ad_explorer_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1087.002
  - actor.ransomhub
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'ADExplorer*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
