title: System Shutdown/Reboot - RansomHub (defender)
id: c182d8f9-ee7f-46c6-a1b0-20ad25f23f0d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1529 (System Shutdown/Reboot).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1529
  - actor.ransomhub
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName|contains:
      - '\shutdown.exe'
      - '/r '
      - '/s '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
