title: Hide Artifacts - RansomHub (defender)
id: 97b3fff1-402c-4552-9a10-2f357e6c4580
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564 (Hide Artifacts).
  Associated threat actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/defense_evasion_exchange_new_inbox_rule_delete_or_move.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564
  - actor.ransomhub
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'o365.audit'
    event.action|contains: 'New-InboxRule'
    event.outcome|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
