title: Access Token Manipulation (WINDOWS - defender)
id: c4dc3b3c-0497-4610-91e0-2194338d4297
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.lynx
