title: Valid Accounts (WINDOWS - sysmon)
id: 4a1c462d-ae1d-45b3-a8ee-2d76f68b41c0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' use '
      - ':*\\'
      - '/USER:* *'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.safelocker
