title: Indirect Command Execution (WINDOWS)
id: 19236888-cf75-4c98-8b59-b587a49620ae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1202.
references:
  - https://attack.mitre.org/techniques/T1202/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'powershell.exe'
      - 'pwsh.exe'
      - 'cmd.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1202
