title: Credentials In Files (WINDOWS - sysmon)
id: 0b64c98b-eb0a-4d31-a51e-aa7c118c7710
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.001.
  Threat Actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1552.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -s '
    CommandLine|contains|contains:
      - 'Offline_Winpwn'
      - 'WinPwn '
      - 'WinPwn.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.001
  - actor.safelocker
