title: Windows Management Instrumentation (M365)
id: 1611668a-c9a1-4878-8447-41dd51fb4d73
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1047.
references:
  - https://attack.mitre.org/techniques/T1047/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1047
