title: T1071 (M365 - entra_id)
id: 17579b81-434c-46ee-935d-566d1406e7d7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.lynx
