title: T1562.001 (M365 - entra_id)
id: 7483aa9c-622e-4b60-b319-84518d852be5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.lynx
