title: Private Keys - BianLian (entra_id)
id: 1858a6fa-63f8-49d1-bd25-7e4f81155f58
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1552.004 (Private Keys).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1552/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/credential_access_google_workspace_drive_encryption_key_accessed_by_anonymous_user.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1552.004
  - actor.bianlian
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    event.action|contains:
      - 'copy'
      - 'download'
    google_workspace.drive.visibility|contains: 'people_with_link'
    file.extension|contains:
      - 'token'
      - 'ps2xml'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
