title: Kubernetes Access Scanning
id: 780792f5-7807-4807-a807-780792f50000
status: stable
description: Detection rule for MITRE ATT&CK technique T1046
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/kubernetes_access_scanning.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1046
logsource:
  product: cloud
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `kube_audit` "user.groups{}"="system:unauthenticated" "responseStatus.code"=403
    #   | iplocation sourceIPs{} | stats count values(userAgent) as userAgent values(user.username)
    #   as user.username values(user.groups{}) as user.groups{} values(verb) as verb values(requestURI)
    #   as requestURI values(responseStatus.code) as responseStatus.code values(responseStatus.message)
    #   as responseStatus.message values(responseStatus.reason) as responseStatus.reason
    #   values(responseStatus.status) as responseStatus.status by sourceIPs{} Country City
    #   | where count > 5 | rename sourceIPs{} as src_ip, user.username as user | `kubernetes_access_scanning_filter`
  condition: selection
level: medium
