title: Kubernetes Cron Job Creation
id: 264de8e9-264d-464d-a64d-264de8e90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1053.007
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/kubernetes_cron_job_creation.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1053.007
logsource:
  product: cloud
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `kube_audit` verb=create "objectRef.resource"=cronjobs | fillnull | stats
    #   count values(user.groups{}) as user_groups by kind objectRef.name objectRef.namespace
    #   objectRef.resource requestObject.kind requestObject.spec.schedule requestObject.spec.jobTemplate.spec.template.spec.containers{}.image
    #   responseStatus.code sourceIPs{} stage user.username userAgent verb | rename sourceIPs{}
    #   as src_ip, user.username as user | `kubernetes_cron_job_creation_filter`
  condition: selection
level: medium
