title: Kubernetes Create or Update Privileged Pod
id: 313f1808-313f-413f-a13f-313f18080000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/kubernetes_create_or_update_privileged_pod.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1204
logsource:
  product: cloud
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `kube_audit` objectRef.resource=pods verb=create OR verb=update requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration=*\"privileged\":true*
    #   | fillnull | stats count values(user.groups{}) as user_groups by kind objectRef.name
    #   objectRef.namespace objectRef.resource requestObject.kind responseStatus.code sourceIPs{}
    #   stage user.username userAgent verb requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration
    #   | rename sourceIPs{} as src_ip, user.username as user | `kubernetes_create_or_update_privileged_pod_filter`
  condition: selection
level: medium
