title: Risk Rule for Dev Sec Ops by Repository
id: 4e4fa9c6-4e4f-4e4f-ae4f-4e4fa9c60000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/risk_rule_for_dev_sec_ops_by_repository.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1204.003
logsource:
  product: cloud
  service: general
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
    #   as lastTime sum(All_Risk.calculated_risk_score) as sum_risk_score, values(All_Risk.annotations.mitre_attack.mitre_tactic)
    #   as annotations.mitre_attack.mitre_tactic, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
    #   as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
    #   as mitre_technique_id_count values(source) as source, dc(source) as source_count
    #   from datamodel=Risk.All_Risk where All_Risk.analyticstories="Dev Sec Ops" All_Risk.risk_object_type
    #   = "other" by All_Risk.risk_object All_Risk.risk_object_type All_Risk.annotations.mitre_attack.mitre_tactic
    #   | `drop_dm_object_name(All_Risk)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | where source_count > 3 and sum_risk_score > 100 | `risk_rule_for_dev_sec_ops_by_repository_filter`
  condition: selection
level: medium
