title: Circle CI Disable Security Job
id: 097751b9-0977-4977-a977-097751b90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1554
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/circle_ci_disable_security_job.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1554
logsource:
  product: cloud
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `circleci` | rename vcs.committer_name as user vcs.subject as commit_message
    #   vcs.url as url workflows.* as *  | stats values(job_name) as job_names by workflow_id
    #   workflow_name user commit_message url branch | lookup mandatory_job_for_workflow
    #   workflow_name OUTPUTNEW job_name AS mandatory_job | search mandatory_job=* | eval
    #   mandatory_job_executed=if(like(job_names, "%".mandatory_job."%"), 1, 0) | where
    #   mandatory_job_executed=0 | eval phase="build" | rex field=url "(?<repository>[^\/]*\/[^\/]*)$"
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `circle_ci_disable_security_job_filter`
  condition: selection
level: medium
