title: Thread Execution Hijacking (LINUX)
id: 2218c8ee-7315-4cb3-9b42-e81fdde6d66f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.003.
references:
  - https://attack.mitre.org/techniques/T1055.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.003
