title: DLL (GOOGLE - workspace)
id: 60043a1c-176a-44c8-8f3e-db6b2bf5aa11
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: APT3
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.apt3
