title: Data Destruction (WINDOWS - sysmon)
id: 093d80b9-9778-4806-8716-034011126ea8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1485.
  Threat Actor: Trigona
references:
  - https://attack.mitre.org/techniques/T1485/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'deletejournal'
      - 'createjournal'
      - 'setZeroData'
    OriginalFileName|contains:
      - 'sdelete.exe'
    Image|endswith|contains:
      - '\sdelete.exe'
      - '\sdelete64.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1485
  - actor.trigona
