title: Windows Management Instrumentation - BlackSuit (sysmon)
id: 81ef62b2-e1c1-4ab1-9409-e201285b0479
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1047 (Windows Management Instrumentation).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1047/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_suspicious_wmi_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1047
  - actor.blacksuit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'WMIC.exe'
    process.pe.original_file_name|contains: 'wmic.exe'
    process.args|contains:
      - 'format*:*'
      - '*-format*:*'
    process.command_line|contains:
      - '* /format:table *'
      - '* /format:table'
    event.action|contains: 'Image loaded*'
    dll.name|contains:
      - 'jscript.dll'
      - 'vbscript.dll'
    file.name|contains:
      - 'jscript.dll'
      - 'vbscript.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
