title: Kerberoasting - BlackSuit (sysmon)
id: 171c299d-c53d-41d1-8283-86f489aba0a5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558.003 (Kerberoasting).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1558/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_posh_request_ticket.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558.003
  - actor.blacksuit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
