title: Steal or Forge Kerberos Tickets - BlackSuit (sysmon)
id: 45d2e01d-88f4-43b0-9fec-d613a037267a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558 (Steal or Forge Kerberos Tickets).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1558/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558
  - actor.blacksuit
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
