title: Dynamic-link Library Injection (WINDOWS - security)
id: e36c0dd8-2ca7-4509-ace9-e9073e1fdd90
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.001.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1055.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' /d '
      - ' /c '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.001
  - actor.cl0p
