title: Exploitation for Privilege Escalation (WINDOWS - security)
id: 55e1ec98-b3f6-47f6-9109-4faa56988ffc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1068.
  Threat Actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1068/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SysmonEOP.exe'
    Hashes|contains|contains:
      - 'IMPHASH=22F4089EB8ABA31E1BB162C6D9BF72E5'
      - 'IMPHASH=5123FA4C4384D431CD0D893EEB49BBEC'
    ParentImage|endswith|contains:
      - '\spoolsv.exe'
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1068
  - actor.cl0p
