title: Office Test (GOOGLE - workspace)
id: 9af444ab-af52-49d5-b128-c76e6b286821
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1137.002.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1137.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1137.002
  - actor.apt28
