title: Group Policy Modification (GOOGLE - workspace)
id: c2dffaef-7095-43c7-a8db-2040e62790b6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.play
