title: Browser Information Discovery (WINDOWS - security)
id: 6557d2a9-126b-4b05-9f57-1c9ec1910232
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1217.
  Threat Actor: APT38
references:
  - https://attack.mitre.org/techniques/T1217/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - 'dir*-s'
    CommandLine|contains|contains:
      - 'places.sqlite'
      - 'cookies.sqlite'
      - 'formhistory.sqlite'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1217
  - actor.apt38
