title: Software Deployment Tools (WINDOWS - sysmon)
id: 67350c47-0939-434c-8132-57b2d0d04c08
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.medusa
