title: Hide Artifacts - Ignoble Scorpius (unified_logging)
id: 62655f7e-1a0a-45c6-a853-4972afc36349
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564 (Hide Artifacts).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/defense_evasion_exchange_new_inbox_rule_delete_or_move.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564
  - actor.ignoble_scorpius
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'o365.audit'
    event.action|contains: 'New-InboxRule'
    event.outcome|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
