title: Cloud Accounts - Chaos (defender)
id: 4904fbd3-bbd9-4151-9720-41241ba5fe9a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078.004 (Cloud Accounts).
  Associated threat actor: Chaos
references:
  - https://attack.mitre.org/techniques/T1078/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/defense_evasion_google_workspace_new_oauth_login_from_third_party_application.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078.004
  - actor.chaos
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'google_workspace.token'
    event.action|contains: 'authorize'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
