title: Brute Force (LINUX - auditd)
id: f9ce9ac1-6eee-4c19-8c62-3f3e86d7140e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1110.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1110/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1110
  - actor.global
