title: Exploitation for Client Execution (LINUX - auditd)
id: b8b95c55-f6b7-48c4-822e-a042d891250c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/tmp/'
      - '/dev/shm/'
    User|contains:
      - 'root'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
  - actor.global
