title: System Information Discovery - Shinra (unified_logging)
id: cc2645b3-1e12-47bb-9993-4dd107036cca
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_virtual_machine_fingerprinting_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.shinra
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.args|contains: 'Manufacturer*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
