title: Inhibit System Recovery - Shinra (unified_logging)
id: 5502023e-47ca-4ee9-af84-3eadc0e82e90
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1490 (Inhibit System Recovery).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_tmutil_delete_backup.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1490
  - actor.shinra
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    CommandLine|contains: 'delete'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
