title: LSA Secrets (WINDOWS)
id: b1578a7f-48b8-4f3b-8101-e49dfdd15510
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
