title: Steganography (WINDOWS - sysmon)
id: 6cfd62a5-e5bb-4e47-a0bd-209f4d4074de
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.brain_cipher
