title: Windows Command Shell (WINDOWS)
id: 2e3be531-f72a-4959-abb9-8870c3d6f530
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.003.
references:
  - https://attack.mitre.org/techniques/T1059.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'powershell.exe'
      - 'pwsh.exe'
      - 'cmd.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.003
