title: Application Layer Protocol (WINDOWS - sysmon)
id: 70f1320b-77c4-4e2e-8fc5-f8f5a07c0279
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.brain_cipher
