title: Mshta (WINDOWS - sysmon)
id: d29673bf-89aa-45b6-ad82-6e7a2a66f033
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.005.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1218.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\cscript.exe'
      - '\excel.exe'
      - '\mshta.exe'
    CommandLine|contains|contains:
      - 'javascript'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.005
  - actor.brain_cipher
