title: Web Shell - Stormous (security)
id: 9ed3ea3c-aaeb-403d-a979-636002c684d3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505.003 (Web Shell).
  Associated threat actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_shell_activity_by_web_server.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505.003
  - actor.stormous
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'apache'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
