title: eb062747-2193-45de-8fa2-e62549c37ddf (WINDOWS)
id: 41dfddd2-807d-4b48-aa53-ebb260babcb5
description: >
  Detects techniques consistent with MITRE ATT&CK technique eb062747-2193-45de-8fa2-e62549c37ddf.
references:
  - https://attack.mitre.org/techniques/eb062747-2193-45de-8fa2-e62549c37ddf/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.eb062747-2193-45de-8fa2-e62549c37ddf
