title: Clear Windows Event Logs (WINDOWS - security)
id: bf9d161d-f561-41bc-9ad4-b41c4f4cbb05
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
  Threat Actor: FIN8
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Provider_Name|contains:
      - 'Security'
    CommandLine|contains|contains:
      - 'clear-log '
      - ' cl '
      - 'set-log '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
  - actor.fin8
