title: Malicious File (WINDOWS - defender)
id: a5730de9-24f2-4681-bb8c-977e3f8e28a6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.002.
  Threat Actor: Tropic Trooper
references:
  - https://attack.mitre.org/techniques/T1204.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'cod.msc'
      - 'fdp.msc'
      - 'ftr.msc'
    Image|endswith|contains:
      - '\AppVLP.exe'
      - '\bash.exe'
      - '\cmd.exe'
    OriginalFileName|contains:
      - 'popupwrapper.exe'
    ParentImage|endswith|contains:
      - '\OUTLOOK.EXE'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.002
  - actor.tropic_trooper
