title: Exfiltration Over C2 Channel (GOOGLE - workspace)
id: 8a186ace-ff8d-41c5-9627-a11814eec5ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1041.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1041/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1041
  - actor.wizard_spider
