title: Automated Collection (GOOGLE - workspace)
id: 3ee9ef4e-c219-4243-a120-a2970875e4e3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1119.
  Threat Actor: Sidewinder
references:
  - https://attack.mitre.org/techniques/T1119/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    event|contains: action
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1119
  - actor.sidewinder
