title: Remote Desktop Protocol - Medusa (security)
id: e894cb9b-2f46-493e-8667-70d2998add70
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1021.001 (Remote Desktop Protocol).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1021/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_rdp_localhost_login.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1021.001
  - actor.medusa
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains:
      - '10'
      - '::1'
      - '127.0.0.1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
