title: Impair Defenses - Medusa (security)
id: 3ac8e1d3-54d2-440d-8a21-1f76534a8769
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562 (Impair Defenses).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1562/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/object_access/win_security_wfp_endpoint_agent_blocked.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562
  - actor.medusa
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5157'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
