title: LSA Secrets (WINDOWS - security)
id: 499ddc4d-b919-4ecc-9a86-4aae11605120
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: Threat Group-3390
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.threat_group-3390
