title: Security Account Manager (WINDOWS - security)
id: a175c611-8fc0-4250-9c64-c8f79554379e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.002.
  Threat Actor: Threat Group-3390
references:
  - https://attack.mitre.org/techniques/T1003.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.002
  - actor.threat_group-3390
