title: File Deletion (WINDOWS - security)
id: 1dbc82a8-b5b3-456e-be6c-15b43034eefa
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.004.
  Threat Actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1070.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
    CommandLine|contains|contains:
      - 'del '
      - 'erase '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.004
  - actor.interlock
