title: Kerberoasting (WINDOWS - security)
id: 0c78db20-640f-4c1d-b6c6-135ef00d0698
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1558.003.
  Threat Actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1558.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Status|contains:
      - '0x0'
    LogonProcessName|contains:
      - 'User32LogonProcesss'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1558.003
  - actor.interlock
