title: Credentials from Web Browsers (WINDOWS)
id: 38b1a47e-2a55-4fe0-8072-8968a2dca045
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.003.
references:
  - https://attack.mitre.org/techniques/T1555.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555.003
