title: Automated Collection - Vice Society (sysmon)
id: 8bbedeca-1917-4ed0-a6a1-f15f95e5a13e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1119 (Automated Collection).
  Associated threat actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1119
  - actor.vice_society
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    OriginalFileName|contains:
      - 'FINDSTR.EXE'
      - ' /e '
      - ' /si '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
