title: Software Deployment Tools (WINDOWS - security)
id: 985eccf7-cd9b-4ba5-a4ca-037f101eed34
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.hive
