title: T1204 (WINDOWS - security)
id: e2b56586-344e-4589-baf4-256b5f7240e1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1204/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    NewProcessName|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    CommandLine|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204
  - actor.hive
