title: Lateral Tool Transfer (WINDOWS - security)
id: 0e552afe-22a7-4adb-90d0-f2d1aa0f94ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|re|contains:
      - '^%systemroot%\\[a-zA-Z]{8}\.exe$'
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.hive
