title: Obfuscated Files or Information (WINDOWS - defender)
id: 2f09edfb-dc06-4e5e-88d6-888d8813a1d2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1027/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-decode '
      - '-decodehex '
    CommandLine|contains|contains:
      - 'urlcache '
      - 'verifyctl '
      - 'URL '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027
  - actor.medusa
