title: File and Directory Discovery (WINDOWS - defender)
id: 38716e08-96bb-46fc-a8ec-78f25c016e44
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.medusa
