title: Active Scanning (WINDOWS - security)
id: 64b7f657-2698-4bd0-a167-1d4554da7df3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: WannaCry
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.wannacry
