title: Spearphishing Link - Brain Cipher (workspace)
id: 3cd6921e-273c-40ed-b5f5-54d5fbb05a79
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.002 (Spearphishing Link).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.002
  - actor.brain_cipher
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
