title: Remote Services (WINDOWS - defender)
id: a9fb4bf3-5f15-48ad-93f5-99d5609342c0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.
  Threat Actor: GLOBAL
references:
  - https://attack.mitre.org/techniques/T1021/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'echo'
      - '>'
      - '\\\\.\\pipe\\'
    CommandLine|contains|contains:
      - ' -L '
      - ' -P '
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021
  - actor.global
