title: Hidden Window (M365 - entra_id)
id: 34701065-39b4-4e13-9492-ce555e858558
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.003.
  Threat Actor: Higaisa
references:
  - https://attack.mitre.org/techniques/T1564.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.003
  - actor.higaisa
