title: Local Account (LINUX - auditd)
id: b82a4ce1-472a-4805-90e4-e3edc5729a50
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|endswith|contains:
      - '/useradd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.dragonfly
