title: Malicious File (MACOS - unified_logging)
id: 4da507bd-5a2a-4c34-a623-5a13575951a4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.002.
  Threat Actor: Inception
references:
  - https://attack.mitre.org/techniques/T1204.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - 'Microsoft Word'
      - 'Microsoft Excel'
      - 'Microsoft PowerPoint'
    Image|endswith|contains:
      - '/bash'
      - '/curl'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.002
  - actor.inception
