title: Phishing (M365 - entra_id)
id: 3528e67f-f157-489a-a097-2c3b97d8c7fb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    User|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.blacksuit
