title: T1650 (M365 - entra_id)
id: 8bcb44fa-f49f-46ee-bd13-5c034b62ecab
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1650.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1650/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1650
  - actor.blacksuit
