title: OS Credential Dumping (WINDOWS - security)
id: 02c6cde6-7c44-4467-91c8-f67d7650c6f7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '\wceaux.dll'
    ObjectType|contains:
      - 'File'
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.rhysida
