title: Application Window Discovery (WINDOWS - security)
id: c941542a-a3f6-40f0-a69f-9e5fe4c18d72
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1010.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1010
  - actor.rhysida
