title: PowerShell (WINDOWS - security)
id: 1e3e0eee-b5cb-4011-9a2d-0ee6927ee0dc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'cmd'
      - '"set'
      - '-f'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.rhysida
