title: Application Layer Protocol (WINDOWS - security)
id: 81e0ac59-0c76-4db0-bb04-5ee736f13d2d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.rhysida
