title: File Deletion (WINDOWS - security)
id: 126088e2-550f-44eb-abf6-7fc9ca2bc47b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.004.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1070.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
    CommandLine|contains|contains:
      - 'del '
      - 'erase '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.004
  - actor.rhysida
