title: Active Scanning (WINDOWS - security)
id: 91a455ad-e72d-43a1-acfd-2f5681850f7c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1595.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1595/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentCommandLine|contains|contains:
      - ':\Perflogs\'
      - ':\Temp\'
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1595
  - actor.rhysida
