title: Masquerade Task or Service (WINDOWS - defender)
id: bf693ba3-7e8a-43c0-b7ae-f344d6d9652c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: FIN6
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.fin6
