title: Clear Linux or Mac System Logs (LINUX - auditd)
id: 38cf160f-a1c1-4fc0-be22-59872a044fe0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.002.
  Threat Actor: Rocke
references:
  - https://attack.mitre.org/techniques/T1070.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'syslog'
    Image|endswith|contains:
      - '/rm'
    CommandLine|contains|contains:
      - '/var/log/syslog'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.002
  - actor.rocke
