title: Masquerade Task or Service (WINDOWS - sysmon)
id: 838dace9-1a63-462b-a670-a1046438933a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Aquatic Panda
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.aquatic_panda
