title: Indicator Removal (GOOGLE - workspace)
id: 3e5f3119-4514-4adc-a0c7-4da426c88498
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1070/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070
  - actor.spectra
