title: Data from Local System (WINDOWS - defender)
id: b0cc3a0a-e993-49ae-adb3-904a6f35c885
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1005.
  Threat Actor: Dark Caracal
references:
  - https://attack.mitre.org/techniques/T1005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-r'
    Image|endswith|contains:
      - '\sqlcmd.exe'
    CommandLine|contains|all|contains:
      - 'SELECT'
      - 'TOP'
      - '[VeeamBackup].[dbo].[Credentials]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1005
  - actor.dark_caracal
