title: Remote Services (WINDOWS - security)
id: e17fabcb-5f9e-4000-a06e-ee2b1664a98b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.
  Threat Actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1021/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'echo'
      - '>'
      - '\\\\.\\pipe\\'
    CommandLine|contains|contains:
      - ' -L '
      - ' -P '
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021
  - actor.avoslocker
