title: Exfiltration Over Alternative Protocol (WINDOWS - security)
id: 98ad8fc1-d478-476a-bd1e-a3e04914817d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1048.
  Threat Actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1048/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|contains:
      - 'tap0901'
    CommandLine|contains|contains:
      - 'sftp:'
      - 'rest:http'
      - 's3:s3.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1048
  - actor.avoslocker
