title: Domain Groups (WINDOWS - security)
id: 0ddef0fd-d105-4003-9009-08ee81568e6e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1069.002.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1069.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    AccessMask|contains:
      - '0x2d'
    CommandLine|contains|contains:
      - ' -CollectionMethod All '
      - ' --CollectionMethods Session '
      - ' --Loop --Loopduration '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1069.002
  - actor.oilrig
