title: Clipboard Data (WINDOWS - security)
id: fa91c0ef-9bb2-4b1a-bf19-740a466474ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1115.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1115/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Get-Clipboard'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1115
  - actor.oilrig
