title: Spearphishing Attachment (WINDOWS - security)
id: d7408213-ebcc-454d-b9d5-9041a3cda56c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.001.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1566.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectServer|contains:
      - 'Security'
    TargetName|contains|all|contains:
      - 'Microsoft_Windows_Shell_ZipFolder:filename'
      - '\Temporary Internet Files\Content.Outlook'
    ParentImage|endswith|contains:
      - '\hh.exe'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.001
  - actor.oilrig
