title: Indicator Removal - INC Ransom (entra_id)
id: 54c24e75-69e7-405f-b445-004b622353d0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1070 (Indicator Removal).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1070/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/defense_evasion_deleting_websvr_access_logs.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1070
  - actor.inc_ransom
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    file.path|contains:
      - 'C:\\inetpub\\logs\\LogFiles\\*.log'
      - '/var/www/*/logs/access.log'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
