title: System Information Discovery - INC Ransom (entra_id)
id: 0b0ee2de-2bfb-4bf9-944b-ac81fe487e21
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1082 (System Information Discovery).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/discovery_virtual_machine_fingerprinting_grep.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1082
  - actor.inc_ransom
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.args|contains: 'Manufacturer*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
