title: Email Collection - INC Ransom (entra_id)
id: 09ead9dd-6f10-48a7-9a57-39918605754b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1114 (Email Collection).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_workspace_custom_gmail_route_created_or_modified.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1114
  - actor.inc_ransom
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_GMAIL_SETTING'
    google_workspace.event.type|contains: 'EMAIL_SETTINGS'
    google_workspace.admin.setting.name|contains: 'EMAIL_ROUTE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
