title: Web Shell - Stormous (auditd)
id: 166a420f-69f9-4198-b872-94dc813b0221
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505.003 (Web Shell).
  Associated threat actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_web_rce.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505.003
  - actor.stormous
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - 'execve'
      - 'execveat'
    euid|contains: '33'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
