title: Spearphishing Link - Interlock (sysmon)
id: 81bf0fbc-b05f-4b75-ae68-081c54aed1e2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.002 (Spearphishing Link).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.002
  - actor.interlock
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
