title: LSASS Memory (GOOGLE - workspace)
id: 5c22ac1d-6c39-4bac-aa33-f7a9b6b34518
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.001.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1003.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.001
  - actor.magic_hound
