title: LSA Secrets (WINDOWS - security)
id: 88c077c2-2915-444d-b1a3-6c7c25ab35bc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.lynx
