title: Cached Domain Credentials (WINDOWS - security)
id: 980099c9-4641-4542-933f-5c8f7fa79146
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.005.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1003.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
    CommandLine|contains|windash|contains:
      - ' -l'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.005
  - actor.lynx
