title: System Network Configuration Discovery (WINDOWS - security)
id: 442d04df-59a7-4fd9-afb5-0f219f7225d9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.lynx
