title: Steganography (WINDOWS - security)
id: 9d44dcfd-53f5-4f28-acc1-15d38ba1a648
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.lynx
