title: Python (WINDOWS - security)
id: 3e9395e2-215a-460d-9630-db5436f9eab3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.lynx
