title: JavaScript (WINDOWS - security)
id: d23d0a2d-a2b5-47b0-be40-2424405e505c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.007.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1059.007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\hh.exe'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.007
  - actor.lynx
