title: Domain Account (WINDOWS)
id: 60324566-2d98-4830-a618-167754e5aed1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.002.
references:
  - https://attack.mitre.org/techniques/T1087.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.002
