title: Bidirectional Communication (WINDOWS - security)
id: 14209952-e780-4576-9b64-a5a87488c5d0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1102.002.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1102.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1102.002
  - actor.lynx
