title: Exploitation of Remote Services (WINDOWS - security)
id: 701d1270-7136-417a-99e7-d1c86fdf6f08
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1210.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1210/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' -PayloadArgs '
      - ' -PayloadFile '
    ParentImage|endswith|contains:
      - '\java.exe'
      - '\javaw.exe'
    ParentCommandLine|contains|contains:
      - 'SysAidServer'
    ParentCommandLine|contains|all|contains:
      - '\svchost.exe'
      - 'termsvcs'
    Image|endswith|contains:
      - '\rdpclip.exe'
      - ':\Windows\System32\csrss.exe'
      - ':\Windows\System32\wininit.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1210
  - actor.lynx
