title: Remote Access Tools (WINDOWS - security)
id: 8e82ab0a-0ec3-4016-9f98-b0022aa9f813
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|contains|contains:
      - '\TacticalAgent\tacticalrmm.exe'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|endswith|contains:
      - '\Velociraptor.exe'
    CommandLine|endswith|contains:
      - '.exe tunnel'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219
  - actor.lynx
