title: Credentials from Password Stores (WINDOWS)
id: 1222a3b7-eb57-4cd1-b2d3-3217ae694d17
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.
references:
  - https://attack.mitre.org/techniques/T1555/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555
