title: System Network Connections Discovery (LINUX - auditd)
id: bf6eae97-3051-49b7-97e3-78745eb217cc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: Threat Group-3390
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
    ParentCommandLine|contains|contains:
      - '/usr/bin/landscape-sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.threat_group-3390
