title: Bypass User Account Control - Brain Cipher (defender)
id: d1a2d8d9-5854-4908-ba01-3fbecce6c3da
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1548.002 (Bypass User Account Control).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1548/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1548.002
  - actor.brain_cipher
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
