title: Local Groups (LINUX - auditd)
id: e9e74341-0b04-4a60-925b-9aa96ac2a9c7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1069.001.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1069.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/cat'
      - '/ed'
      - '/head'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1069.001
  - actor.alphv-blackcat
