title: User Execution (LINUX)
id: fdb35b4d-e929-4bd5-bad0-44964ec377a9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.
references:
  - https://attack.mitre.org/techniques/T1204/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204
