title: T1219 (LINUX - auditd)
id: 6d7e9e00-27fb-4645-bce4-76a36f3c6219
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219
  - actor.alphv-blackcat
