title: Endpoint Denial of Service (LINUX - auditd)
id: c2f77a0d-2db4-4096-9ce6-4a2f843c5323
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1499.
  Threat Actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1499/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|endswith|contains:
      - '/sysrq'
      - '/sysctl.conf'
      - '/sysrq-trigger'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1499
  - actor.alphv-blackcat
