title: System Network Connections Discovery (MACOS - unified_logging)
id: 55b57ecf-8858-4a1b-b26c-9ae6c9305e1f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: Poseidon Group
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.poseidon_group
