title: Local Account (MACOS - unified_logging)
id: b8ba21e7-6bf1-4ad6-99dd-52a3c9b52927
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.001.
  Threat Actor: Poseidon Group
references:
  - https://attack.mitre.org/techniques/T1087.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/dscl'
    CommandLine|contains|all|contains:
      - 'list'
      - '/users'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.001
  - actor.poseidon_group
