title: OS Credential Dumping - Akira (workspace)
id: eff983e6-9cc7-4d68-9d29-9cc550288b74
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/credential_access_gitleaks_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.akira
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains:
      - 'gitleaks.exe'
      - 'gitleaks'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
