title: Password Spraying - Akira (workspace)
id: f3c0602c-0d16-4ef2-bda8-b3e8c77d273a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1110.003 (Password Spraying).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1110.003
  - actor.akira
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
