title: Local Account - Akira (workspace)
id: 43749dd7-16b6-4d89-9730-13fcfc2e8a6f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1136.001 (Local Account).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1136.001
  - actor.akira
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
