title: Spearphishing Attachment - Akira (workspace)
id: 9867a120-aac6-4b15-be48-87353ea09ca7
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.001 (Spearphishing Attachment).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/initial_access_security_compliance_user_reported_phish_malware.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.001
  - actor.akira
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    rule.name|contains: 'Email reported by user as malware or phish'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
