title: Exploit Public-Facing Application (WINDOWS - security)
id: f4696bae-000f-4806-8b3d-b771a3662e2e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1190.
  Threat Actor: Cicada3301Repellent Scorpius
references:
  - https://attack.mitre.org/techniques/T1190/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
    ParentImage|endswith|contains:
      - '\ScreenConnect.Service.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\csc.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1190
  - actor.cicada3301repellent_scorpius
