title: Hidden Files and Directories (WINDOWS - defender)
id: 02bc3e22-f538-4179-aeab-18fbd2d47bc9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.001.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1564.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' +s'
    CommandLine|contains|all|contains:
      - '/deny'
      - '*S-1-1-0:'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.001
  - actor.8base
