title: Application Layer Protocol - BlackByte (defender)
id: 1a9395bc-0bdd-456e-96b1-ffb50c10641b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1071 (Application Layer Protocol).
  Associated threat actor: BlackByte
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_shell_suspicious_parent_child_revshell_linux.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1071
  - actor.blackbyte
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'python*'
      - 'awk'
    process.args|contains: '-connect'
    process.parent.name|contains:
      - 'python*'
      - 'awk'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
