title: Web Shell - Stormous (workspace)
id: 233a4f8c-d2b5-458a-9528-e7858d8c5fc3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505.003 (Web Shell).
  Associated threat actor: Stormous
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_shell_activity_by_web_server.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505.003
  - actor.stormous
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.parent.name|contains: 'apache'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
