title: System Information Discovery (MACOS - unified_logging)
id: 425ac0a9-a3e6-4f63-b4d2-ba9db92c2eeb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1082.
  Threat Actor: APT37
references:
  - https://attack.mitre.org/techniques/T1082/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'hw.'
      - 'kern.'
      - 'machdep.'
    Image|endswith|contains:
      - '/sw_vers'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1082
  - actor.apt37
