title: Exfiltration Over Alternative Protocol - 3AM (security)
id: f4837cc0-a3d0-459f-a454-426b5ae5018c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1048 (Exfiltration Over Alternative Protocol).
  Associated threat actor: 3AM
references:
  - https://attack.mitre.org/techniques/T1048/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_tap_driver_installation.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1048
  - actor.3am
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4697'
    ServiceFileName|contains: 'tap0901'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
