title: Application Window Discovery (WINDOWS - security)
id: 8e1d3de8-c03f-4621-b7ec-4d42b5cb1e71
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1010.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SC_MANAGER OBJECT'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1010
  - actor.safepay
