title: Valid Accounts (WINDOWS)
id: 72e95f50-fba1-4324-aa42-e79f54b8298a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
