title: Non-Application Layer Protocol (WINDOWS - security)
id: 4c86bc80-15d6-44c2-90a8-85155fe5c7a6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1095.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1095/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\nc.exe'
      - '\ncat.exe'
      - '\netcat.exe'
    CommandLine|contains|contains:
      - ' -lvp '
      - ' -lvnp'
      - ' -l -v -p '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1095
  - actor.safepay
