title: Web Service (WINDOWS - security)
id: 344266bb-2486-47ec-9a2a-fcdb9de7cd53
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1102.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1102/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - '-config '
      - '-credentials-contents '
      - '-credentials-file '
    ParentImage|contains|all|contains:
      - '\ManageEngine\ServiceDesk\'
      - '\java.exe'
    Image|endswith|contains:
      - '\AppVLP.exe'
      - '\bash.exe'
      - '\bitsadmin.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1102
  - actor.safepay
