title: Data Destruction (WINDOWS - security)
id: 19cb33ba-e8b9-45fc-91a9-093fbb841246
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1485.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1485/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
    CommandLine|contains|contains:
      - 'deletejournal'
      - 'createjournal'
      - 'setZeroData'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1485
  - actor.safepay
