title: Windows Management Instrumentation Event Subscription (WINDOWS - security)
id: 58ff2eca-03ca-4ccd-a7f6-da4fcdd6fbeb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.003.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1546.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'WMI Namespace'
    ParentImage|endswith|contains:
      - '\EdgeTransport.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.003
  - actor.safepay
