title: Internet Connection Discovery - LockBit (defender)
id: 118f5300-3a43-481f-89b4-e6c859c6a5b8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1016.001 (Internet Connection Discovery).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1016/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_enumeration_via_wmiprvse.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1016.001
  - actor.lockbit
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'sc.exe'
    process.parent.name|contains: 'wmiprvse.exe'
    process.args|contains: 'tenable_mw_scan'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
