title: System Shutdown/Reboot - LockBit (defender)
id: feb1bc36-9c7e-4c78-9e07-6fe72ba2e8a2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1529 (System Shutdown/Reboot).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_shutdown_execution.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1529
  - actor.lockbit
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName|contains:
      - '\shutdown.exe'
      - '/r '
      - '/s '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
