title: Bypass User Account Control - LockBit (defender)
id: b80edf24-9d57-44b1-9145-e12a6787fba0
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1548.002 (Bypass User Account Control).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1548/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/privilege_escalation_krbrelayup_suspicious_logon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1548.002
  - actor.lockbit
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    winlog.event_data.AuthenticationPackageName|contains: 'Kerberos'
    winlog.event_data.TargetUserSid|contains: 'S-1-5-21-*-500'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
