title: System Language Discovery - LockBit (defender)
id: 985ea700-29d7-4256-b821-6241cb6af50b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1614.001 (System Language Discovery).
  Associated threat actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1614/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_chcp_codepage_lookup.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1614.001
  - actor.lockbit
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessParentFileName|contains:
      - '\cmd.exe'
      - ' -c '
      - ' -r '
      - ' -k '
    InitiatingProcessFileName|contains:
      - '\chcp.com'
      - 'chcp'
      - 'chcp '
      - 'chcp  '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
