title: Application Layer Protocol - BlackBasta (unified_logging)
id: c880974d-8b98-41a6-9d43-6198e7344ca5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1071 (Application Layer Protocol).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_shell_suspicious_parent_child_revshell_linux.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1071
  - actor.blackbasta
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'python*'
      - 'awk'
    process.args|contains: '-connect'
    process.parent.name|contains:
      - 'python*'
      - 'awk'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
