title: Indirect Command Execution - 8base (security)
id: a31147e7-f7c6-430e-89b0-49655c01dd40
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1202 (Indirect Command Execution).
  Associated threat actor: 8base
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_indirect_exec_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1202
  - actor.8base
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'conhost.exe'
    process.args|contains: '--headless'
    process.command_line|contains:
      - '*powershell*'
      - '*mhsta*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
