title: SMB/Windows Admin Shares (WINDOWS - security)
id: c6a20ca0-0364-4533-94b9-7fabb7fa14c9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.002.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1021.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\IPC$'
    ServiceFileName|contains|all|contains:
      - 'ADMIN$'
      - '.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.002
  - actor.apt28
