title: Network Sniffing (WINDOWS - security)
id: f0477f97-ce99-4b61-b55c-c1f679a61713
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1040.
  Threat Actor: APT28
references:
  - https://attack.mitre.org/techniques/T1040/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|contains:
      - 'pcap'
      - 'npcap'
      - 'npf'
    CommandLine|contains|all|contains:
      - 'wlan'
      - ' s'
      - ' p'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1040
  - actor.apt28
