title: Modify Registry (WINDOWS - defender)
id: f3596c13-21d7-4e02-86a1-09c86ab94227
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1112.
  Threat Actor: Cephalus
references:
  - https://attack.mitre.org/techniques/T1112/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\dnscmd.exe'
    CommandLine|contains|all|contains:
      - ' add '
      - '\SYSTEM\CurrentControlSet\Control\MiniNt'
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1112
  - actor.cephalus
