title: Screen Capture (LINUX - auditd)
id: 4d79659e-16ad-4fab-9996-103c609254c5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1113.
  Threat Actor: Dark Caracal
references:
  - https://attack.mitre.org/techniques/T1113/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'xwd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1113
  - actor.dark_caracal
