title: Disable or Modify Tools (WINDOWS - sysmon)
id: 39b89519-55df-41de-ba1b-c2232b7bb966
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1562.001.
  Threat Actor: Devman's Ransomware
references:
  - https://attack.mitre.org/techniques/T1562.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' disable '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1562.001
  - actor.devman's_ransomware
