title: Local Account (LINUX - auditd)
id: ad1e28fd-90c9-4464-9ce1-7e3d611568b8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|endswith|contains:
      - '/useradd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.ransomhub
