title: External Remote Services (LINUX - auditd)
id: dc219ca3-d272-4316-87fe-05daeb50405b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/TeamViewer_Service'
    Image|endswith|contains:
      - '/TeamViewer_Desktop'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.ransomhub
