title: Remote Access Tools (LINUX - auditd)
id: 5faa6c99-1ea3-42e1-a46b-c6395ba5c0cb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219
  - actor.ransomhub
