title: Exfiltration Over Web Service (LINUX - auditd)
id: 2f0816c0-8917-44a5-b641-22b99c52e178
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/curl'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.ransomhub
