title: Code Signing (WINDOWS - security)
id: cce27f64-74e5-4681-bb79-dea313a903db
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: Patchwork
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.patchwork
