title: Web Service - SafePay (unified_logging)
id: f24ff8e3-eda1-4da9-bc91-c67d723a4a4d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1102 (Web Service).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1102/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/beaconing/command_and_control_beaconing.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1102
  - actor.safepay
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains: 'WaAppAgent.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
