title: Inhibit System Recovery - SafePay (unified_logging)
id: 55faee13-bd9a-46ae-8fd5-f07fe943c689
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1490 (Inhibit System Recovery).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_tmutil_delete_backup.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1490
  - actor.safepay
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    CommandLine|contains: 'delete'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
