title: Binary Padding - Qilin (unified_logging)
id: 783d39ab-6b5d-4549-828e-69b563ee6dbc
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.001 (Binary Padding).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_binary_padding.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.001
  - actor.qilin
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains:
      - '/truncate'
      - '/dd'
    CommandLine|contains: '-s +'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
