title: Password Cracking (WINDOWS - sysmon)
id: 1f1beb4e-5655-453b-b4dd-cf6858a7d513
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1110.002.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1110.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\hashcat.exe'
    CommandLine|contains|all|contains:
      - '-a '
      - '-m 1000 '
      - '-r '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1110.002
  - actor.dragonfly
