title: Local Account (WINDOWS - sysmon)
id: 8207e1be-3cd6-4649-b452-8c5e853241b7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'user'
      - 'add'
      - 'expires:never'
    CommandLine|contains|contains:
      - 'Remote Desktop Users'
      - 'Utilisateurs du Bureau à distance'
      - 'Usuarios de escritorio remoto'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.dragonfly
