title: Hidden Users (WINDOWS - sysmon)
id: ac8e1188-dffc-46f2-87e1-910157a19093
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.002.
  Threat Actor: Dragonfly
references:
  - https://attack.mitre.org/techniques/T1564.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\reg.exe'
    CommandLine|contains|all|contains:
      - '/export'
      - '/cfg'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.002
  - actor.dragonfly
