title: PowerShell (LINUX - auditd)
id: 2bbba9b6-6b3c-45c6-95b5-3eaf3905a413
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.001.
  Threat Actor: Gorgon Group
references:
  - https://attack.mitre.org/techniques/T1059.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.001
  - actor.gorgon_group
