title: Drive-by Compromise - Interlock (unified_logging)
id: 34110b6f-b7fd-4e13-9713-8cd71ded6a2f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1189 (Drive-by Compromise).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_cross_site_scripting.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1189
  - actor.interlock
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    url.fragment|contains:
      - '<iframe*'
      - '*onmouseover=*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
