title: Windows Management Instrumentation (MACOS - unified_logging)
id: 49015620-c0b1-43a2-a2f7-91b703454b34
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1047.
  Threat Actor: Lazarus Group
references:
  - https://attack.mitre.org/techniques/T1047/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1047
  - actor.lazarus_group
