title: System Service Discovery - DoNex (auditd)
id: 23130ad0-b3e4-45d8-984e-49aa03c3b66d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1007 (System Service Discovery).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1007
  - actor.donex
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains: '/crontab'
    cmd|contains: ' -l'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
