title: Disable or Modify Tools - DoNex (auditd)
id: dc72bdce-ec90-469b-a511-083ec262f694
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.001 (Disable or Modify Tools).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_disable_aslr_protection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.001
  - actor.donex
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - 'EXECVE'
    SYSCALL|contains: 'personality'
    a0|contains:
      - '40000'
      - 'sysctl'
    a1|contains: '-w'
    a2|contains: 'kernel.randomize_va_space=0' # 0 = disable'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
