title: HackTool - PCHunter Execution
id: 871d8715-39e5-47dd-aceb-42719cdff7a1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_pchunter.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1007
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_image:
          Image|endswith:
              - '\PCHunter64.exe'
              - '\PCHunter32.exe'
      selection_pe:
          - OriginalFileName: 'PCHunter.exe'
          - Description: 'Epoolsoft Windows Information View Tools'
      selection_hashes:
          Hashes|contains:
              - 'SHA1=5F1CBC3D99558307BC1250D084FA968521482025'
              - 'MD5=987B65CD9B9F4E9A1AFD8F8B48CF64A7'
              - 'SHA256=2B214BDDAAB130C274DE6204AF6DBA5AEEC7433DA99AA950022FA306421A6D32'
              - 'IMPHASH=444D210CEA1FF8112F256A4997EED7FF'
              - 'SHA1=3FB89787CB97D902780DA080545584D97FB1C2EB'
              - 'MD5=228DD0C2E6287547E26FFBD973A40F14'
              - 'SHA256=55F041BF4E78E9BFA6D4EE68BE40E496CE3A1353E1CA4306598589E19802522C'
              - 'IMPHASH=0479F44DF47CFA2EF1CCC4416A538663'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
