title: Credential Dumping Tools Service Execution - Security
id: 5cb7253e-ed24-4517-bf20-f1e354fe3efa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_creddumper.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003.005
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4697
          ServiceFileName|contains:
              - 'cachedump'
              - 'dumpsvc'
              - 'fgexec'
              - 'gsecdump'
              - 'mimidrv'
              - 'pwdump'
              - 'servpw'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
