title: Suspicious LDAP-Attributes Used
id: aad477d8-aa7f-43a8-aec3-32bab4df3084
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1001.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1001/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_ldap_dataexchange.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1001.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 5136
          AttributeValue|contains: '*'
          AttributeLDAPDisplayName:
              - 'primaryInternationalISDNNumber'
              - 'otherFacsimileTelephoneNumber'
              - 'primaryTelexNumber'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
