title: Firewall Configuration Discovery Via Netsh.EXE
id: 2213d92f-1382-4200-b31f-7540d79509f4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1016.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1016/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_netsh_fw_rules_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1016
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\netsh.exe'
          - OriginalFileName: 'netsh.exe'
      selection_cli:
          CommandLine|contains|all:
              - 'netsh'
              - 'show '
              - 'firewall '
          CommandLine|contains:
              - 'config '
              - 'state '
              - 'rule '
              - 'name=all'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
