title: DNS Server Discovery Via LDAP Query
id: f4ad1b2a-51de-4899-9d98-baae2cfba20f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1016.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1016/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_dns_server_discovery_via_ldap_query.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1016
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          QueryName|startswith: '_ldap.'
      filter_main_generic:
          Image|contains:
              - ':\Program Files\'
              - ':\Program Files (x86)\'
              - ':\Windows\'
      filter_main_defender:
          Image|contains: ':\ProgramData\Microsoft\Windows Defender\Platform\'
          Image|endswith: '\MsMpEng.exe'
      filter_main_unknown:
          Image: '<unknown process>'
      filter_optional_azure:
          Image|startswith: 'C:\WindowsAzure\GuestAgent'
      filter_main_null:
          Image: null
      filter_optional_browsers:
          # Note: This list is for browsers installed in the user context. To avoid basic evasions based on image name. Best to baseline this list with the browsers you use internally and add their full paths.
          Image|endswith:
              - '\chrome.exe'
              - '\firefox.exe'
              - '\opera.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
