title: Enumeration Command Spawned via WMIPrvSE
id: 810cde3c-50e0-4ea3-9269-e692242a9093
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1016.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1016/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_enumeration_via_wmiprvse.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1016.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name:
      - 'arp.exe'
      - 'whoami.exe'
      - 'sc.exe'
    process.parent.name: 'wmiprvse.exe'
    process.args:
      - 'RemoteRegistry'
      - 'start='
      - 'demand'
      - 'disabled'
      - 'tenable_mw_scan'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
