title: Windows Obfuscated Files or Information via RAR SFX
id: 13237c6c-1323-4323-a323-13237c6c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1027.013
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_obfuscated_files_or_information_via_rar_sfx.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1027.013
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=11 TargetFilename IN ("*__tmp_rar_sfx_access_check*")
    #   | stats count min(_time) as firstTime max(_time) as lastTime by action dest file_name
    #   file_path  process_guid process_id user user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `windows_obfuscated_files_or_information_via_rar_sfx_filter`
  condition: selection
level: medium
