title: RDP Login from Localhost
id: 25da6817-55cb-4c3a-bf1d-c11e5dae65b2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_rdp_localhost_login.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 10
          IpAddress:
              - '::1'
              - '127.0.0.1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
