title: Detect RClone Command-Line Usage
id: 68530d21-6b69-4fc8-a017-20749eaab82f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1020.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1020/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/detect_rclone_command_line_usage.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1020
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    original_file_name: 'rclone.exe'
    process_name: 'rclone.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
