title: OpenSSH Server Listening On Socket
id: 1546da58-579f-466a-800a-01cf385a21b6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1021.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1021/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/openssh/win_sshd_openssh_server_listening_on_socket.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1021.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4
          process: sshd
          payload|startswith: 'Server listening on '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
