title: Scheduled Task Creation Masquerading as System Processes
id: 471d23f0-d11b-400f-a9f8-094ad732dced
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_schtasks_system_process.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\schtasks.exe'
          - OriginalFileName: 'schtasks.exe'
      selection_cli:
          CommandLine|contains|windash: ' /create '
          CommandLine|contains:
              - ' audiodg'
              - ' conhost'
              - ' dwm.exe'
              - ' explorer'
              - ' lsass'
              - ' lsm'
              - ' mmc'
              - ' msiexec'
              - ' regsvr32'
              - ' rundll32'
              - ' services'
              - ' spoolsv'
              - ' svchost'
              - ' taskeng'
              - ' taskhost'
              - ' wininit'
              - ' winlogon'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
