title: Windows Svchost.exe Parent Process Anomaly
id: 682b43e4-b3a7-48cc-9b97-24a7da3ede0f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1035.009.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1035/009/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_svchost_exe_parent_process_anomaly.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1035.009
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'svchost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
