title: Windows Svchost.exe Parent Process Anomaly
id: 96d109ac-57ca-4ee3-a73b-f4385d02172d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1035.009.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1035/009/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_svchost_exe_parent_process_anomaly.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1035.009
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'svchost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
