title: Linux File Creation In Init Boot Directory
id: ea0436d0-e692-44ad-84c1-4f82a6a27628
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1037.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1037/004/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_file_creation_in_init_boot_directory.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1037.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Filesystem'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
