title: First Time Seen Removable Device
id: 05664e9f-7c0b-4972-9be3-d04fb07c0207
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1052.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1052/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/initial_access_exfiltration_first_time_seen_usb.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1052.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.category: 'registry'
    host.os.type: 'windows'
    registry.value: 'FriendlyName'
    registry.path: 'USBSTOR*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
