title: Linux Service File Created In Systemd Directory
id: dea62101-0e82-4b19-ae46-e7d8ec7509f3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.006.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1053/006/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_service_file_created_in_systemd_directory.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1053.006
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Filesystem'
    file_name: '*.service'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
