title: Remote Access Tool - ScreenConnect Command Execution
id: bc84ede4-ecf9-46ca-999c-ea9c95084128
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/screenconnect/win_app_remote_access_tools_screenconnect_command_exec.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name: 'ScreenConnect'
          EventID: 200
          Data|contains: 'Executed command of length'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
