title: HackTool - CrackMapExec Execution
id: 5d513c99-f7ff-413b-92f4-6b6cdf79aed1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_crackmapexec_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_binary:
          Image|endswith: '\crackmapexec.exe'
      selection_special:
          CommandLine|contains: ' -M pe_inject '
      selection_execute:
          CommandLine|contains|all:
              - ' --local-auth'
              - ' -u '
              - ' -x '
      selection_hash:
          CommandLine|contains|all:
              - ' --local-auth'
              - ' -u '
              - ' -p '
              - " -H 'NTHASH'"
      selection_module_mssql:
          CommandLine|contains|all:
              - ' mssql '
              - ' -u '
              - ' -p '
              - ' -M '
              - ' -d '
      selection_module_smb1:
          CommandLine|contains|all:
              - ' smb '
              - ' -u '
              - ' -H '
              - ' -M '
              - ' -o '
      selection_module_smb2:
          CommandLine|contains|all:
              - ' smb '
              - ' -u '
              - ' -p '
              - ' --local-auth'
      part_localauth_1:
          CommandLine|contains|all:
              - ' --local-auth'
              - ' -u '
              - ' -p '
      part_localauth_2:
          CommandLine|contains|all:
              - ' 10.'
              - ' 192.168.'
              - '/24 '
      condition: 1 of selection_* or all of part_localauth*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
