title: Powershell Keylogging
id: 1372900f-a33b-46d5-8742-9cd6a45f25bc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1056.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1056/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_keylogging.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1056.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_basic:
          ScriptBlockText|contains: 'Get-Keystrokes'
      selection_high: # want to run in background and keyboard
          ScriptBlockText|contains|all:
              - 'Get-ProcAddress user32.dll GetAsyncKeyState'
              - 'Get-ProcAddress user32.dll GetForegroundWindow'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
