title: Remote Task Creation via ATSVC Named Pipe
id: 4064e196-0f42-4015-895e-dda95792e52b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_atsvc_task.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 5145
          ShareName: '\\\\\*\\IPC$' # looking for the string \\*\IPC$
          RelativeTargetName: atsvc
          AccessList|contains: 'WriteData'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
