title: Windows Input Capture Using Credential UI Dll
id: 53344bdd-5334-4334-a334-53344bdd0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1056.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_input_capture_using_credential_ui_dll.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1056.002
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=7  (ImageLoaded = "*\\credui.dll" AND OriginalFileName
    #   = "credui.dll") OR (ImageLoaded = "*\\wincredui.dll" AND OriginalFileName = "wincredui.dll")
    #   AND NOT(Image IN("*\\windows\\explorer.exe", "*\\windows\\system32\\*", "*\\windows\\sysWow64\\*",
    #   "*:\\program files*")) | fillnull | stats count min(_time) as firstTime max(_time)
    #   as lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name
    #   process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists
    #   service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `windows_input_capture_using_credential_ui_dll_filter`
  condition: selection
level: medium
