title: Loading Of Dynwrapx Module
id: 572733d5-5727-4727-a727-572733d50000
status: stable
description: Detection rule for MITRE ATT&CK technique T1055.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/loading_of_dynwrapx_module.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1055.001
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=7 (ImageLoaded = "*\\dynwrapx.dll" OR OriginalFileName
    #   = "dynwrapx.dll" OR  Product = "DynamicWrapperX") | fillnull | stats count min(_time)
    #   as firstTime max(_time) as lastTime by Image ImageLoaded dest loaded_file loaded_file_path
    #   original_file_name process_exec process_guid process_hash process_id process_name
    #   process_path service_dll_signature_exists service_dll_signature_verified signature
    #   signature_id user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `loading_of_dynwrapx_module_filter`
  condition: selection
level: medium
