title: HackTool - Bloodhound/Sharphound Execution
id: 31c52dff-2983-408f-80f0-194493014e7b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_bloodhound_sharphound.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1069.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Product|contains: 'SharpHound'
          - Description|contains: 'SharpHound'
          - Company|contains:
                - 'SpecterOps'
                - 'evil corp'
          - Image|contains:
                - '\Bloodhound.exe'
                - '\SharpHound.exe'
      selection_cli_1:
          CommandLine|contains:
              - ' -CollectionMethod All '
              - ' --CollectionMethods Session '
              - ' --Loop --Loopduration '
              - ' --PortScanTimeout '
              - '.exe -c All -d '
              - 'Invoke-Bloodhound'
              - 'Get-BloodHoundData'
      selection_cli_2:
          CommandLine|contains|all:
              - ' -JsonFolder '
              - ' -ZipFileName '
      selection_cli_3:
          CommandLine|contains|all:
              - ' DCOnly '
              - ' --NoSaveCache '
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
