title: BloodHound Collection Files
id: 2444a4f0-133b-4a9d-a59c-898da54cf41a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_bloodhound_collection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1069.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          TargetFilename|endswith:
              - 'BloodHound.zip'
              - '_computers.json'
              - '_containers.json'
              - '_domains.json'
              - '_gpos.json'
              - '_groups.json'
              - '_ous.json'
              - '_users.json'
      filter_optional_ms_winapps:
          Image|endswith: '\svchost.exe'
          TargetFilename|startswith: 'C:\Program Files\WindowsApps\Microsoft.'
          TargetFilename|endswith: '\pocket_containers.json'
      condition: selection and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
