title: Unmount Share Via Net.EXE
id: 438d9bc3-7a3e-4cb3-8733-fb1418523ee5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_net_share_unmount.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.005
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - '\net.exe'
                - '\net1.exe'
          - OriginalFileName:
                - 'net.exe'
                - 'net1.exe'
      selection_cli:
          CommandLine|contains|all:
              - 'share'
              - '/delete'
      condition: all of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
