title: Backup Catalog Deleted
id: d0ea7847-9072-4f68-abda-b1c0201de5b7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft_windows_backup/win_susp_backup_delete.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 524
          Provider_Name: Microsoft-Windows-Backup
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
