title: Remove Exported Mailbox from Exchange Webserver
id: 8aab7184-1ee5-48ab-bd9f-04c102d075b2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/msexchange/win_exchange_proxyshell_remove_mailbox_export.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      keywords:
          '|all':
              - 'Remove-MailboxExportRequest'
              - ' -Identity '
              - ' -Confirm "False"'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
