title: Suspicious SQLite3 LSQuarantine Behavior
id: b878b468-6a44-4da8-bbcb-934d9b6b9409
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1074.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/suspicious_sqlite3_lsquarantine_behavior.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1074
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name: 'sqlite3'
    process: '*LSQuarantine*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
