title: Github Self-Hosted Runner Execution
id: 33b862d9-cba6-4850-b959-f15a73ae6914
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_github_self_hosted_runner.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1071
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_worker_img:  # Example command C:\Users\Lab\actions-runner\bin\Runner.Worker.exe spawnclient 1288 1252
          - Image|endswith: '\Runner.Worker.exe'
          - OriginalFileName: 'Runner.Worker.dll'
      selection_worker_cli:
          CommandLine|contains: 'spawnclient'
      selection_listener_img: # Example command C:\Users\Lab\actions-runner\bin\Runner.Listener.exe  configure --url https://github.com/ABC/ABC --token 123123
          - Image|endswith: '\Runner.Listener.exe'
          - OriginalFileName: 'Runner.Listener.dll'
      selection_listener_cli:
          CommandLine|contains:
              - 'run'
              - 'configure'
      condition: all of selection_worker_* or all of selection_listener_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
