title: Admin User Remote Logon
id: cf64e0db-32fa-43d5-8df5-91ed3c70fb4a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_admin_rdp_login.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4624
          LogonType: 10
          AuthenticationPackageName: Negotiate
          TargetUserName|startswith: 'Admin'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
