title: Cloudflared Tunnels Related DNS Requests
id: c5cdfa09-33dd-40cd-bb37-4f1907eff7aa
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1071/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/dns_query/dns_query_win_cloudflared_communication.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1071.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          QueryName|endswith:
              - '.v2.argotunnel.com'
              - 'protocol-v2.argotunnel.com'
              - 'trycloudflare.com'
              - 'update.argotunnel.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
