title: HackTool - WinPwn Execution - ScriptBlock
id: 9bc50edf-3e2b-4240-8dd1-bfe6a870792d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1082.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_hktl_winpwn.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains:
              - 'Offline_Winpwn'
              - 'WinPwn '
              - 'WinPwn.exe'
              - 'WinPwn.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
