title: External Disk Drive Or USB Storage Device Was Recognized By The System
id: e19b93d0-049f-4af0-98a5-ba9f39f80eab
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1091.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1091/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_external_device.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1091
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_eid:
          EventID: 6416
      selection_field:
          - ClassName: 'DiskDrive'
          - DeviceDescription: 'USB Mass Storage Device'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
