title: New ActiveSyncAllowedDeviceID Added via PowerShell
id: fec59674-df82-4185-8786-c5a3c10f08c9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1098/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_powershell_exch_mailbox_activesync_add_device.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1098.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name:
      - 'powershell.exe'
      - 'powershell_ise.exe'
    process.args: 'Set-CASMailbox*ActiveSyncAllowedDeviceIDs*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
