title: Netcat The Powershell Version
id: b2b8b7ea-9c7d-44a1-9cd0-93df6e27cb38
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1095.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_classic/posh_pc_powercat.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1095
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Data|contains:
              - 'powercat '
              - 'powercat.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
