title: Linux Possible Access Or Modification Of sshd Config File
id: 5ff6fb54-00d4-45e0-abe8-61f3382cb2c7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.004.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1098/004/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_possible_access_or_modification_of_sshd_config_file.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1098.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
