title: PUA - Netcat Suspicious Execution
id: eb88bec1-c47d-43d9-8840-befdbb0510eb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1095.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_netcat.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1095
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          # can not use OriginalFileName as is empty
          Image|endswith:
              - '\nc.exe'
              - '\ncat.exe'
              - '\netcat.exe'
      selection_cmdline:
          # Typical command lines
          CommandLine|contains:
              - ' -lvp '
              - ' -lvnp'
              - ' -l -v -p '
              - ' -lv -p '
              - ' -l --proxy-type http '
              # - ' --exec cmd.exe ' # Not specific enough for netcat
              - ' -vnl --exec '
              - ' -vnl -e '
              - ' --lua-exec '
              - ' --sh-exec '
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
