title: Automated Collection Command PowerShell
id: e4ff1aeb-2a0a-46c2-9529-50bdbd71e09d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1119.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_automated_collection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1119
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_ext:
          ScriptBlockText|contains:
              - '.doc'
              - '.docx'
              - '.xls'
              - '.xlsx'
              - '.ppt'
              - '.pptx'
              - '.rtf'
              - '.pdf'
              - '.txt'
      selection_cmd:
          ScriptBlockText|contains|all:
              - 'Get-ChildItem'
              - ' -Recurse '
              - ' -Include '
      condition: all of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
