title: PowerShell Get Clipboard
id: 57e3b821-b6db-4f60-96eb-b0d0b659e531
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1115.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_module/posh_pm_get_clipboard.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1115
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Payload|contains: 'Get-Clipboard'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
