title: MSSQL Server Failed Logon
id: efa90292-0ba3-4515-9ce3-05341b5f2d5a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/mssqlserver/win_mssql_failed_logon.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name|contains: 'MSSQL' # Note: We use contains to account for other third party providers - See https://github.com/SigmaHQ/sigma/issues/4876
          EventID: 18456
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
