title: Exporting Exchange Mailbox via PowerShell
id: 081f7bde-8ab3-48e1-a31e-86c809052122
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_email_powershell_exchange_mailbox.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1114.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name:
      - 'powershell.exe'
      - 'powershell_ise.exe'
    process.command_line:
      - '*MailboxExportRequest*'
      - '*-Mailbox*-ContentFilter*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
