title: Windows Executable in Loaded Modules
id: 48b2bc8c-48b2-48b2-a8b2-48b2bc8c0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1129
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_executable_in_loaded_modules.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1129
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=7 ImageLoaded != *.dll AND Signed != true  
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime 
    #   by Image ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec process_guid process_hash process_id process_name
    #   process_path service_dll_signature_exists service_dll_signature_verified signature Signed
    #   signature_id user_id vendor_product 
    #   | `security_content_ctime(firstTime)` 
    #   | `security_content_ctime(lastTime)`
    #   | `windows_executable_in_loaded_modules_filter`
  condition: selection
level: medium
