title: System Information Discovery via Registry Queries
id: 08c8b8de-4fa7-4b71-90eb-745891ef554f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1124.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1124/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_discovery_via_reg_queries.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1124
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_cmd_reg:
          Image|endswith: '\reg.exe'
          CommandLine|contains: 'query'
          CommandLine|contains|windash: '-v'
      selection_cmd_powershell:
          Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
          CommandLine|contains:
              - 'Get-ItemPropertyValue'
              - 'gpv'
      selection_keys:
          CommandLine|contains:
              - '\SOFTWARE\Microsoft\Windows Defender' # Details about defender state
              - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion' # Provides details about the OS
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall' # Lists installed programs
              - '\SYSTEM\CurrentControlSet\Control\TimeZoneInformation' # Contains time zone details
              - '\SYSTEM\CurrentControlSet\Services' # Details about existing services
      condition: 1 of selection_cmd_* and selection_keys
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
