title: Processes Accessing the Microphone and Webcam
id: 8554e07f-c149-4335-8bea-3e94eea47a50
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1123.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1123/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_camera_microphone_access.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1123
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID:
              - 4657
              - 4656
              - 4663
          ObjectName|contains:
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\microphone\NonPackaged'
              - '\SOFTWARE\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\webcam\NonPackaged'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
