title: Outlook Home Page Registry Modification
id: 66d7e3fd-06fb-439d-8a17-c961bf19307e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1137.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1137/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_outlook_home_page.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1137
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    registry.value: 'URL'
    registry.path:
      - '*\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Webview\\*'
      - '*\\SOFTWARE\\Microsoft\\Office\\*\\Outlook\\Today\\*'
    registry.data.strings:
      - '*://*'
      - '*:\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
