title: MSHTA Execution with Suspicious File Extensions
id: 0d63a7c3-2a6f-475d-b4cf-e0bf85ae79c3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1140.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1140/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_mshta_susp_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1140
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\mshta.exe'
          - OriginalFileName: 'mshta.exe'
      selection_cli:
          CommandLine|contains:
              - '.7z'
              - '.avi'
              - '.bat'
              - '.bmp'
              - '.conf'
              - '.csv'
              - '.dll'
              - '.doc'
              - '.gif'
              - '.gz'
              - '.ini'
              - '.jpe'
              - '.jpg'
              - '.json'
              - '.lnk'
              - '.log'
              - '.mkv'
              - '.mp3'
              - '.mp4'
              - '.pdf'
              - '.png'
              - '.ppt'
              - '.rar'
              - '.rtf'
              - '.svg'
              - '.tar'
              - '.tmp'
              - '.txt'
              - '.xls'
              - '.xml'
              - '.yaml'
              - '.yml'
              - '.zip'
              - 'vbscript'
              # - '.chm'  # could be prone to false positives
              # - '.exe'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
