title: Chromium Browser Instance Executed With Custom Extension
id: 5a63843b-d568-41b1-836d-c573ae295bf0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1176.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1176/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_browsers_chromium_load_extension.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1176.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '\brave.exe'
              - '\chrome.exe'
              - '\msedge.exe'
              - '\opera.exe'
              - '\vivaldi.exe'
          CommandLine|contains: '--load-extension='
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
