title: Rare Connection to WebDAV Target
id: 33bc9d97-33bc-43bc-a3bc-33bc9d970000
status: stable
description: Detection rule for MITRE ATT&CK technique T1187
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_rare_webdav_destination.toml
author: elastic (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1187
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original elastic detection logic
    # from logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*, logs-windows.*, winlogbeat-*, logs-crowdstrike.fdr*, logs-m365_defender.event-* METADATA _id, _version, _index
    # | where
    #     @timestamp > now() - 8 hours and
    #     event.category == "process" and
    #     event.type == "start" and
    #     process.name == "rundll32.exe" and
    #     process.command_line like "*DavSetCookie*"
    # | keep host.id, process.command_line, user.name, user.id
    # // extract domain or IP address from process cmdline
    # | grok process.command_line """(?<Esql.server_webdav_server>((http|https)://[a-zA-Z0-9-\.]{1,}\.[a-zA-Z]{2,3}[@\/]+)|(\b(?:(?:25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)\.){3}(?:25[0-5]|2[0-4]\d|1\d\d|[1-9]?\d)\b)[@\/]+)"""
    # // remove sub domains from URL
    # | eval Esql.server_webdav_server = REPLACE(Esql.server_webdav_server, """((http|https)://[a-zA-Z0-9-]{1,}\.)""", "")
    # | eval Esql.server_webdav_server = REPLACE(Esql.server_webdav_server, "/", "")
    # | where
    #     Esql.server_webdav_server is not null and
    #     not Esql.server_webdav_server in ("www.google.com", "www.elastic.co", "sharepoint.com", "live.net", "google.com", "SHAREPOINT.COM", "github.com") and
    #     // excludes private IP ranges
    #     not Esql.server_webdav_server rlike """(10\.(\d{1,3}\.){2}\d{1,3}|172\.(1[6-9]|2\d|3[0-1])\.(\d{1,3}\.)\d{1,3}|192\.168\.(\d{1,3}\.)\d{1,3})"""
    # | stats
    #     Esql.event_count = count(*),
    #     Esql.host_id_count_distinct = count_distinct(host.id),
    #     Esql.host_id_values = values(host.id),
    #     Esql.user_name_values = values(user.name)
    #   by Esql.server_webdav_server
    # | where
    #     Esql.host_id_count_distinct == 1 and Esql.event_count <= 3
    # | eval host.id = MV_MIN(Esql.host_id_values), user.name = MV_MIN(Esql.user_name_values), destination.domain = MV_MIN(Esql.server_webdav_server)
    # | KEEP host.id, user.name, destination.domain, Esql.*
  condition: selection
level: medium
