title: Windows Vulnerable 3CX Software
id: 6685faf7-6685-4685-a685-6685faf70000
status: stable
description: Detection rule for MITRE ATT&CK technique T1195.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_vulnerable_3cx_software.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1195.002
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` (process_name=3CXDesktopApp.exe OR OriginalFileName=3CXDesktopApp.exe)  FileVersion=18.12.*
    #   | stats count min(_time) as firstTime max(_time) as lastTime by action dest original_file_name
    #   parent_process parent_process_exec parent_process_guid parent_process_id parent_process_name
    #   parent_process_path process process_exec process_guid process_hash process_id process_integrity_level
    #   process_name process_path user user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `windows_vulnerable_3cx_software_filter`
  condition: selection
level: medium
