title: Password Policy Enumerated
id: dd68a28a-3f44-4df7-8d82-196f49f9e069
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1201.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1201/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_password_policy_enumerated.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1201
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4661 # A handle to an object was requested.
          AccessList|contains: '%%5392' # ReadPasswordParameters
          ObjectServer: 'Security Account Manager'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
