title: Audit CVE Event
id: 6fa64d8d-8f30-4865-b385-c940d780890e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1203.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1203/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1203
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name:
              - 'Microsoft-Windows-Audit-CVE'
              - 'Audit-CVE'
          EventID: 1
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
