title: Indirect Inline Command Execution Via Bash.EXE
id: 4694f6ba-77b3-4b22-b0f9-018c4894a533
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1202.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bash_command_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1202
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - ':\Windows\System32\bash.exe'
                - ':\Windows\SysWOW64\bash.exe'
          - OriginalFileName: 'Bash.exe'
      selection_cli:
          CommandLine|contains: ' -c '
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
