title: HH.EXE Execution
id: cab42354-e5bd-457e-adeb-d052d3a51472
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_chm_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - OriginalFileName: 'HH.exe'
          - Image|endswith: '\hh.exe'
      selection_cli:
          CommandLine|contains: '.chm'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
