title: Remote Access Tool - AnyDesk Execution
id: 25796685-f911-4fb9-81b8-8e48b740bc2e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1219.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1219/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1219
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - Image|endswith:
                - '\AnyDesk.exe'
                - '\AnyDeskMSI.exe'
          - Description: AnyDesk
          - Product: AnyDesk
          - Company: AnyDesk Software GmbH
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
