title: HackTool - CACTUSTORCH Remote Thread Creation
id: 18fc84c2-3796-4278-97af-5e20c6874538
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/create_remote_thread/create_remote_thread_win_hktl_cactustorch.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.005
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          SourceImage|endswith:
              - '\System32\cscript.exe'
              - '\System32\wscript.exe'
              - '\System32\mshta.exe'
              - '\winword.exe'
              - '\excel.exe'
          TargetImage|contains: '\SysWOW64\'
          StartModule: null
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
