title: Process Access via TrolleyExpress Exclusion
id: 5b1adc53-e389-43e9-8d5c-ce3e03f4d2d5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.011.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/011/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_citrix_trolleyexpress_procdump.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.011
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          CommandLine|contains:
        # We assume that the lsass.exe process has a process ID that's between 700 and 999 and the dumper uses just the PID as parameter
              - '\TrolleyExpress 7'
              - '\TrolleyExpress 8'
              - '\TrolleyExpress 9'
              - '\TrolleyExpress.exe 7'
              - '\TrolleyExpress.exe 8'
              - '\TrolleyExpress.exe 9'
        # Common dumpers
              - '\TrolleyExpress.exe -ma '
      renamed:
          Image|endswith: '\TrolleyExpress.exe'
      filter_renamed:
          OriginalFileName|contains: 'CtxInstall'
      filter_empty:
          OriginalFileName: null
      condition: selection or ( renamed and not 1 of filter* )
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
