title: HTML Help HH.EXE Suspicious Child Process
id: 3248a3a5-d190-4517-875a-6fce8cc3bea9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.010.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/010/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hh_html_help_susp_child_process.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.010
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          ParentImage|endswith: '\hh.exe'
          Image|endswith:
              - '\CertReq.exe'
              - '\CertUtil.exe'
              - '\cmd.exe'
              - '\cscript.exe'
              - '\installutil.exe'
              - '\MSbuild.exe'
              - '\MSHTA.EXE'
              - '\msiexec.exe'
              - '\powershell.exe'
              - '\pwsh.exe'
              - '\regsvr32.exe'
              - '\rundll32.exe'
              - '\schtasks.exe'
              - '\wmic.exe'
              - '\wscript.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
