title: CMLUA Or CMSTPLUA UAC Bypass
id: 51b49269-51b4-41b4-a1b4-51b492690000
status: stable
description: Detection rule for MITRE ATT&CK technique T1218.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/cmlua_or_cmstplua_uac_bypass.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1218.003
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=7  ImageLoaded IN ("*\\CMLUA.dll", "*\\CMSTPLUA.dll",
    #   "*\\CMLUAUTIL.dll") NOT(process_name IN("CMSTP.exe", "CMMGR32.exe")) NOT(Image IN("*\\windows\\*",
    #   "*\\program files*")) | fillnull | stats count min(_time) as firstTime max(_time)
    #   as lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name
    #   process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists
    #   service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `cmlua_or_cmstplua_uac_bypass_filter`
  condition: selection
level: medium
