title: CMSTP Execution Process Creation
id: 50095014-b3cb-4320-aa6c-354767b987ea
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmstp_execution_by_creation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      # CMSTP Spawning Child Process
      selection:
          ParentImage|endswith: '\cmstp.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
