title: Microsoft Malware Protection Engine Crash
id: 38f6cf21-219e-4d8a-acae-f4c542d57958
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1211.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1211/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/application_error/win_application_error_msmpeng_crash.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1211
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name: 'Application Error'
          EventID: 1000
          Data|contains|all:
              - 'MsMpEng.exe'
              - 'mpengine.dll'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
