title: MSI Installation From Web
id: 3dedc0b5-978c-4d8d-8383-508d19e20ca6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1218/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/msiinstaller/win_msi_install_from_web.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1218
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name: 'MsiInstaller'
          EventID:
              - 1040
              - 1042
          Data|contains: '://'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
