title: AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl - File
id: 97fed3e5-55a8-4543-90ec-5dde5c941f2e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1216.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1216/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_winrm_awl_bypass.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1216
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      system_files:
          TargetFilename|endswith:
              - 'WsmPty.xsl'
              - 'WsmTxt.xsl'
      in_system_folder:
          TargetFilename|startswith:
              - 'C:\Windows\System32\'
              - 'C:\Windows\SysWOW64\'
      condition: system_files and not in_system_folder
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
