title: Launch-VsDevShell.PS1 Proxy Execution
id: 8daae00e-04d8-449f-a96e-2052a6395279
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1216.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1216/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_lolbin_launch_vsdevshell.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1216.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_script:
          CommandLine|contains: 'Launch-VsDevShell.ps1'
      selection_flags:
          CommandLine|contains:
              - 'VsWherePath '
              - 'VsInstallationPath '
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
