title: Adding Hidden File Attribute via Attrib
id: ad6c97c1-cef3-481d-a33c-817296e26061
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1222.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1222/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_adding_the_hidden_file_attribute_with_via_attribexe.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1222
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name: 'attrib.exe'
    process.args: '+h'
    process.parent.name:
      - 'cmd.exe'
      - 'draw.io.exe'
    process.command_line:
      - 'attrib  +R +H +S +A *.cui'
      - '*drawio.bkp*'
      - '*drawio.dtmp*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
