title: MSSQL Destructive Query
id: 6cd78d6c-c479-4969-90ab-3b3948bdf1f6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1485.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1485/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/mssqlserver/win_mssql_destructive_query.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1485
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name: 'MSSQLSERVER$AUDIT'
          EventID: 33205
          Data|contains:
              - 'statement:TRUNCATE TABLE'
              - 'statement:DROP TABLE'
              - 'statement:DROP DATABASE'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
