title: Portable Gpg.EXE Execution
id: d87cef05-ef15-48ca-ba86-ad0d70633745
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1486.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpg4win_portable_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1486
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - Image|endswith:
                - '\gpg.exe'
                - '\gpg2.exe'
          - OriginalFileName: 'gpg.exe'
          - Description: 'GnuPG’s OpenPGP tool'
      filter_main_legit_location:
          Image|contains:
              - ':\Program Files (x86)\GNU\GnuPG\bin\'
              - ':\Program Files (x86)\GnuPG VS-Desktop\'
              - ':\Program Files (x86)\GnuPG\bin\'
              - ':\Program Files (x86)\Gpg4win\bin\'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
