title: High Process Termination Frequency
id: 2d1997e9-2d19-4d19-ad19-2d1997e90000
status: stable
description: Detection rule for MITRE ATT&CK technique T1486
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/high_process_termination_frequency.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1486
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=5 | bin _time span=3s | stats values(process) as process
    #   values(process_exec) as process_exec values(process_guid) as process_guid values(process_id)
    #   as process_id values(process_name) as process_name values(process_path) as process_path
    #   values(user_id) as user_id min(_time) as firstTime max(_time) as lastTime count
    #   by _time dest EventCode ProcessID signature signature_id vendor_product | where
    #   count >= 15 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `high_process_termination_frequency_filter`
  condition: selection
level: medium
