title: Audit CVE Event
id: 1c1eabb4-c016-4b26-ac2c-6b6ad85eda2b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1499.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1499/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/microsoft-windows_audit_cve/win_audit_cve.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1499.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Provider_Name:
              - 'Microsoft-Windows-Audit-CVE'
              - 'Audit-CVE'
          EventID: 1
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
