title: Execution via MSSQL xp_cmdshell Stored Procedure
id: c541ce68-0d81-49f7-b529-8f820cbae666
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1505/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_via_xp_cmdshell_mssql_stored_procedure.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1505.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.parent.name: 'sqlservr.exe'
    process.name.caseless:
      - 'cmd.exe'
      - 'bitsadmin.exe'
    process.pe.original_file_name:
      - 'Cmd.Exe'
      - 'CertUtil.exe'
    process.command_line: '\'
    process.name: 'bitsadmin.exe'
    host.os.type: 'windows'
    event.category: 'process'
    event.type: 'start'
    process.args: '('
    C: '\SPAN4\DATA\RISKPARAM.SPN'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
