title: PowerShell Script Change Permission Via Set-Acl
id: 5edf608a-b02b-48b8-a3ac-8f119b29f0eb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1505/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_powershell_set_acl.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1505.005
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - OriginalFileName:
                - 'PowerShell.EXE'
                - 'pwsh.dll'
          - Image|endswith:
                - '\powershell.exe'
                - '\pwsh.exe'
      selection_cmdlet:
          CommandLine|contains|all:
              - 'Set-Acl '
              - '-AclObject '
              - '-Path '
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
