title: Security Tools Keyword Lookup Via Findstr.EXE
id: 789a2207-789a-489a-a89a-789a22070000
status: stable
description: Detection rule for MITRE ATT&CK technique T1518.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_security_keyword_lookup.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1518.001
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - Image|endswith:
    #               - '\find.exe'
    #               - '\findstr.exe'
    #         - OriginalFileName:
    #               - 'FIND.EXE'
    #               - 'FINDSTR.EXE'
    #     selection_cli:
    #         CommandLine|endswith:
    #             # Note: Add additional keywords to increase and enhance coverage
    #             # Note:
    #             #   We use the double quote variation because in cases of where the command is executed through cmd for example:
    #             #       cmd /c "tasklist | findstr virus"
    #             #   Logging utilties such as Sysmon would capture the end quote as part of findstr execution
    #             - ' avira'
    #             - ' avira"'
    #             - ' cb'
    #             - ' cb"'
    #             - ' cylance'
    #             - ' cylance"'
    #             - ' defender'
    #             - ' defender"'
    #             - ' kaspersky'
    #             - ' kaspersky"'
    #             - ' kes'
    #             - ' kes"'
    #             - ' mc'
    #             - ' mc"'
    #             - ' sec'
    #             - ' sec"'
    #             - ' sentinel'
    #             - ' sentinel"'
    #             - ' symantec'
    #             - ' symantec"'
    #             - ' virus'
    #             - ' virus"'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
