title: Security Tools Keyword Lookup Via Findstr.EXE
id: 909c9403-d27a-45c4-9c5b-90d9c765341a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1518.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1518/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_findstr_security_keyword_lookup.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1518.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - '\find.exe'
                - '\findstr.exe'
          - OriginalFileName:
                - 'FIND.EXE'
                - 'FINDSTR.EXE'
      selection_cli:
          CommandLine|endswith:
              # Note: Add additional keywords to increase and enhance coverage
              # Note:
              #   We use the double quote variation because in cases of where the command is executed through cmd for example:
              #       cmd /c "tasklist | findstr virus"
              #   Logging utilties such as Sysmon would capture the end quote as part of findstr execution
              - ' avira'
              - ' avira"'
              - ' cb'
              - ' cb"'
              - ' cylance'
              - ' cylance"'
              - ' defender'
              - ' defender"'
              - ' kaspersky'
              - ' kaspersky"'
              - ' kes'
              - ' kes"'
              - ' mc'
              - ' mc"'
              - ' sec'
              - ' sec"'
              - ' sentinel'
              - ' sentinel"'
              - ' symantec'
              - ' symantec"'
              - ' virus'
              - ' virus"'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
