title: PUA - Seatbelt Execution
id: 73b7d459-30c0-4373-a778-ec0551f65bc3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1526.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1526/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_seatbelt.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1526
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\Seatbelt.exe'
          - OriginalFileName: 'Seatbelt.exe'
          - Description: 'Seatbelt'
          - CommandLine|contains:
                # This just a list of the commands that will produce the least amount of FP in "theory"
                # Comment out/in as needed in your environment
                # To get the full list of commands see reference section
                - ' DpapiMasterKeys'
                - ' InterestingProcesses'
                - ' InterestingFiles'
                - ' CertificateThumbprints'
                - ' ChromiumBookmarks'
                - ' ChromiumHistory'
                - ' ChromiumPresence'
                - ' CloudCredentials'
                - ' CredEnum'
                - ' CredGuard'
                - ' FirefoxHistory'
                - ' ProcessCreationEvents'
                # - ' RDPSessions'
                # - ' PowerShellHistory'
      selection_group_list:
          CommandLine|contains:
              - ' -group=misc'
              - ' -group=remote'
              - ' -group=chromium'
              - ' -group=slack'
              - ' -group=system'
              - ' -group=user'
              - ' -group=all'
      selection_group_output:
          CommandLine|contains: ' -outputfile='
      condition: selection_img or all of selection_group_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
