title: Windows Network Access Suspicious desktop.ini Action
id: b2f6d2bb-4885-464e-aaf3-b7e6e5dee0f8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_net_share_obj_susp_desktop_ini.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.009
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 5145
          ObjectType: File
          RelativeTargetName|endswith: '\desktop.ini'
          AccessList|contains:
              - 'WriteData'
              - 'DELETE'
              - 'WriteDAC'
              - 'AppendData'
              - 'AddSubdirectory'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
