title: UEFI Persistence Via Wpbbin - ProcessCreation
id: d4ef18e9-5adf-4ecd-8815-39dff1c143e9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1542.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1542/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_wpbbin_potential_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1542.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image: 'C:\Windows\System32\wpbbin.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
