title: New DLL Added to AppInit_DLLs Registry Key
id: 15558c2e-94de-4735-a137-7dddd8d08ac8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.010.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/010/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_event/registry_event_new_dll_added_to_appinit_dlls_registry_key.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.010
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - TargetObject|endswith:
                - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls'
                - '\SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls'
          # Key Rename
          - NewName|endswith:
                - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls'
                - '\SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls'
      filter:
          Details: '(Empty)'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
