title: PowerShell Profile Modification
id: e4d81844-2f89-42e5-bca3-57b00fe45ae8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.013.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/013/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_powershell_profile.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.013
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          TargetFilename|endswith:
              - '\Microsoft.PowerShell_profile.ps1'
              - '\PowerShell\profile.ps1'
              - '\Program Files\PowerShell\7-preview\profile.ps1'
              - '\Program Files\PowerShell\7\profile.ps1'
              - '\Windows\System32\WindowsPowerShell\v1.0\profile.ps1'
              - '\WindowsPowerShell\profile.ps1'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
