title: Potential Ransomware or Unauthorized MBR Tampering Via Bcdedit.EXE
id: def3e593-c4fb-4232-9751-a371993b8805
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1542.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1542/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_bcdedit_susp_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1542.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\bcdedit.exe'
          - OriginalFileName: 'bcdedit.exe'
      selection_cli:
          CommandLine|contains:
              - 'delete'
              - 'deletevalue'
              - 'import'
              - 'safeboot'
              - 'network'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
