title: Suspicious WerFault Child Process
id: b5db1c75-34af-4668-a02f-77dd92dc94f5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.012.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/012/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_masquerading_suspicious_werfault_childproc.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546.012
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.parent.name: 'WerFault.exe'
    process.parent.args:
      - '-s'
      - '-t'
      - '-c'
    process.executable:
      - '?:\\Windows\\SysWOW64\\Initcrypt.exe'
      - '?:\\Program Files (x86)\\Heimdal\\Heimdal.Guard.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
