title: WMI Persistence - Security
id: 3a6771b4-2fb1-4861-ad7b-6d4083be991a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_wmi_persistence.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4662
          ObjectType: 'WMI Namespace'
          ObjectName|contains: 'subscription'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
