title: DLL Load via LSASS
id: 4117ea8d-2903-4d30-8ff5-5e973c21ac68
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.008.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/008/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_event/registry_event_susp_lsass_dll_load.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.008
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          TargetObject|contains:
              - '\CurrentControlSet\Services\NTDS\DirectoryServiceExtPt'
              - '\CurrentControlSet\Services\NTDS\LsaDbExtPt'
      filter_domain_controller:
          Image: 'C:\Windows\system32\lsass.exe'
          Details:
              - '%%systemroot%%\system32\ntdsa.dll'
              - '%%systemroot%%\system32\lsadb.dll'
      condition: selection and not 1 of filter_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
