title: Potential Privilege Escalation Using Symlink Between Osk and Cmd
id: c69d6b3a-6ebb-49ae-9022-7dff33da0984
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.008.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/008/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cmd_mklink_osk_cmd.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.008
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\cmd.exe'
          - OriginalFileName: 'Cmd.Exe'
      selection_cli:
          CommandLine|contains|all:
              - 'mklink'
              - '\osk.exe'
              - '\cmd.exe'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
