title: File Creation In Suspicious Directory By Msdt.EXE
id: efa0261c-4ebc-4d18-9b83-7e6051345af2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_msdt_susp_directories.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image|endswith: '\msdt.exe'
          TargetFilename|contains:
              - '\Desktop\'
              - '\Start Menu\Programs\Startup\'
              - 'C:\PerfLogs\'
              - 'C:\ProgramData\'
              - 'C:\Users\Public\'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
