title: Potential Suspicious Activity Using SeCEdit
id: dfcd51be-0c21-45ce-9d6c-4f4e30f5c548
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.014.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/014/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_secedit_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.014
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\secedit.exe'
          - OriginalFileName: 'SeCEdit'
      selection_flags_discovery:
          CommandLine|contains|all:
              - '/export'
              - '/cfg'
      selection_flags_configure:
          CommandLine|contains|all:
              - '/configure'
              - '/db'
      # filter:
      #     SubjectUserName|endswith: '$'  SubjectUserName is from event ID 4719 in the Windows Security log
      condition: selection_img and (1 of selection_flags_*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
