title: Startup/Logon Script Added to Group Policy Object
id: 5b5affdb-c362-4bae-916b-5621e754a70d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_group_policy_startup_script_added_to_gpo.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_eventid:
          EventID:
              - 5136
              - 5145
      selection_attributes_main:
          AttributeLDAPDisplayName:
              - 'gPCMachineExtensionNames'
              - 'gPCUserExtensionNames'
          AttributeValue|contains: '42B5FAAE-6536-11D2-AE5A-0000F87571E3'
      selection_attributes_optional:
          AttributeValue|contains:
              - '40B6664F-4972-11D1-A7CA-0000F87571E3'
              - '40B66650-4972-11D1-A7CA-0000F87571E3'
      selection_share:
          ShareName|endswith: '\SYSVOL'
          RelativeTargetName|endswith:
              - '\scripts.ini'
              - '\psscripts.ini'
          AccessList|contains: '%%4417'
      condition: selection_eventid and (all of selection_attributes_* or selection_share)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
