title: Windows Mark Of The Web Bypass
id: 12507016-1250-4250-a250-125070160000
status: stable
description: Detection rule for MITRE ATT&CK technique T1553.005
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_mark_of_the_web_bypass.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1553.005
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=23 TargetFilename = "*:Zone.Identifier" | stats count
    #   min(_time) as firstTime, max(_time) as lastTime by action dest dvc file_path file_hash
    #   file_name file_modify_time process_exec process_guid process_id process_name process_path
    #   signature signature_id user user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `windows_mark_of_the_web_bypass_filter`
  condition: selection
level: medium
