title: Uncommon Outbound Kerberos Connection
id: 6afe9f58-9b68-4481-83f9-c9212bc07093
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1550/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_susp_outbound_kerberos_connection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1550.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          DestinationPort: 88
          Initiated: 'true'
      filter_main_lsass:
          Image: 'C:\Windows\System32\lsass.exe'
      filter_optional_chrome:
          Image:
              - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
              - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
      filter_optional_firefox:
          Image:
              - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
              - 'C:\Program Files\Mozilla Firefox\firefox.exe'
      filter_optional_tomcat:
          Image|endswith: '\tomcat\bin\tomcat8.exe'
      condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
