title: HackTool - KrbRelayUp Execution
id: 28370594-bc62-4c1e-9024-3e6eb55b95bd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1550.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1550/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_hktl_krbrelayup.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1550.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\KrbRelayUp.exe'
          - OriginalFileName: 'KrbRelayUp.exe' # In case the file has been renamed after compilation
      selection_cli_1:
          CommandLine|contains|all:
              - ' relay '
              - ' -Domain '
              - ' -ComputerName '
      selection_cli_2:
          CommandLine|contains|all:
              - ' krbscm '
              - ' -sc '
      selection_cli_3:
          CommandLine|contains|all:
              - ' spawn '
              - ' -d '
              - ' -cn '
              - ' -cp '
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
