title: Renamed BOINC Client Execution
id: 1ed280a8-6741-405b-9e98-ecee944a7ebe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_renamed_boinc.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          OriginalFileName: 'BOINC.exe'
      filter_main_legit_name:
          Image|endswith: '\BOINC.exe'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
