title: HackTool - Typical HiveNightmare SAM File Export
id: 8e670842-44f6-49cf-a248-7efef0605388
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_hktl_hivenightmare_file_exports.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - TargetFilename|contains:
                - '\hive_sam_'  # Go version
                - '\SAM-2021-'  # C++ version
                - '\SAM-2022-'  # C++ version
                - '\SAM-2023-'  # C++ version
                - '\SAM-haxx'   # Early C++ versions
                - '\Sam.save'   # PowerShell version
          - TargetFilename: 'C:\windows\temp\sam'  # C# version of HiveNightmare
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
