title: HybridConnectionManager Service Installation
id: 09e6e73a-034c-4297-a972-c29ab1beb06d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1554.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1554/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_hybridconnectionmgr_svc_installation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1554
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4697
          ServiceName: HybridConnectionManager
          ServiceFileName|contains: HybridConnectionManager
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
