title: DPAPI Backup Keys And Certificate Export Activity IOC
id: 6842e939-e32c-4db5-88af-cacd1f697b88
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_dpapi_backup_and_cert_export_ioc.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          TargetFilename|contains:
              - 'ntds_capi_'
              - 'ntds_legacy_'
              - 'ntds_unknown_'
          TargetFilename|endswith:
              - '.cer'
              - '.key'
              - '.pfx'
              - '.pvk'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
