title: Suspicious Key Manager Access
id: 75b3c2f0-77c4-42b2-a5e4-16bc360aef20
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1555/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_rundll32_keymgr.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1555.004
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\rundll32.exe'
          - OriginalFileName: 'RUNDLL32.EXE'
      selection_cli:
          CommandLine|contains|all:
              - 'keymgr'
              - 'KRShowKeyMgr'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
