title: Potentially Suspicious EventLog Recon Activity Using Log Query Utilities
id: 2e987dd4-4904-470b-9cd1-23e878076c38
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_eventlog_content_recon.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_wmi:
          CommandLine|contains|all:
              - 'Select'
              - 'Win32_NTLogEvent'
      selection_wevtutil_img:
          - Image|endswith: '\wevtutil.exe'
          - OriginalFileName: 'wevtutil.exe'
      selection_wevtutil_cli:
          CommandLine|contains:
              - ' qe '
              - ' query-events '
      selection_wmic_img:
          - Image|endswith: '\wmic.exe'
          - OriginalFileName: 'wmic.exe'
      selection_wmic_cli:
          CommandLine|contains: ' ntevent'
      selection_cmdlet:
          CommandLine|contains:
              - 'Get-WinEvent '
              - 'get-eventlog '
      selection_logs_name:
          CommandLine|contains:
              # Note: Add more event log channels that are interesting for attackers
              - 'Microsoft-Windows-PowerShell'
              - 'Microsoft-Windows-Security-Auditing'
              - 'Microsoft-Windows-TerminalServices-LocalSessionManager'
              - 'Microsoft-Windows-TerminalServices-RemoteConnectionManager'
              - 'Microsoft-Windows-Windows Defender'
              - 'PowerShellCore'
              - 'Security'
              - 'Windows PowerShell'
      selection_logs_eid:
          CommandLine|contains:
              # Note: We use the "?" to account for both a single and a double quote
              # Note: Please add additional interesting event IDs
              # Note: As this only focuses on EIDs and we know EIDs are not unique across providers. Rare FPs might occur with legit queries to EIDs from different providers.
              # This covers EID 4624 and 4628 from Security Log
              - '-InstanceId 462?'
              - '.eventid -eq 462?'
              - '.ID -eq 462?'
              - 'EventCode=?462?'
              - 'EventIdentifier=?462?'
              - 'System[EventID=462?]'
              # This covers EID 4778 from Security Log
              - '-InstanceId 4778'
              - '.eventid -eq 4778'
              - '.ID -eq 4778'
              - 'EventCode=?4778?'
              - 'EventIdentifier=?4778?'
              - 'System[EventID=4778]'
              # This covers EID 25 from Microsoft-Windows-TerminalServices-LocalSessionManager/Operational log
              - '-InstanceId 25'
              - '.eventid -eq 25'
              - '.ID -eq 25'
              - 'EventCode=?25?'
              - 'EventIdentifier=?25?'
              - 'System[EventID=25]'
              # This covers EID 1149 from Microsoft-Windows-TerminalServices-RemoteConnectionManager/Operational log
              - '-InstanceId 1149'
              - '.eventid -eq 1149'
              - '.ID -eq 1149'
              - 'EventCode=?1149?'
              - 'EventIdentifier=?1149?'
              - 'System[EventID=1149]'
              # This covers EID 21 from Microsoft-Windows-TerminalServices-LocalSessionManager/Operational log
              - '-InstanceId 21'
              - '.eventid -eq 21'
              - '.ID -eq 21'
              - 'EventCode=?21?'
              - 'EventIdentifier=?21?'
              - 'System[EventID=21]'
              # This covers EID 22 from Microsoft-Windows-TerminalServices-LocalSessionManager/Operational log
              - '-InstanceId 22'
              - '.eventid -eq 22'
              - '.ID -eq 22'
              - 'EventCode=?22?'
              - 'EventIdentifier=?22?'
              - 'System[EventID=22]'
      condition: 1 of selection_logs_* and (selection_wmi or all of selection_wevtutil_* or all of selection_wmic_* or selection_cmdlet)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
