title: Windows Password Managers Discovery
id: 7d6424f7-540f-4539-bedb-4b8dad427e71
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1555.005.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1555/005/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_password_managers_discovery.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1555.005
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process:
      - '*dir'
      - '*findstr*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
