title: Suspicious Inter-Process Communication via Outlook
id: 068aff1f-f767-4b37-bc5b-6c66a940f27d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1559.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1559/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_email_outlook_mailbox_via_com.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1559.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name:
      - 'rundll32.exe'
      - 'wscript.exe'
      - 'OUTLOOK.EXE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
