title: DNS Query for Anonfiles.com Domain - DNS Client
id: e6426956-0c77-4d44-9afe-6ac4a4e0815c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1567.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1567/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/dns_client/win_dns_client_anonymfiles_com.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1567.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 3008
          QueryName|contains: '.anonfiles.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
