title: Hiding Files with Attrib.exe
id: 07ee836b-6ecc-4eec-9158-dd1d9a5294ef
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_attrib_hiding_files.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\attrib.exe'
          - OriginalFileName: 'ATTRIB.EXE'
      selection_cli:
          CommandLine|contains: ' +h '
      filter_main_msiexec:
          CommandLine|contains: '\desktop.ini '
      filter_optional_intel:
          ParentImage|endswith: '\cmd.exe'
          CommandLine: '+R +H +S +A \\\*.cui'
          ParentCommandLine: 'C:\\WINDOWS\\system32\\\*.bat'
      condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
