title: Sysmon Configuration Error
id: 79f4c66e-79f4-49f4-a9f4-79f4c66e0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1564
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/sysmon/sysmon_config_modification_error.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1564
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original sigma detection logic
    #     selection_error:
    #         Description|contains:
    #             - 'Failed to open service configuration with error'
    #             - 'Failed to connect to the driver to update configuration'
    #     filter_generic_english:
    #         Description|contains|all:
    #             - 'Failed to open service configuration with error'
    #             - 'Last error: The media is write protected.'
    #     filter_by_errorcode:
    #         Description|contains:
    #             - 'Failed to open service configuration with error 19'
    #             - 'Failed to open service configuration with error 93'
    #     condition: selection_error and not 1 of filter*
    # 
  condition: selection
level: medium
