title: Psexec Execution
id: 19eb7e41-3cd1-490c-8bf8-83c50ca11a0a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1569.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1569/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_sysinternals_psexec_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1569
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - Image|endswith: '\psexec.exe'
          - OriginalFileName: 'psexec.c'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
