title: Office Macro File Creation From Suspicious Process
id: 0ddb2183-0ddb-4ddb-addb-0ddb21830000
status: stable
description: Detection rule for MITRE ATT&CK technique T1566.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_office_macro_files_from_susp_process.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original sigma detection logic
    #     selection_cmd:
    #         - Image|endswith:
    #               - '\cscript.exe'
    #               - '\mshta.exe'
    #               - '\regsvr32.exe'
    #               - '\rundll32.exe'
    #               - '\wscript.exe'
    #         # Note: ParentImage is a custom field and is not available by default on Sysmon EID 11
    #         - ParentImage|endswith:
    #               - '\cscript.exe'
    #               - '\mshta.exe'
    #               - '\regsvr32.exe'
    #               - '\rundll32.exe'
    #               - '\wscript.exe'
    #     selection_ext:
    #         TargetFilename|endswith:
    #             - '.docm'
    #             - '.dotm'
    #             - '.xlsm'
    #             - '.xltm'
    #             - '.potm'
    #             - '.pptm'
    #     condition: all of selection_*
    # 
  condition: selection
level: medium
