title: ISO Image Mounted
id: 398b8366-ab33-4161-afdb-10219770c725
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_iso_mount.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1566.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4663
          ObjectServer: 'Security'
          ObjectType: 'File'
          ObjectName|startswith: '\Device\CdRom'
      filter_main_generic:
          ObjectName:
              - '\Device\CdRom0\autorun.ico'
              - '\Device\CdRom0\setup.exe'
              - '\Device\CdRom0\setup64.exe'
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
