title: Network Connection Initiated To BTunnels Domains
id: 59ca094b-e69e-4d3c-a710-d31ceb1130c6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1567.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1567/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/network_connection/net_connection_win_domain_btunnels.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1567
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Initiated: 'true'
          DestinationHostname|endswith: '.btunnel.co.in'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
