title: Suspicious Creation with Colorcpl
id: 125268be-c660-41ab-adf8-3b23db8f2b47
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_susp_colorcpl.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1564
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image|endswith: '\colorcpl.exe'
      filter_ext:
          TargetFilename|endswith:
              - '.icm'
              - '.gmmp'
              - '.cdmp'
              - '.camp'
      condition: selection and not 1 of filter_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
