title: Adobe Hijack Persistence
id: 2e19ebf3-e314-493a-942f-8e9c4818d384
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.010.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1574/010/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_adobe_hijack_persistence.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1574.010
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.path:
      - '?:\\Program Files (x86)\\Adobe\\Acrobat Reader DC\\Reader\\AcroCEF\\RdrCEF.exe'
      - '?:\\Program Files\\Adobe\\Acrobat Reader DC\\Reader\\AcroCEF\\RdrCEF.exe'
    process.name:
      - 'msiexec.exe'
      - 'AdobeARM.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
