title: Potential Suspicious Activity Using SeCEdit
id: e3ea9ed8-ebb0-4d67-bbf9-1a8e813ee72b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_secedit_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.007
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith: '\secedit.exe'
          - OriginalFileName: 'SeCEdit'
      selection_flags_discovery:
          CommandLine|contains|all:
              - '/export'
              - '/cfg'
      selection_flags_configure:
          CommandLine|contains|all:
              - '/configure'
              - '/db'
      # filter:
      #     SubjectUserName|endswith: '$'  SubjectUserName is from event ID 4719 in the Windows Security log
      condition: selection_img and (1 of selection_flags_*)
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
