title: Creation Exe for Service with Unquoted Path
id: 361f9574-f642-43ac-bc3d-233abb365b4c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.009.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/009/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_creation_unquoted_service_path.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.009
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          # Feel free to add more
          TargetFilename: 'C:\program.exe'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
