title: Connection to Commonly Abused Free SSL Certificate Providers
id: 5aef21e1-a820-4825-8dfb-8e608440ecdc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1573.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_encrypted_channel_freesslcert.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1573
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    dns.question.name:
      - '*letsencrypt.org'
      - '*.freessl.org'
    process.executable:
      - 'C:\\Windows\\System32\\*.exe'
      - 'C:\\Windows\\notepad.exe'
    process.name:
      - 'svchost.exe'
      - 'msedge.exe'
    C: '\\Windows\\System32\\*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
