title: Service Registry Key Read Access Request
id: be1f6e7d-77d8-42d7-8194-5a9caf4ffc82
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.011.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/011/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_registry_permissions_weakness_check.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.011
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 4663
          ObjectName|contains|all:
              - '\SYSTEM\'
              - 'ControlSet\Services\'
          AccessList|contains: '%%1538' # READ_CONTROL
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
