title: MSI Module Loaded by Non-System Binary
id: 2df93089-2df9-4df9-adf9-2df930890000
status: stable
description: Detection rule for MITRE ATT&CK technique T1574.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/msi_module_loaded_by_non_system_binary.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1574.002
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    # Original splunk detection logic
    # `sysmon` EventCode=7 ImageLoaded="*\\msi.dll" NOT (Image IN ("*\\System32\\*","*\\syswow64\\*","*\\windows\\*",
    #   "*\\winsxs\\*")) | fillnull | stats count min(_time) as firstTime max(_time) as
    #   lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name
    #   process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists
    #   service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)` | `msi_module_loaded_by_non_system_binary_filter`
  condition: selection
level: medium
