title: MSI Module Loaded by Non-System Binary
id: 4b750e84-2b84-4d88-92eb-50e18a1df557
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1574/002/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/msi_module_loaded_by_non_system_binary.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1574.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventCode: '7'
    ImageLoaded: '*\\msi.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
