title: Potential Initial Access via DLL Search Order Hijacking
id: e521b752-978e-474d-9aac-5a43051e8a59
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_initial_access_dll_search_order_hijacking.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image|endswith:
              # add more processes when you find them
              - '\winword.exe'
              - '\excel.exe'
              - '\powerpnt.exe'
              - '\MSACCESS.EXE'
              - '\MSPUB.EXE'
              - '\fltldr.exe'
              - '\cmd.exe'
              - '\certutil.exe'
              - '\mshta.exe'
              - '\cscript.exe'
              - '\wscript.exe'
              - '\curl.exe'
              - '\powershell.exe'
              - '\pwsh.exe'
          TargetFilename|endswith: '.dll'
          TargetFilename|contains|all:
              - '\Users\'
              - '\AppData\'
          TargetFilename|contains:
              # add more suspicious paths when you find them
              - '\Microsoft\OneDrive\'
              - '\Microsoft OneDrive\'
              - '\Microsoft\Teams\'
              - '\Local\slack\app-'
              - '\Local\Programs\Microsoft VS Code\'
      filter:
          Image|endswith: '\cmd.exe'
          TargetFilename|contains|all:
              - '\Users\'
              - '\AppData\'
              - '\Microsoft\OneDrive\'
              - '\api-ms-win-core-'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
