title: Cloudflared Tunnel Connections Cleanup
id: 24f50eb7-4234-4e70-b89e-3a6ed8b78328
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1572.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1572/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_cloudflared_tunnel_cleanup.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1572
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          CommandLine|contains|all:
              - ' tunnel '
              - 'cleanup '
          CommandLine|contains:
              - '-config '
              - '-connector-id '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
