title: Potential Unconstrained Delegation Discovery Via Get-ADComputer - ScriptBlock
id: d726f427-bb80-4621-82fb-9be8c4c144b7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1589.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1589/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_potential_unconstrained_delegation_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1589.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains:
              - '-Properties*TrustedForDelegation'
              - '-Properties*TrustedToAuthForDelegation'
              - '-Properties*msDS-AllowedToDelegateTo'
              - '-Properties*PrincipalsAllowedToDelegateToAccount'
              - '-LDAPFilter*(userAccountControl:1.2.840.113556.1.4.803:=524288)'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
