title: ProxyLogon MSExchange OabVirtualDirectory
id: 25feb15f-5047-4d8c-9ce5-0b0bdface5b8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1587.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1587/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/msexchange/win_exchange_proxylogon_oabvirtualdir.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1587.001
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      keywords_cmdlet:
          '|all':
              - 'OabVirtualDirectory'
              - ' -ExternalUrl '
      keywords_params:
          - 'eval(request'
          - 'http://f/<script'
          - '"unsafe"};'
          - 'function Page_Load()'
      condition: keywords_cmdlet and keywords_params
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
