title: Suspicious Git Clone
id: 617f1d64-c6c5-47a0-9fc8-453fb8f656b3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1593.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1593/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_git_susp_clone.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1593.003
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection_img:
          - Image|endswith:
                - '\git.exe'
                - '\git-remote-https.exe'
          - OriginalFileName: 'git.exe'
      selection_cli:
          CommandLine|contains:
              - ' clone '
              - 'git-remote-https '
      selection_keyword:
          CommandLine|contains:
              # Add more suspicious keywords
              - 'exploit'
              - 'Vulns'
              - 'vulnerability'
              - 'RemoteCodeExecution'
              - 'Invoke-'
              - 'CVE-'
              - 'poc-'
              - 'ProofOfConcept'
              # Add more vuln names
              - 'proxyshell'
              - 'log4shell'
              - 'eternalblue'
              - 'eternal-blue'
              - 'MS17-'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
