title: Failed DNS Zone Transfer
id: 5daf0ac1-c0a3-4c5b-b1d4-86f586eb0905
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1590.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1590/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/dns_server/win_dns_server_failed_dns_zone_transfer.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1590.002
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 6004 # The DNS server received a zone transfer request from %1 for a non-existent or non-authoritative zone %2.
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
