title: Suspicious GPO Discovery With Get-GPO
id: bb338d88-4db5-448d-ba00-53e6b1dd42ea
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1615.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1615/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_get_gpo.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1615
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          ScriptBlockText|contains: Get-GPO
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
