title: Gpresult Display Group Policy Information
id: d9bce6d5-1b5e-4b12-9a19-1087e5b6c484
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1615.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1615/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_gpresult_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1615
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          Image|endswith: '\gpresult.exe'
          CommandLine|contains:
              - '/z'
              - '/v'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
