title: PUA - Process Hacker Execution
id: 5adb01f0-8310-48f1-9758-251caf3819d5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1622.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1622/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_pua_process_hacker.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1622
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          - Image|contains: '\ProcessHacker_'
          - Image|endswith: '\ProcessHacker.exe'
          - OriginalFileName:
                - 'ProcessHacker.exe'
                - 'Process Hacker'
          - Description: 'Process Hacker'
          - Product: 'Process Hacker'
          - Hashes|contains:
                - 'MD5=68F9B52895F4D34E74112F3129B3B00D'
                - 'MD5=B365AF317AE730A67C936F21432B9C71'
                - 'SHA1=A0BDFAC3CE1880B32FF9B696458327CE352E3B1D'
                - 'SHA1=C5E2018BF7C0F314FED4FD7FE7E69FA2E648359E'
                - 'SHA256=D4A0FE56316A2C45B9BA9AC1005363309A3EDC7ACF9E4DF64D326A0FF273E80F'
                - 'SHA256=BD2C2CF0631D881ED382817AFCCE2B093F4E412FFB170A719E2762F250ABFEA4'
                - 'IMPHASH=3695333C60DEDECDCAFF1590409AA462'
                - 'IMPHASH=04DE0AD9C37EB7BD52043D2ECAC958DF'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
