title: Certificate Private Key Acquired
id: 9b47bdc0-96f6-4108-b3d5-281e390f5714
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1649.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1649/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/capi2/win_capi2_acquire_certificate_private_key.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1649
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
      selection:
          EventID: 70 # Acquire Certificate Private Key
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
