title: Windows EventLog Recon Activity Using Log Query Utilities
id: 2e4592be-5c03-408d-ab51-9a5f8041268a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1654.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1654/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_eventlog_recon_activity_using_log_query_utilities.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1654
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    datamodel: 'Endpoint.Processes'
    process_name:
      - 'wevtutil.exe'
      - 'wmic.exe'
    original_file_name:
      - 'wevtutil.exe'
      - 'wmic.exe'
    process:
      - '*Win32_NTLogEvent*'
      - '*EventCode*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
