title: Security Account Manager - Akira (defender)
id: a1b1d6bf-1f1f-4112-8b2f-6d084f57dd88
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.002 (Security Account Manager).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1003/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_copy_ntds_sam_volshadowcp_cmdline.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.002
  - actor.akira
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'esentutl.exe'
    process.args|contains:
      - '*/y*'
      - '*/d*'
    process.pe.original_file_name|contains: 'esentutl.exe'
    process.command_line|contains:
      - '*\\ntds.dit*'
      - '*\\User Data\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
