title: Local Groups - Akira (defender)
id: 0f17b8c5-6a7d-4d15-b395-580989874cb4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.001 (Local Groups).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_admin_recon.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.001
  - actor.akira
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'wmic.exe'
    process.parent.name|contains: 'net.exe'
    process.args|contains:
      - 'group'
      - 'useraccount'
    user.id|contains:
      - 'S-1-5-18'
      - 'S-1-5-20'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
