title: Windows Credential Manager - Akira (defender)
id: 34f7bfc4-921f-41f1-97ff-88f1bc8010fc
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1555.004 (Windows Credential Manager).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1555/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_credential_dumping_msbuild.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1555.004
  - actor.akira
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'MSBuild.exe'
    event.action|contains: 'Image loaded*'
    dll.name|contains:
      - 'vaultcli.dll'
      - 'SAMLib.DLL'
    file.name|contains:
      - 'vaultcli.dll'
      - 'SAMLib.DLL'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
