title: Disable Windows Event Logging - Akira (defender)
id: 8bdefabe-d484-4447-9869-ae1cadd79d1a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562.002 (Disable Windows Event Logging).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1562/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_audit_policy_disabled_winlog.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562.002
  - actor.akira
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.code|contains: '4719'
    host.os.type|contains: 'windows'
    winlog.event_data.AuditPolicyChangesDescription|contains: 'Success removed'
    winlog.event_data.SubCategory|contains: 'Logon'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
