title: Windows Command Shell (WINDOWS - sysmon)
id: 058194d1-da0f-4963-8a78-c8e5c1d9dd30
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.003.
  Threat Actor: DORRRA
references:
  - https://attack.mitre.org/techniques/T1059.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\cmd.exe'
    CommandLine|contains|all|contains:
      - 'http'
      - '://'
      - '%AppData%'
    CommandLine|contains|contains:
      - '<'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.003
  - actor.dorrra
