title: Lateral Tool Transfer (WINDOWS - sysmon)
id: c32080f9-8960-432a-b614-120889705ce0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: BlackByte
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.blackbyte
