title: Hijack Execution Flow - AvosLocker (workspace)
id: 86151b98-9f18-489f-8e81-5775069441e1
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1574 (Hijack Execution Flow).
  Associated threat actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1574/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_ld_preload_env_variable_process_injection.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1574
  - actor.avoslocker
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.env_vars|contains:
      - 'LD_PRELOAD=?*'
      - 'LD_LIBRARY_PATH=?*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
