title: LSASS Memory (WINDOWS)
id: 97f27a23-3835-4978-b5d1-efd4cffd0b0c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.001.
references:
  - https://attack.mitre.org/techniques/T1003.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.001
