title: Exfiltration Over Unencrypted Non-C2 Protocol (WINDOWS - sysmon)
id: c85b1481-f735-422a-9954-516b2da709c8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1048.003.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1048.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\svchost.exe'
    ParentCommandLine|contains|contains:
      - '-s WebClient'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1048.003
  - actor.kazu
