title: Process Hollowing (WINDOWS - sysmon)
id: 729c7249-a45c-4ce9-933b-10c025fc1957
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.012.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1055.012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\svchost.exe'
    CommandLine|re|contains:
      - '-k\s\w{1,64}(\s?(-p|-s))?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.012
  - actor.kazu
