title: Service Execution (WINDOWS - sysmon)
id: f0ae655e-8269-4a65-9505-602e5165b06a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1569.002.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1569.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' start '
    Image|endswith|contains:
      - '\csexec.exe'
    Description|contains:
      - 'csexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1569.002
  - actor.kazu
