title: Archive via Utility (WINDOWS - sysmon)
id: fd558005-66fd-4844-a2ca-dd32c2ed34d9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' user '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.kazu
