title: Obfuscated Files or Information - Hunters International (security)
id: 47c341a4-6eb6-4b17-be0d-686f7e38345b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027 (Obfuscated Files or Information).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_invoke_obfuscation_clip_services_security.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027
  - actor.hunters_international
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cmd'
      - '&&'
      - 'clipboard]::'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
