title: Domain Groups - Hunters International (security)
id: 75f7e1f1-3d71-4b5a-9086-46d2075b55ce
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1069.002 (Domain Groups).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1069/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_net_recon_activity.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1069.002
  - actor.hunters_international
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4661'
    AccessMask|contains:
      - '0x2d'
      - 'SAM_USER'
      - 'SAM_GROUP'
    ObjectName|contains:
      - 'S-1-5-21-'
      - '-500'
      - '-512'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
