title: Impair Defenses - Hunters International (security)
id: 7d0611af-8a41-44d9-8b10-79a7d610d9e6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1562 (Impair Defenses).
  Associated threat actor: Hunters International
references:
  - https://attack.mitre.org/techniques/T1562/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/object_access/win_security_wfp_endpoint_agent_blocked.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1562
  - actor.hunters_international
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5157'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
