title: Network Sniffing (MACOS - unified_logging)
id: 288f53f2-8bc0-41ad-ba83-67543efa5fb5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1040.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1040/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/tcpdump'
      - '/tshark'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1040
  - actor.kimsuky
