title: Windows Service (WINDOWS - defender)
id: 2e6a5d51-d487-4fb5-891d-fe41ab430734
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: DarkVishnya
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '-SecurityDescriptorSddl '
      - '-sd '
    CommandLine|contains|all|contains:
      - 'New-Service'
      - '-BinaryPathName'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.darkvishnya
