title: Data Staged - DoNex (workspace)
id: 4d9ce25b-e214-4204-9bf7-8d8ce2559ee9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1074 (Data Staged).
  Associated threat actor: DoNex
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1074
  - actor.donex
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category|contains: 'iam'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
