title: System Network Connections Discovery (MACOS - unified_logging)
id: db4b73e2-4ed4-4a53-baf6-da6483ca8d78
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.brain_cipher
