title: Malicious Link (MACOS - unified_logging)
id: 5729ed8f-96ce-4fd2-aba1-0a9410cdf570
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.001.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1204.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.001
  - actor.brain_cipher
