title: Web Services (MACOS - unified_logging)
id: 246ba8d4-b75c-481a-96b8-a491bce890fc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1583.006.
  Threat Actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1583.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1583.006
  - actor.brain_cipher
