title: Clipboard Data - Yashma-Ator-Vietnamita (auditd)
id: 68174bd4-8e67-4061-8e42-84935dd47f32
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1115 (Clipboard Data).
  Associated threat actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_clipboard_collection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1115
  - actor.yashma-ator-vietnamita
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'EXECVE'
    a0|contains:
      - 'xclip'
      - '-selection'
      - '-sel'
      - 'clipboard'
      - 'clip'
    a3|contains: '-o'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
