title: Binary Padding (LINUX - auditd)
id: 5dac6137-a46e-472f-99c3-5c04a2a7edb4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.001.
  Threat Actor: BRONZE BUTLER
references:
  - https://attack.mitre.org/techniques/T1027.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    |all|contains:
      - 'truncate'
      - '-s'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.001
  - actor.bronze_butler
