title: OS Credential Dumping (WINDOWS)
id: c5780fdf-f174-4d18-8241-9ba37ba2d12a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
