title: Software Deployment Tools (WINDOWS - security)
id: e2dd7e5a-8c03-4e39-a6ce-b41edc1db85c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.medusa
