title: Valid Accounts (WINDOWS - security)
id: 61f70a9c-f4c0-4f99-8b8d-ec57cf40be6a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.medusa
