title: Domain Account (WINDOWS - security)
id: c8b9228b-5ef3-44d3-ad43-6f6e5af5f38f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.medusa
