title: Data Encrypted for Impact (WINDOWS - security)
id: 15247c79-3acd-4483-8c30-bac44a8e7e66
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1486.
  Threat Actor: DFIR Report
references:
  - https://attack.mitre.org/techniques/T1486/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|contains|contains:
      - ':\Program Files (x86)\GNU\GnuPG\bin\'
      - ':\Program Files (x86)\GnuPG VS-Desktop\'
      - ':\Program Files (x86)\GnuPG\bin\'
    CommandLine|contains|all|contains:
      - 'REG'
      - 'ADD'
      - '\SOFTWARE\Policies\Microsoft\FVE'
    CommandLine|contains|contains:
      - 'EnableBDEWithNoTPM'
      - 'UseAdvancedStartup'
      - 'UseTPM'
    OriginalFileName|contains:
      - 'gpg.exe'
    Image|endswith|contains:
      - '\gpg.exe'
      - '\gpg2.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1486
  - actor.dfir_report
