title: Masquerading - SafeLocker (unified_logging)
id: 68b62c3e-2601-4c3b-bcf6-6a760d7f3888
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1036 (Masquerading).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1036/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_potential_processherpaderping.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1036
  - actor.safelocker
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.parent.executable|contains:
      - '?:\\Windows\\SoftwareDistribution\\*.exe'
      - '?:\\Program Files (x86)\\Trend Micro\\*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
