title: Data Transfer Size Limits - SafeLocker (unified_logging)
id: 45bbde16-1a32-4677-8e18-05a394098fd4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1030 (Data Transfer Size Limits).
  Associated threat actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1030/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_split_file_into_pieces.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1030
  - actor.safelocker
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/split'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
