title: Masquerade Task or Service (WINDOWS - security)
id: 0da3f723-abfa-4454-b590-542feb4194cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: APT-C-36
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.apt-c-36
