title: Inhibit System Recovery (WINDOWS - sysmon)
id: c26b1a7c-4001-4c26-acd6-9b6e1a738bb2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1490.
  Threat Actor: Beast
references:
  - https://attack.mitre.org/techniques/T1490/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1490
  - actor.beast
