title: External Remote Services - UNC2165 (auditd)
id: 2470cd54-6fd4-40ed-88aa-e4d9b4addd85
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1133 (External Remote Services).
  Associated threat actor: UNC2165
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_ssh_connection_established_inside_a_container.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1133
  - actor.unc2165
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    container.id|contains: '*'
    process.entry_leader.entry_meta.type|contains: 'sshd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
