title: DCSync - Ignoble Scorpius (defender)
id: 64ddc2ce-404f-44f4-b1a2-07c95998c352
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.006 (DCSync).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1003/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_dcsync_newterm_subjectuser.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.006
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    event.code|contains: '4662'
    host.os.type|contains: 'windows'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
