title: File and Directory Discovery - Ignoble Scorpius (defender)
id: bc0adecb-89b1-4d2c-8821-c2f790f28bb6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_file_dir_discovery.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'tree.com'
    process.args|contains: 'dir'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
