title: Inhibit System Recovery - Ignoble Scorpius (defender)
id: 2cd3bc2e-f5e1-4da1-9702-fe89a48f9170
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1490 (Inhibit System Recovery).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1490/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/impact_backup_file_deletion.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1490
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    file.extension|contains: 'BKF'
    process.executable|contains:
      - '?:\\Program Files\\Veritas\\Backup Exec\\*'
      - '?:\\Program Files (x86)\\Veritas\\Backup Exec\\*'
    process.code_signature.subject_name|contains: 'Microsoft Corporation'
    process.name|contains:
      - 'MSExchangeMailboxAssistants.exe'
      - 'Microsoft.PowerBI.EnterpriseGateway.exe'
    file.path|contains:
      - '?:\\ProgramData\\Trend Micro\\*'
      - '?:\\$RECYCLE.BIN\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
