title: Kerberoasting - Ignoble Scorpius (defender)
id: 0d9e73d3-8b37-4695-a488-020cff28e69e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1558.003 (Kerberoasting).
  Associated threat actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1558/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/credential_access_posh_request_ticket.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1558.003
  - actor.ignoble_scorpius
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
