title: Rootkit - SafePay (sysmon)
id: 67f0784d-4d96-4c38-9076-42fd520f3233
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1014 (Rootkit).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1014
  - actor.safepay
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
