title: Network Share Discovery - SafePay (sysmon)
id: a7754405-5f8f-407b-839d-6531dc62e155
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1135 (Network Share Discovery).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1135/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/discovery_posh_invoke_sharefinder.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1135
  - actor.safepay
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Invoke-ShareFinder'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
