title: Code Signing - SafePay (sysmon)
id: 943e8084-9310-4763-ae69-99f37e188fd5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1553.002 (Code Signing).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1553/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_cve_2020_0601.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1553.002
  - actor.safepay
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    event.provider|contains: 'Microsoft-Windows-Audit-CVE'
    message|contains: '[CVE-2020-0601]'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
