title: Windows Command Shell - Rhysida (defender)
id: 15ac9d0c-210c-4fdc-8b08-f14f49f0ac88
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.003 (Windows Command Shell).
  Associated threat actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1059/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_execution_msbuild_started_by_script.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.003
  - actor.rhysida
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name.caseless|contains: 'msbuild.exe'
    process.pe.original_file_name|contains: 'MSBuild.exe'
    process.parent.name|contains: 'cmd.exe'
    process.executable|contains: 'C:\\Program Files\\Microsoft Visual Studio\\2022\\Professional\\MSBuild\\Current\\Bin\\MSBuild.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
