title: Service Execution (WINDOWS - security)
id: 44e190b9-e07d-42bf-b501-cd10bd0aac60
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1569.002.
  Threat Actor: Hunt-Dharma-Crysis
references:
  - https://attack.mitre.org/techniques/T1569.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|all|contains:
      - 'ADMIN$'
      - '.exe'
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
    ServiceFileName|re|contains:
      - '^%systemroot%\\[a-zA-Z]{8}\.exe$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1569.002
  - actor.hunt-dharma-crysis
