title: Process Discovery (LINUX - auditd)
id: 4a5c034e-5814-4245-9f04-93690eafbe1c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: APT37
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.apt37
