title: Phishing (M365)
id: 14db6166-0811-42af-97bf-3a7d6cba6350
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    AttachmentExtension|in:
      - 'exe'
      - 'dll'
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
