title: Timestomp (LINUX - auditd)
id: d97d5aa6-7045-4fd1-a315-a671c4863da0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.006.
  Threat Actor: KageNoHitobito
references:
  - https://attack.mitre.org/techniques/T1070.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    touch|contains:
      - 'touch'
    Image|endswith|contains:
      - '/touch'
    CommandLine|contains|contains:
      - ' -t '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.006
  - actor.kagenohitobito
