title: Security Account Manager (WINDOWS - defender)
id: bd6b9ea0-2e2e-475b-96d7-e3bfdf188d16
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.002.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1003.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'mklink'
      - 'HarddiskVolumeShadowCopy'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
    CommandLine|contains|contains:
      - '::aadcookie'
      - '::detours'
      - '::memssp'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.002
  - actor.wizard_spider
