title: Process Injection (WINDOWS - defender)
id: e278baf6-5f76-4f1a-b3e6-0566ccea9025
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1055/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\CoercedPotato.exe'
    CommandLine|contains:
      - 'dllhost.exe'
      - 'dllhost'
    CommandLine|contains|contains:
      - ' --exploitId '
    CommandLine|contains|all|contains:
      - ' /am51'
      - ' /password'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055
  - actor.wizard_spider
