title: Domain Account (WINDOWS - defender)
id: c372ccee-5e34-4b24-896f-fcad1adfcdb5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.002.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1087.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' group '
      - ' localgroup '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.002
  - actor.wizard_spider
