title: LLMNR/NBT-NS Poisoning and SMB Relay (WINDOWS - defender)
id: a7849bb7-1880-459c-bdcd-79f8cbb3bb94
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1557.001.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1557.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' --adcs '
      - ' --port '
    Image|contains|contains:
      - 'PetitPotam'
      - 'RottenPotato'
      - 'HotPotato'
    CommandLine|contains|contains:
      - 'Invoke-Tater'
      - ' smbrelay'
      - ' ntlmrelay'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1557.001
  - actor.wizard_spider
