title: Data Encrypted for Impact - 0mega (unified_logging)
id: 6b8cddf1-e51b-439d-8a8c-c9c6f420e4dc
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1486 (Data Encrypted for Impact).
  Associated threat actor: 0mega
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/impact_potential_linux_ransomware_file_encryption.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1486
  - actor.0mega
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    file.extension|contains: '?*'
    process.executable|contains:
      - './*'
      - '/run/*'
    file.path|contains:
      - '/home/*/Downloads/*'
      - '/var/www/*'
    process.name|contains:
      - 'dpkg'
      - 'suldownloader'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
