title: Security Software Discovery (MACOS - unified_logging)
id: 24601531-8e5b-419a-88df-2561f5496d45
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/csrutil'
    CommandLine|contains|contains:
      - 'nessusd'
      - 'santad'
      - 'CbDefense'
    Image|contains:
      - '/usr/bin/grep'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.shinra
