title: Network Sniffing (WINDOWS - sysmon)
id: 2f676e7f-a982-4a0a-a2ee-2b157638be94
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1040.
  Threat Actor: Kimsuky
references:
  - https://attack.mitre.org/techniques/T1040/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'wlan'
      - ' s'
      - ' p'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1040
  - actor.kimsuky
