title: Command and Scripting Interpreter - Interlock (auditd)
id: 278c9f0e-c9c4-44b9-bb31-9ce5d1fc2039
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059 (Command and Scripting Interpreter).
  Associated threat actor: Interlock
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_bpfdoor_file_accessed.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059
  - actor.interlock
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/var/run/haldrund.pid'
      - '/var/run/xinetd.lock'
      - '/var/run/kdevrund.pid'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
