title: Web Shell (WINDOWS - defender)
id: 05d0f38d-cd85-4ef8-8d84-8e59c1c81f9f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1505.003.
  Threat Actor: Volatile Cedar
references:
  - https://attack.mitre.org/techniques/T1505.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'install'
      - 'module'
    ParentImage|endswith|contains:
      - '\sqlservr.exe'
    Image|endswith|contains:
      - '\bash.exe'
      - '\bitsadmin.exe'
      - '\cmd.exe'
    CommandLine|contains|contains:
      - '&ipconfig&echo'
      - '&quser&echo'
      - '&whoami&echo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1505.003
  - actor.volatile_cedar
