title: Domain Trust Discovery (GOOGLE - workspace)
id: c813a467-11a6-4532-9bb2-a8a4f3bed193
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1482.
  Threat Actor: Hive
references:
  - https://attack.mitre.org/techniques/T1482/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Actor|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1482
  - actor.hive
