title: Data Staged - PEAR (entra_id)
id: f8df0da1-39eb-4fd9-bc4b-a6e8c5da3056
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1074 (Data Staged).
  Associated threat actor: PEAR
references:
  - https://attack.mitre.org/techniques/T1074/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/collection_google_drive_ownership_transferred_via_google_workspace.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1074
  - actor.pear
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    event.dataset|contains: 'google_workspace.admin'
    event.action|contains: 'CREATE_DATA_TRANSFER_REQUEST'
    event.category|contains: 'iam'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
