title: Data from Network Shared Drive (WINDOWS - security)
id: 08c1e90e-99f4-449f-b147-4d2f687e747f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1039.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1039/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    RelativeTargetName|endswith|contains:
      - '.bak'
      - '.dmp'
      - '.edb'
    CommandLine|contains|contains:
      - '\\\\*\\*$'
      - '\Sysvol\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1039
  - actor.vect_raas
