title: Ingress Tool Transfer - ALPHV-BlackCat (security)
id: a67d4202-2c4c-44d8-86e3-f9158524fcdf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1105 (Ingress Tool Transfer).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_susp_opened_encrypted_zip_filename.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1105
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5379'
    TargetName|contains:
      - 'Microsoft_Windows_Shell_ZipFolder:filename'
      - 'invoice'
      - 'new order'
      - 'rechnung'
      - 'factura'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
