title: Create Process with Token - ALPHV-BlackCat (security)
id: a63b5682-6057-43a3-a903-7257c0ae7d4f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134.002 (Create Process with Token).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1134/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_meterpreter_or_cobaltstrike_getsystem_service_install.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134.002
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - '/c'
      - 'echo'
      - '\pipe\'
      - 'cmd'
    ServiceFileName|contains: '\\\\127.0.0.1\\ADMIN$\'  # https://twitter.com/svch0st/status/1413688851877416960?lang=en'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
