title: Exploit Public-Facing Application - ALPHV-BlackCat (security)
id: c4254a9c-e187-4389-ac53-4a53b285f97d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1190 (Exploit Public-Facing Application).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_failed_logon_source.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1190
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4625'
    IpAddress|contains:
      - '-'
      - '10.0.0.0/8'
      - '127.0.0.0/8'
      - '172.16.0.0/12'
      - '192.168.0.0/16'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
