title: Indirect Command Execution - ALPHV-BlackCat (security)
id: d27d76ae-574d-4fd5-b0a9-277fa9a2350b
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1202 (Indirect Command Execution).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_indirect_exec_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1202
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'conhost.exe'
    process.args|contains: '--headless'
    process.command_line|contains:
      - '*powershell*'
      - '*mhsta*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
