title: Windows Service - ALPHV-BlackCat (security)
id: 0c62f0e7-c718-40b9-8e79-f2afc47cbb86
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1543.003 (Windows Service).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1543/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1543.003
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'ADMIN$'
      - '.exe'
      - '%COMSPEC%'
      - 'start'
    ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
