title: LLMNR/NBT-NS Poisoning and SMB Relay - ALPHV-BlackCat (security)
id: c93bc18b-5ae0-4382-a2db-4fa6da85728e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1557.001 (LLMNR/NBT-NS Poisoning and SMB Relay).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1557/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/account_management/win_security_susp_rottenpotato.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1557.001
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4624'
    LogonType|contains: '3'
    TargetUserName|contains: 'ANONYMOUS LOGON'
    WorkstationName|contains:
      - '-'
      - '127.0.0.1'
      - '::1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
