title: Service Execution - ALPHV-BlackCat (security)
id: a1541ec6-d306-42c1-8174-5d411f416f61
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1569.002 (Service Execution).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1569/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_cobaltstrike_service_installs.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1569.002
  - actor.alphv-blackcat
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'ADMIN$'
      - '.exe'
      - '%COMSPEC%'
      - 'start'
    ServiceFileName|contains: 'powershell -nop -w hidden -encodedcommand'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
