title: Web Shell - BianLian (sysmon)
id: 86cc98e0-339c-4329-b29b-6f424ea5eb64
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505.003 (Web Shell).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_shell_activity_by_web_server.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505.003
  - actor.bianlian
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'apache'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
