title: Phishing - BianLian (sysmon)
id: 790fa8aa-b287-4b59-a799-da449e0ba418
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566 (Phishing).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1566/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/google_workspace/initial_access_object_copied_to_external_drive_with_app_consent.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566
  - actor.bianlian
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    google_workspace.drive.file.type|contains:
      - 'script'
      - 'document'
    google_workspace.token.client.id|contains: '*apps.googleusercontent.com'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
