title: Visual Basic (M365)
id: fd5c8585-5c7a-46e4-b2f7-276c8b01cd4a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.005.
references:
  - https://attack.mitre.org/techniques/T1059.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.005
