title: 2fee9321-3e71-4cf4-af24-d4d40d355b34 (WINDOWS)
id: cd4d4395-dead-4eaa-a315-8f9c4490a26d
description: >
  Detects techniques consistent with MITRE ATT&CK technique 2fee9321-3e71-4cf4-af24-d4d40d355b34.
references:
  - https://attack.mitre.org/techniques/2fee9321-3e71-4cf4-af24-d4d40d355b34/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.2fee9321-3e71-4cf4-af24-d4d40d355b34
