title: Regsvr32 (GOOGLE - workspace)
id: 55600fdd-5b85-409e-bb70-0bf619b98ac8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.010.
  Threat Actor: Ignoble Scorpius
references:
  - https://attack.mitre.org/techniques/T1218.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.010
  - actor.ignoble_scorpius
