title: Process Discovery (LINUX - auditd)
id: 1603a7fd-7c03-4be6-884a-0457b7f90d96
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: Stealth Falcon
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    SYSCALL|contains:
      - 'sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.stealth_falcon
