title: Dynamic-link Library Injection - PEAR (security)
id: 1a3d1294-a620-4024-ab04-760008b31053
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1055.001 (Dynamic-link Library Injection).
  Associated threat actor: PEAR
references:
  - https://attack.mitre.org/techniques/T1055/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_posh_assembly_load.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1055.001
  - actor.pear
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'reflection.assembly]::Load('System.'
    file.name|contains: 'PathFunctions.ps1'
    user.id|contains: 'S-1-5-18'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
