title: Native API (WINDOWS - security)
id: b858a86b-23d9-4eb2-955c-34838cd565fc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1106.
  Threat Actor: Higaisa
references:
  - https://attack.mitre.org/techniques/T1106/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'Offline_Winpwn'
      - 'WinPwn '
      - 'WinPwn.exe'
    Image|endswith|contains:
      - '\rundll32.exe'
      - '\cmd.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1106
  - actor.higaisa
