title: LSA Secrets (WINDOWS - security)
id: 5c482f1f-6490-482f-a005-d5f25f1a67f8
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.apt29
