title: LSA Secrets (WINDOWS - security)
id: a72cff08-b8c6-41d2-be0c-d742d34c6229
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.apt29
