title: External Remote Services (WINDOWS - security)
id: d3a84e81-fead-47eb-af4f-455c178d5a8f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.apt29
