title: Steal Application Access Token (WINDOWS - security)
id: 16f3d121-2b54-4dce-a245-9eb2735ef9b5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1528.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1528/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|contains|contains:
      - '\Microsoft\Teams\Cookies'
      - '\Microsoft\Teams\Local Storage\leveldb'
    OriginalFileName|contains:
      - 'BrowserCore.exe'
    Image|endswith|contains:
      - '\BrowserCore.exe'
    CommandLine|contains|contains:
      - 'eyJ0eXAiOi'
      - 'eyJhbGciOi'
      - ' eyJ0eX'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1528
  - actor.apt29
