title: Windows Management Instrumentation Event Subscription (WINDOWS - security)
id: c2709e74-ec10-4ba5-a1b7-816b95445a98
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.003.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1546.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'WMI Namespace'
    ParentImage|endswith|contains:
      - '\EdgeTransport.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.003
  - actor.apt29
