title: Remote Desktop Software - SafePay (auditd)
id: efc0bcd0-4e4e-489b-b5e3-9172c7fbad39
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1219.002 (Remote Desktop Software).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1219/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_ssm_agent_abuse.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1219.002
  - actor.safepay
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    exe|contains:
      - '/amazon-ssm-agent'
      - '-register '
      - '-code '
      - '-id '
      - '-region '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
