title: Data Destruction - SafePay (auditd)
id: 1c77d062-bc5b-45eb-a719-3079cd7ba794
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1485 (Data Destruction).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1485/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_dd_delete_file.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1485
  - actor.safepay
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'EXECVE'
    a0|contains:
      - 'dd'
      - 'if=/dev/null'
      - 'if=/dev/zero'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
