title: Masquerade Task or Service (WINDOWS - sysmon)
id: 45338f31-794d-47a8-813b-0a096e2817ae
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Wizard Spider
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.wizard_spider
