title: Scheduled Task/Job - Brain Cipher (entra_id)
id: d1c94d83-b131-453e-8435-e3dc6700a11e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053 (Scheduled Task/Job).
  Associated threat actor: Brain Cipher
references:
  - https://attack.mitre.org/techniques/T1053/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_cron_jobs_creation_and_runtime.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053
  - actor.brain_cipher
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.args|contains: '-l'
    process.name|contains: 'running job'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
