title: NTDS (WINDOWS - security)
id: a0211bef-3ce3-4482-a5c0-10d456c44ac1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
    CommandLine|contains|all|contains:
      - 'mklink'
      - 'HarddiskVolumeShadowCopy'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.blacksuit
