title: Valid Accounts (WINDOWS - security)
id: 09a039cd-51bc-4b81-a457-dca657ad8a67
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.blacksuit
