title: Clear Windows Event Logs (WINDOWS - security)
id: 6c23b8f7-4b72-4585-abea-9761d8df0484
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Provider_Name|contains:
      - 'Security'
    CommandLine|contains|contains:
      - 'clear-log '
      - ' cl '
      - 'set-log '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
  - actor.blacksuit
