title: Hide Artifacts (WINDOWS - security)
id: a6d093a0-fa7b-4f9e-a833-c138bcdd8bb5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.blacksuit
