title: Remote Access Tools (WINDOWS - sysmon)
id: 10f1d6ab-65fe-4fbd-b1d5-860ce5f7c2eb
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|contains|contains:
      - '\TacticalAgent\tacticalrmm.exe'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|endswith|contains:
      - '\Velociraptor.exe'
    CommandLine|endswith|contains:
      - '.exe tunnel'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219
  - actor.oilrig
