title: Spearphishing Attachment (WINDOWS - sysmon)
id: 94c241fd-19d8-43dc-8d50-4c78596045f2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.001.
  Threat Actor: OilRig
references:
  - https://attack.mitre.org/techniques/T1566.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\Hwp.exe'
    Image|endswith|contains:
      - '\gbb.exe'
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.001
  - actor.oilrig
