title: c21d5a77-d422-4a69-acd7-2c53c1faa34b (MACOS)
id: a4a7dd0b-0d26-464d-ac2c-ea5ed294756f
description: >
  Detects techniques consistent with MITRE ATT&CK technique c21d5a77-d422-4a69-acd7-2c53c1faa34b.
references:
  - https://attack.mitre.org/techniques/c21d5a77-d422-4a69-acd7-2c53c1faa34b/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.c21d5a77-d422-4a69-acd7-2c53c1faa34b
