title: Process Discovery (WINDOWS - security)
id: 8adeb6fc-44e9-4208-bf34-ef6d485effb3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1057.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1057/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'ipconfig*|*find'
      - 'net*|*find'
      - 'netstat*|*find'
    CommandLine|contains|all|contains:
      - 'cmd.exe /c TASKLIST /V |'
      - 'FIND /I'
      - '\xampp\'
    Image|endswith|contains:
      - '\PCHunter64.exe'
      - '\PCHunter32.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1057
  - actor.magic_hound
