title: Drive-by Compromise (WINDOWS - security)
id: e87f74aa-8d8e-4916-8afb-a77248a99447
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1189.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1189/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    NewProcessName|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    CommandLine|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1189
  - actor.magic_hound
