title: Rundll32 (WINDOWS - security)
id: 76d1614f-fb87-4dd6-9246-ee30bd86f586
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.011.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1218.011/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
    ParentImage|endswith|contains:
      - '\hh.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.011
  - actor.magic_hound
