title: Visual Basic (M365 - entra_id)
id: 2fa7a343-0d81-471d-acf0-c973394f91b3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.005.
  Threat Actor: BRONZE BUTLER
references:
  - https://attack.mitre.org/techniques/T1059.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.005
  - actor.bronze_butler
