title: Match Legitimate Resource Name or Location (WINDOWS - security)
id: 2766b397-c133-45d9-8f05-f2e433b8e58e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: admin@338
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/create'
      - '-create'
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.admin@338
