title: File and Directory Discovery (WINDOWS - security)
id: 6d569792-5839-4f7b-8e95-e0b5e6baf0c4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: admin@338
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.admin@338
