title: Local Account (WINDOWS - security)
id: a49409d4-c0d9-447a-a926-47cb78a4d316
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.001.
  Threat Actor: admin@338
references:
  - https://attack.mitre.org/techniques/T1087.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'domain admins'
      - ' administrator'
      - ' administrateur'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.001
  - actor.admin@338
