title: SSH (WINDOWS - sysmon)
id: 3c753af9-ba93-40b7-a6ad-0420f12df95d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: Fox Kitten
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.fox_kitten
