title: Exfiltration Over C2 Channel (WINDOWS - sysmon)
id: 92aae85a-ba22-47a0-acd3-b5760f3540b0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1041.
  Threat Actor: Confucius
references:
  - https://attack.mitre.org/techniques/T1041/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'rundll32.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1041
  - actor.confucius
