title: Indicator Removal (WINDOWS - security)
id: 96a111fa-f09c-4f80-8145-eb5079f8cd97
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1070/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'unload'
    CommandLine|contains|all|contains:
      - 'unload'
      - 'sysmon'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070
  - actor.play
