title: External Remote Services (WINDOWS - security)
id: bf39aa82-6c0b-4b61-917b-5e77f4497d71
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.play
