title: Group Policy Modification (WINDOWS - security)
id: eaff2d6b-caa7-4948-82e6-48c9e2a3767d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectClass|contains:
      - 'groupPolicyContainer'
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.play
