title: Security Software Discovery (WINDOWS - security)
id: d0c9b398-c709-48fc-9c4d-548b745851f4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Play
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - ' avira'
      - ' avira"'
      - ' cb'
    CommandLine|contains|contains:
      - ' 385201'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.play
