title: Spearphishing Attachment - Cl0p (defender)
id: d4938cf4-aee1-498c-bb46-859b8c734449
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1566.001 (Spearphishing Attachment).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1566/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/initial_access_security_compliance_user_reported_phish_malware.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1566.001
  - actor.cl0p
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    rule.name|contains: 'Email reported by user as malware or phish'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
