title: Lateral Tool Transfer - Cl0p (defender)
id: 53ef0aa6-1576-4e16-9033-0cbbeaa25226
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1570 (Lateral Tool Transfer).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1570/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_psexec_lateral_movement_command.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1570
  - actor.cl0p
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'PsExec.exe'
    process.args|contains: '-accepteula'
    process.executable|contains:
      - '?:\\ProgramData\\Docusnap\\Discovery\\discovery\\plugins\\17\\Bin\\psexec.exe'
      - '?:\\Program Files\\Docusnap X\\Tools\\dsDNS.exe'
    process.parent.executable|contains: '?:\\Program Files (x86)\\Cynet\\Cynet Scanner\\CynetScanner.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
