title: NTDS (MACOS - unified_logging)
id: e166b60c-d7ae-43c4-804d-a5cd9bd2bd1f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.lockbit
