title: Drive-by Compromise (MACOS - unified_logging)
id: 35dbdc2b-2d04-4b38-a273-e2bb26245a32
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1189.
  Threat Actor: LockBit
references:
  - https://attack.mitre.org/techniques/T1189/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - 'com.apple.WebKit.WebContent'
      - 'firefox'
      - 'Google Chrome Helper'
    Image|endswith|contains:
      - '/bash'
      - '/curl'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1189
  - actor.lockbit
