title: Crontab Enumeration
id: 5359660f-5359-4359-a359-5359660f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1007
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1007
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '/crontab'
    #         CommandLine|contains: ' -l'
    #     condition: selection
    # 
  condition: selection
level: medium
