title: Deprecated - Suspicious File Creation in /etc for Persistence
id: 522f4cf6-522f-422f-a22f-522f4cf60000
status: stable
description: Detection rule for MITRE ATT&CK technique T1037.004
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/persistence_etc_file_creation.toml
author: elastic (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1037.004
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original elastic detection logic
    # file where host.os.type == "linux" and event.type in ("creation", "file_create_event") and user.id == "0" and
    # file.path : ("/etc/ld.so.conf.d/*", "/etc/cron.d/*", "/etc/sudoers.d/*", "/etc/init.d/*", "/etc/systemd/system/*",
    # "/usr/lib/systemd/system/*") and not (
    #   (process.name : (
    #     "chef-client", "ruby", "pacman", "packagekitd", "python*", "platform-python", "dpkg", "yum", "apt", "dnf", "rpm",
    #     "systemd", "snapd", "dnf-automatic", "yum-cron", "elastic-agent", "dnfdaemon-system", "dockerd", "executor",
    #     "rhn_check"
    #     )
    #   ) or 
    #   (file.extension in ("swp", "swpx", "tmp"))
    # )
  condition: selection
level: medium
