title: Touch Suspicious Service File
id: 6e557d90-6e55-4e55-ae55-6e557d900000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070.006
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_touch_susp.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1070.006
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Image|endswith: '/touch'
    #         CommandLine|contains: ' -t '
    #         CommandLine|endswith: '.service'
    #     condition: selection
    # 
  condition: selection
level: medium
