title: Communication To LocaltoNet Tunneling Service Initiated - Linux
id: 65de5f52-65de-45de-a5de-65de5f520000
status: stable
description: Detection rule for MITRE ATT&CK technique T1102
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_domain_localtonet_tunnel.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1102
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         DestinationHostname|endswith:
    #             - '.localto.net'
    #             - '.localtonet.com'
    #         Initiated: 'true'
    #     condition: selection
    # 
  condition: selection
level: medium
