title: Unusual Base64 Encoding/Decoding Activity
id: 28bcc8f0-28bc-48bc-a8bc-28bcc8f00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204.002
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_base64_decoding_activity.toml
author: elastic (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1204.002
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original elastic detection logic
    # from logs-endpoint.events.process-* metadata _id, _index, _version
    # | mv_expand event.action 
    # | where
    #     host.os.type == "linux" and
    #     event.type == "start" and
    #     event.action == "exec" and (
    #         (
    #             process.name in ("base64", "base64plain", "base64url", "base64mime", "base64pem", "base32", "base16") and
    #             process.command_line like "*-*d*"
    #         ) or
    #         (
    #             process.name == "openssl" and
    #             process.args == "enc" and
    #             process.args in ("-d", "-base64", "-a")
    #         ) or
    #         (
    #             process.name like "python*" and (
    #                 (
    #                     process.args == "base64" and
    #                     process.args in ("-d", "-u", "-t")
    #                 ) or
    #                 (
    #                     process.args == "-c" and
    #                     process.command_line like "*base64*" and
    #                     process.command_line like "*b64decode*"
    #                 )
    #             )
    #         ) or
    #         (
    #             process.name like "perl*" and
    #             process.command_line like "*decode_base64*"
    #         ) or
    #         (
    #             process.name like "ruby*" and
    #             process.args == "-e" and
    #             process.command_line like "*Base64.decode64*"
    #         )
    #     )
    # | keep
    #     @timestamp,
    #     _id,
    #     _index,
    #     _version,
    #     host.os.type,
    #     event.type,
    #     event.action,
    #     process.name,
    #     process.args,
    #     process.command_line,
    #     process.parent.name,
    #     process.parent.command_line,
    #     agent.id,
    #     host.name,
    #     event.dataset,
    #     data_stream.namespace
    # | stats
    #     Esql.event_count = count(),
    #     Esql.process_parent_name_values = values(process.parent.name),
    #     Esql.process_parent_command_line_values = values(process.parent.command_line),
    #     Esql.agent_id_count_distinct = count_distinct(agent.id),
    #     Esql.host_name_values = values(host.name),
    #     Esql.agent_id_values = values(agent.id),
    #     Esql.event_dataset_values = values(event.dataset),
    #     Esql.data_stream_namespace_values = values(d
    # ... [truncated]
  condition: selection
level: medium
