title: Potentially Suspicious Malware Callback Communication - Linux
id: 272640e2-2726-4726-a726-272640e20000
status: stable
description: Detection rule for MITRE ATT&CK technique T1571
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_susp_malware_callback_port.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1571
logsource:
  product: linux
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Initiated: 'true'
    #         DestinationPort:
    #             - 888
    #             - 999
    #             - 2200
    #             - 2222
    #             - 4000
    #             - 4444
    #             - 6789
    #             - 8531
    #             - 50501
    #             - 51820
    #     filter_main_local_ranges:
    #         DestinationIp|cidr:
    #             - '127.0.0.0/8'
    #             - '10.0.0.0/8'
    #             - '172.16.0.0/12'
    #             - '192.168.0.0/16'
    #             - '169.254.0.0/16'
    #             - '::1/128'         # IPv6 loopback
    #             - 'fe80::/10'       # IPv6 link-local addresses
    #             - 'fc00::/7'        # IPv6 private addresses
    #     condition: selection and not 1 of filter_main_*
    # 
  condition: selection
level: medium
