title: JavaScript - BlackSuit (workspace)
id: d09e3b62-a5f1-41a5-b8ff-7748d77dad96
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.007 (JavaScript).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1059/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/execution_suspicious_jar_child_process.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.007
  - actor.blacksuit
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    event.type|contains: 'start'
    process.parent.name|contains: 'java'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
