title: Obfuscated Files or Information - BlackCatALPHV (security)
id: 89c6d71f-b232-45be-a332-f8e116d25e6f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027 (Obfuscated Files or Information).
  Associated threat actor: BlackCatALPHV
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_invoke_obfuscation_clip_services_security.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027
  - actor.blackcatalphv
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cmd'
      - '&&'
      - 'clipboard]::'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
