title: PowerShell - BlackCatALPHV (security)
id: 86be7059-df7c-4aca-908f-2b0f8106020f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.001 (PowerShell).
  Associated threat actor: BlackCatALPHV
references:
  - https://attack.mitre.org/techniques/T1059/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_invoke_obfuscation_clip_services_security.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.001
  - actor.blackcatalphv
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cmd'
      - '&&'
      - 'clipboard]::'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
