title: T1083 (GOOGLE - workspace)
id: f1970936-b6d1-4880-aabe-9e1e60a6626b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.yashma-ator-vietnamita
