title: Clear Windows Event Logs (WINDOWS)
id: 439cae23-073d-4dae-85c8-f8973a816df0
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1070.001.
references:
  - https://attack.mitre.org/techniques/T1070.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1070.001
