title: T1136.002 (LINUX - auditd)
id: 2de0d08e-27fe-454f-a7e8-12e573a703d6
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.002.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1136.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.002
  - actor.akira
