title: Exfiltration Over Web Service (LINUX - auditd)
id: 00558e06-00e6-47c6-adfb-b968b645eb0d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/curl'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.akira
