title: T1409 (MACOS - unified_logging)
id: b250c362-ba2c-4dd1-a4aa-83d5f96f26fd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1409.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1409/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1409
  - actor.safepay
