title: Exploitation for Client Execution (LINUX)
id: 2ea675f2-59e1-42f9-be43-1c6934669a4d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1203.
references:
  - https://attack.mitre.org/techniques/T1203/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1203
