title: OS Credential Dumping - BlackBasta (security)
id: 947309c6-4759-4b5f-9795-242216b74de3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_wceaux_dll.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.blackbasta
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectName|contains: '\wceaux.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
