title: Regsvr32 - BlackBasta (security)
id: 959fdda3-6493-4cfa-bdd1-e260109fea67
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.010 (Regsvr32).
  Associated threat actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1218/010/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_suspicious_execution_from_mounted_device.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.010
  - actor.blackbasta
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.executable|contains: 'C:\\*'
    process.working_directory|contains: 'C:\\'
    process.parent.name|contains: 'explorer.exe'
    process.name|contains:
      - 'rundll32.exe'
      - 'wscript.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
