title: Modify Registry - Sarcoma (sysmon)
id: 55990573-11eb-40c0-af78-14986d8739a5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1112 (Modify Registry).
  Associated threat actor: Sarcoma
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_port_forwarding_added_registry.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1112
  - actor.sarcoma
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    registry.path|contains: '*\\SYSTEM\\*ControlSet*\\Services\\PortProxy\\v4tov4\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
