title: Modify Registry (WINDOWS - security)
id: f4901e25-4d8c-4239-9557-63173c3e6de9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1112.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1112/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '\SOFTWARE\Microsoft\.NETFramework'
    ObjectName|contains|all|contains:
      - '\REGISTRY\MACHINE\SYSTEM'
      - 'ControlSet'
      - '\Control\Lsa'
    ObjectName|contains|contains:
      - 'WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}'
      - 'WINEVT\Channels\Microsoft-Windows-Sysmon/Operational'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1112
  - actor.8base
