title: Registry Run Keys / Startup Folder (WINDOWS - security)
id: 56c4ab69-1935-421f-a48b-af912f0727b9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.001.
  Threat Actor: 8base
references:
  - https://attack.mitre.org/techniques/T1547.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'reg'
      - ' add '
    Image|endswith|contains:
      - '\reg.exe'
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.001
  - actor.8base
