title: OS Credential Dumping (WINDOWS - sysmon)
id: c2143ea6-8aed-4bb3-aa3f-dac6a97c87d4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    Hashes|contains|contains:
      - 'IMPHASH=BCCA3C247B619DCD13C8CDFF5F123932'
      - 'IMPHASH=3A19059BD7688CB88E70005F18EFC439'
      - 'IMPHASH=bf6223a49e45d99094406777eb6004ba'
    Company|contains:
      - 'Cube0x0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003
  - actor.inc_ransom
