title: Compile After Delivery (WINDOWS - sysmon)
id: de15f72d-6026-4361-8606-e7d5e198ab3d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.004.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1027.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    UtcTime|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.004
  - actor.inc_ransom
