title: Command Obfuscation (WINDOWS)
id: 6800f84d-98a1-45ec-b331-438bc3cb767e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.010.
references:
  - https://attack.mitre.org/techniques/T1027.010/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'powershell.exe'
      - 'pwsh.exe'
      - 'cmd.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-enc'
      - 'bypass'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.010
