title: Python (WINDOWS - sysmon)
id: 712b4152-f7ed-4d6c-bb6b-f40451551fcf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.inc_ransom
