title: Malicious Link (WINDOWS - sysmon)
id: 4b408400-e1a4-4fb5-b45b-48093ca68818
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1204.001.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1204.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '\explorer.exe'
    CommandLine|contains|contains:
      - '#'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1204.001
  - actor.inc_ransom
