title: Credentials from Web Browsers (WINDOWS)
id: 93b1b825-ea63-4345-96e7-5dc0e6d8062a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.003.
references:
  - https://attack.mitre.org/techniques/T1555.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'lsass.exe'
      - 'mimikatz.exe'
    CommandLine|contains:
      - 'sekurlsa'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555.003
