title: DLL (WINDOWS - sysmon)
id: a8ea7fd7-97b9-4115-93d0-d20eadc6d1cd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/PhoneDeepLink'
    Image|endswith|contains:
      - '\dnscmd.exe'
    Image|startswith|contains:
      - 'C:\Program Files\VMware\'
    CommandLine|contains|all|contains:
      - '/config'
      - '/serverlevelplugindll'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.inc_ransom
