title: Network Service Discovery - Vice Society (auditd)
id: 0201b4ed-52d6-439b-bdd7-e31212e030a9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1046 (Network Service Discovery).
  Associated threat actor: Vice Society
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_network_service_scanning.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1046
  - actor.vice_society
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - '/telnet'
      - '/nmap'
      - '/netcat'
      - '/nc'
    key|contains: 'network_connect_4'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
