title: Local Account (WINDOWS - security)
id: 8d684314-2564-4dd2-ab67-20173b8a380f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: TeamTNT
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    TargetUserName|endswith|contains:
      - '$'
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.teamtnt
