title: Msiexec (WINDOWS - sysmon)
id: 7f55f3dc-a775-4b73-99cd-6d85d5a50029
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.007.
  Threat Actor: Molerats
references:
  - https://attack.mitre.org/techniques/T1218.007/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -y'
    Image|endswith|contains:
      - '\msiexec.exe'
    ParentCommandLine|contains|all|contains:
      - 'MsiExec.exe'
      - '-Embedding '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.007
  - actor.molerats
