title: Encrypted/Encoded File (LINUX - auditd)
id: 04ae5ce7-4655-41c6-875f-41e9322a9cdc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.013.
  Threat Actor: Magic Hound
references:
  - https://attack.mitre.org/techniques/T1027.013/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - 'cmd.exe'
      - 'powershell.exe'
      - 'bash'
      - 'sh'
    cmd|contains:
      - '-enc'
      - 'bypass'
      - 'encoded'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.013
  - actor.magic_hound
