title: Process Injection - BQTLock (unified_logging)
id: 5d955c4e-71ce-471e-bad8-97dd43550178
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1055 (Process Injection).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_code_injection_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1055
  - actor.bqtlock
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.parent.name|contains: 'conhost.exe'
    process.executable|contains:
      - '?:\\Windows\\splwow64.exe'
      - '?:\\Windows\\System32\\conhost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
