title: Local Account - BQTLock (unified_logging)
id: 359b7f9c-0d09-43ea-8907-2b0c6f410ea5
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1136.001 (Local Account).
  Associated threat actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/fim/persistence_suspicious_file_modifications.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1136.001
  - actor.bqtlock
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    file.path|contains:
      - '/var/spool/cron/crontabs/tmp.*'
      - '/root/.ssh/known_hosts.*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
