title: Cached Domain Credentials (WINDOWS - security)
id: bfd9acac-2ed3-4fd1-af75-ba4060e36fba
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.005.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1003.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
    CommandLine|contains|windash|contains:
      - ' -l'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.005
  - actor.inc_ransom
