title: LSA Secrets (WINDOWS - security)
id: dc12af19-0752-4c4b-ad54-6376b8fc3f11
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.004.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1003.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SecretObject'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.004
  - actor.inc_ransom
