title: Steganography (WINDOWS - security)
id: cecf2a9c-e1c3-4083-810a-2ffef8b90a8d
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.inc_ransom
