title: Python (WINDOWS - security)
id: 49fe46f7-f22b-42e9-b366-5a5325ca6979
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.inc_ransom
