title: Ingress Tool Transfer (WINDOWS - security)
id: faf5c717-3dc4-4879-b9e2-ee84abb33835
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1105.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1105/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    TargetName|contains|contains:
      - 'Microsoft_Windows_Shell_ZipFolder:filename'
    Image|endswith|contains:
      - '\brave.exe'
      - '\chrome.exe'
      - '\msedge.exe'
    CommandLine|contains|contains:
      - '--headless'
    CommandLine|contains|all|contains:
      - '--headless'
      - 'dump-dom'
      - 'http'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1105
  - actor.inc_ransom
