title: Video Capture (WINDOWS - security)
id: 25a27aea-a0ae-43c7-87e3-4cb88dc834ea
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1125.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1125/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|contains:
      - 'suspicious'
      - 'malicious'
      - 'attack'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1125
  - actor.inc_ransom
