title: Standard Encoding (WINDOWS - security)
id: 9f2a94ee-431f-4f33-9509-01338f344533
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1132.001.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1132.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'FromBase64String'
      - 'MemoryStream'
      - 'H4sI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1132.001
  - actor.inc_ransom
