title: Access Token Manipulation (WINDOWS - security)
id: 4c49ff08-1e5b-40f9-8d73-2743a5732515
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1134/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    FilterName|contains|contains:
      - 'RonPolicy'
    IntegrityLevel|contains:
      - 'System'
      - 'S-1-16-16384'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134
  - actor.inc_ransom
