title: Credentials from Web Browsers (WINDOWS)
id: 64b27046-0b2a-41df-a76e-53abca18ece3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.003.
references:
  - https://attack.mitre.org/techniques/T1555.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    EventID:
      - '4624'
      - '4625'
      - '4648'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555.003
