title: Exfiltration Over Web Service (WINDOWS - defender)
id: 7025a208-5779-4856-9d4a-e051b0dd2d1a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1567.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1567/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/in:'
      - '/out:'
      - '/uri:'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1567
  - actor.akira
