title: OS Credential Dumping - BlackSuit (auditd)
id: 569adceb-b210-4ced-98d7-b8761ea0a79a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: BlackSuit
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_keylogging_with_pam_d.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.blacksuit
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'PATH'
      - '/etc/pam.d/system-auth'
      - '/etc/pam.d/password-auth'
      - 'TTY'
      - 'USER_TTY'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
