title: Data Transfer Size Limits (LINUX - auditd)
id: 7753c346-a812-4e11-a9e2-8f66fd99e473
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1030.
  Threat Actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1030/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    comm|contains:
      - 'split'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1030
  - actor.safelocker
