title: Hidden Files and Directories (LINUX - auditd)
id: 874c9649-19f1-4e75-a1b3-58bd04578872
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.001.
  Threat Actor: SafeLocker
references:
  - https://attack.mitre.org/techniques/T1564.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'mkdir'
      - 'nano'
      - 'touch'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564.001
  - actor.safelocker
