title: Hijack Execution Flow (LINUX)
id: 125b63dc-2914-40bc-af45-5433a6b35ae1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.
references:
  - https://attack.mitre.org/techniques/T1574/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574
