title: Dynamic-link Library Injection (WINDOWS - security)
id: 8faa7edb-f788-43dc-8449-e51151986260
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1055.001.
  Threat Actor: PEAR
references:
  - https://attack.mitre.org/techniques/T1055.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1055.001
  - actor.pear
