title: Rundll32 (WINDOWS - sysmon)
id: 83ead2f1-5514-4728-bbdb-8aed5b7783f1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1218.011.
  Threat Actor: APT32
references:
  - https://attack.mitre.org/techniques/T1218.011/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.application'
      - '\AppData\Local\Temp\'
      - '\Content.Outlook\'
    Image|endswith|contains:
      - '\CertReq.exe'
      - '\CertUtil.exe'
      - '\cmd.exe'
    ParentImage|endswith|contains:
      - '\hh.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1218.011
  - actor.apt32
