title: Software Deployment Tools (WINDOWS - sysmon)
id: c7bbe59f-0a74-40a6-a9d9-e63e0a274f25
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.cactus_ransomware
