title: Lateral Tool Transfer (WINDOWS - sysmon)
id: 71b34ff1-7427-4de9-9638-50abd088e912
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1570.
  Threat Actor: Cactus Ransomware
references:
  - https://attack.mitre.org/techniques/T1570/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains:
      - 'rundll32.exe'
      - 'rundll32'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1570
  - actor.cactus_ransomware
