title: Virtualization/Sandbox Evasion - 8base (defender)
id: 946cb4ad-88a7-4e31-9c4e-df8c92e38229
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1497 (Virtualization/Sandbox Evasion).
  Associated threat actor: 8base
references:
  - https://attack.mitre.org/techniques/T1497/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_delayed_via_ping_lolbas_unsigned.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1497
  - actor.8base
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.name|contains: 'wscript.exe'
    process.args|contains:
      - '?:\\windows\\syswow64\\msxml?.dll'
      - '?:\\Windows\\SysWOW64\\mschrt20.ocx'
    process.parent.name|contains: 'cmd.exe'
    user.id|contains: 'S-1-5-18'
    process.executable|contains: '?:\\Users\\*\\AppData\\*.exe'
    process.parent.command_line|contains: '*ScreenConnectConfigurator.cmd*'
    process.pe.original_file_name|contains: 'DPInst.exe'
    process.command_line|contains: 'driver\\DPInst_x64  /f '
    process.parent.args|contains: '?:\\Windows\\TempInst\\7z*'
    process.working_directory|contains:
      - '?:\\Windows\\TempInst\\*'
      - '?:\\Users\\*\\AppData\\Local\\Temp\\QBTools\\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
