title: Binary Padding - Qilin (defender)
id: 84265988-5ec0-4714-ad33-5d92eb086601
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1027.001 (Binary Padding).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1027/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_codeintegrity_check_failure.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1027.001
  - actor.qilin
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    param1|contains: '\Program Files\Sophos\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
