title: At - Qilin (defender)
id: 8a4cb154-6b98-48d6-acd3-4d3af151ec53
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1053.002 (At).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1053/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_scheduledjobs_at_protocol_enabled.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1053.002
  - actor.qilin
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.value|contains: 'EnableAt'
    registry.data.strings|contains:
      - '1'
      - '0x00000001'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
