title: System Time Discovery - Qilin (defender)
id: cda2b155-0562-4276-b484-080f6ee2bbc8
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1124 (System Time Discovery).
  Associated threat actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1124/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_discovery_via_reg_queries.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1124
  - actor.qilin
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    InitiatingProcessFileName|contains: '\reg.exe'
    ProcessCommandLine|contains:
      - 'query'
      - '\powershell.exe'
      - '\pwsh.exe'
      - 'Get-ItemPropertyValue'
      - 'gpv'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
