title: Process Injection - SafePay (entra_id)
id: e989088b-c777-4ee1-9398-c81528b8707a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1055 (Process Injection).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_code_injection_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1055
  - actor.safepay
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.parent.name|contains: 'conhost.exe'
    process.executable|contains:
      - '?:\\Windows\\splwow64.exe'
      - '?:\\Windows\\System32\\conhost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
