title: System Owner/User Discovery (LINUX - auditd)
id: 14e5dae1-1400-43e7-ac00-42a6a416435e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'hostname'
      - 'id'
      - 'last'
    Image|endswith|contains:
      - '/esxcli'
    CommandLine|contains|contains:
      - 'storage'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.inc_ransom
