title: Screen Capture (LINUX - auditd)
id: 6f36a751-08d1-41a2-8188-01ded1e6231c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1113.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1113/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'EXECVE'
    a0|contains:
      - 'xwd'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1113
  - actor.inc_ransom
