title: DLL (LINUX - auditd)
id: 84d660dc-7ae7-4a2f-971a-cbe5f32f0c2b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1574.001.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1574.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|contains|contains:
      - '/.'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1574.001
  - actor.inc_ransom
