title: LSASS Memory (LINUX - auditd)
id: 97c79240-9630-479d-8255-45baca29a1af
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.001.
  Threat Actor: MuddyWater
references:
  - https://attack.mitre.org/techniques/T1003.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    exe|contains:
      - '/bin/bash'
      - '/bin/sh'
      - '/usr/bin/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.001
  - actor.muddywater
