title: Archive via Utility (LINUX - auditd)
id: ffd2cbfe-e212-493d-802f-2e88211c7e4b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1560.001.
  Threat Actor: MuddyWater
references:
  - https://attack.mitre.org/techniques/T1560.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'execve'
    a0|contains:
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1560.001
  - actor.muddywater
