title: Valid Accounts (WINDOWS - defender)
id: a8d75aaa-ab20-4893-a2e7-841f295c6a45
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: Cuba
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' use '
      - ':*\\'
      - '/USER:* *'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.cuba
