title: Internal Horizontal Port Scan
id: 69fa0e91-69fa-49fa-a9fa-69fa0e910000
status: stable
description: Detection rule for MITRE ATT&CK technique T1046
references:
  - https://github.com/splunk/security_content/blob/develop/detections/network/internal_horizontal_port_scan.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1046
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original splunk detection logic
    # | tstats `security_content_summariesonly` values(All_Traffic.action) as action
    #   values(All_Traffic.src_category) as src_category values(All_Traffic.dest_zone) as
    #   dest_zone values(All_Traffic.src_zone) as src_zone values(All_Traffic.src_port)
    #   as src_port count from datamodel=Network_Traffic where All_Traffic.src_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16")
    #   by All_Traffic.src_ip All_Traffic.dest_port All_Traffic.dest_ip All_Traffic.transport All_Traffic.rule span=1s _time
    #   | `drop_dm_object_name("All_Traffic")` | eval gtime=_time | bin span=1h gtime |
    #   stats min(_time) as _time values(action) as action dc(dest_ip) as totalDestIPCount
    #   values(src_category) as src_category values(dest_zone) as dest_zone values(src_zone)
    #   as src_zone by src_ip dest_port gtime transport | where totalDestIPCount>=250 |
    #   eval dest_port=transport + "/" + dest_port | stats min(_time) as _time values(action)
    #   as action sum(totalDestIPCount) as totalDestIPCount values(src_category) as src_category
    #   values(dest_port) as dest_ports values(dest_zone) as dest_zone values(src_zone)
    #   as src_zone by src_ip gtime | fields - gtime | `internal_horizontal_port_scan_filter`
  condition: selection
level: medium
