title: Google Workspace Application Access Level Modified
id: 2dbc266f-2dbc-4dbc-adbc-2dbc266f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1098.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/gcp/gworkspace/gcp_gworkspace_application_access_levels_modified.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1098.003
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         eventService: 'admin.googleapis.com'
    #         eventName: 'CHANGE_APPLICATION_SETTING'
    #         setting_name|startswith: 'ContextAwareAccess'
    #     condition: selection
    # 
  condition: selection
level: medium
