title: ASL AWS ECR Container Upload Outside Business Hours
id: 49598aba-4959-4959-a959-49598aba0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204.003
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_ecr_container_upload_outside_business_hours.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1204.003
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `amazon_security_lake` api.operation=PutImage 
    #   | eval hour=strftime(time/pow(10,3), "%H"), weekday=strftime(time/pow(10,3), "%A") 
    #   | where hour >= 20 OR hour < 8 OR weekday=Saturday OR weekday=Sunday 
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime by actor.user.uid api.operation api.service.name http_request.user_agent src_endpoint.ip actor.user.account.uid cloud.provider cloud.region api.request.data bucketName
    #   | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region 
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` 
    #   | `asl_aws_ecr_container_upload_outside_business_hours_filter`
  condition: selection
level: medium
