title: ASL AWS Defense Evasion PutBucketLifecycle
id: 5827230f-5827-4827-a827-5827230f0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1485.001
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_defense_evasion_putbucketlifecycle.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1485.001
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `amazon_security_lake` api.operation=PutBucketLifecycle 
    #   | spath input=api.request.data path=LifecycleConfiguration.Rule.NoncurrentVersionExpiration.NoncurrentDays output=NoncurrentDays 
    #   | where NoncurrentDays < 3 
    #   | spath input=api.request.data 
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime by actor.user.uid api.operation api.service.name http_request.user_agent src_endpoint.ip actor.user.account.uid cloud.provider cloud.region NoncurrentDays bucketName 
    #   | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region 
    #   | `security_content_ctime(firstTime)` |  `security_content_ctime(lastTime)` 
    #   | `asl_aws_defense_evasion_putbucketlifecycle_filter`
  condition: selection
level: medium
