title: ASL AWS Disable Bucket Versioning
id: 6a4c0cf4-6a4c-4a4c-aa4c-6a4c0cf40000
status: stable
description: Detection rule for MITRE ATT&CK technique T1490
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/asl_aws_disable_bucket_versioning.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1490
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original splunk detection logic
    # `amazon_security_lake` api.operation=PutBucketVersioning 
    #   | spath input=api.request.data path=VersioningConfiguration.Status output=Status 
    #   | spath input=api.request.data path=bucketName output=bucketName
    #   | search Status=Suspended 
    #   | fillnull 
    #   | stats count min(_time) as firstTime max(_time) as lastTime by actor.user.uid api.operation api.service.name http_request.user_agent src_endpoint.ip actor.user.account.uid cloud.provider cloud.region api.request.data bucketName
    #   | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region 
    #   | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `asl_aws_disable_bucket_versioning_filter`
  condition: selection
level: medium
