title: Cloud Compute Instance Created In Previously Unused Region
id: 34944e4b-3494-4494-a494-34944e4b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1535
references:
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/cloud_compute_instance_created_in_previously_unused_region.yml
author: splunk (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1535
logsource:
  product: aws
  service: general
detection:
  selection:
    # Original splunk detection logic
    # | tstats earliest(_time) as firstTime latest(_time) as lastTime values(All_Changes.object_id)
    #   as dest, count from datamodel=Change where All_Changes.action=created by All_Changes.vendor_region,
    #   All_Changes.user | `drop_dm_object_name("All_Changes")` | lookup previously_seen_cloud_regions
    #   vendor_region as vendor_region OUTPUTNEW firstTimeSeen, enough_data | eventstats
    #   max(enough_data) as enough_data | where enough_data=1 | eval firstTimeSeenRegion=min(firstTimeSeen)
    #   | where isnull(firstTimeSeenRegion) OR firstTimeSeenRegion > relative_time(now(),
    #   "-24h@h") | table firstTime, user, dest, count , vendor_region | `security_content_ctime(firstTime)`
    #   | `cloud_compute_instance_created_in_previously_unused_region_filter`
  condition: selection
level: medium
