title: Deobfuscate/Decode Files or Information (WINDOWS - security)
id: 634a9b1a-24bb-4123-8467-5e4aeaaaa9d3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1140.
  Threat Actor: Trigona
references:
  - https://attack.mitre.org/techniques/T1140/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '.7z'
      - '.avi'
      - '.bat'
    Image|endswith|contains:
      - '\ping.exe'
    CommandLine|re|contains:
      - '0x[a-fA-F0-9]{8}'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1140
  - actor.trigona
