title: Security Software Discovery (MACOS - unified_logging)
id: 1b2edaa1-5bfc-46db-8e9f-1f27ae97ab94
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Rhysida
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/csrutil'
    CommandLine|contains|contains:
      - 'nessusd'
      - 'santad'
      - 'CbDefense'
    Image|contains:
      - '/usr/bin/grep'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.rhysida
