title: SSH (WINDOWS - security)
id: 9d19c4eb-d45b-4f0e-9048-017b1cca7e00
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: Indrik Spider
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.indrik_spider
