title: Local Account (WINDOWS - security)
id: acfe0f9c-8b3c-43d1-a572-8e46215a7c51
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: Indrik Spider
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    TargetUserName|endswith|contains:
      - '$'
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.indrik_spider
