title: Group Policy Modification (WINDOWS - security)
id: 5a467c0e-3bd9-4318-9a5c-9464c1f3b688
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1484.001.
  Threat Actor: Indrik Spider
references:
  - https://attack.mitre.org/techniques/T1484.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectClass|contains:
      - 'groupPolicyContainer'
    AttributeLDAPDisplayName|contains:
      - 'gPCMachineExtensionNames'
      - 'gPCUserExtensionNames'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1484.001
  - actor.indrik_spider
