title: Credentials In Files (WINDOWS - security)
id: 09b38eba-85c0-4db9-b854-fe9f32ed5a82
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1552.001.
  Threat Actor: Indrik Spider
references:
  - https://attack.mitre.org/techniques/T1552.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -s '
    CommandLine|contains|contains:
      - 'Offline_Winpwn'
      - 'WinPwn '
      - 'WinPwn.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1552.001
  - actor.indrik_spider
