title: NTDS (WINDOWS - sysmon)
id: 90fcb8f0-0de2-4986-9e0e-4254133f7af7
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.003.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1003.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'esentutl'
      - ' /p'
    CommandLine|contains|windash|contains:
      - 'vss'
      - ' /m '
      - ' /y '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.003
  - actor.safepay
