title: Remote Desktop Software (WINDOWS - sysmon)
id: a7362564-2b0b-4b3a-bbf0-884523ead6b5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.002.
  Threat Actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1219.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.rdp'
      - '.rdp"'
    Image|endswith|contains:
      - '\QuickAssist.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219.002
  - actor.safepay
