title: Abuse Elevation Control Mechanism (WINDOWS - sysmon)
id: f65a6d0c-68b6-474b-9b70-7c767dfd7538
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1548.
  Threat Actor: Rincrypt
references:
  - https://attack.mitre.org/techniques/T1548/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\regedit.exe'
    ParentImage|endswith|contains:
      - '\mmc.exe'
    User|contains|contains:
      - 'AUTHORI'
      - 'AUTORI'
    ParentCommandLine|contains|contains:
      - 'WF.msc'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1548
  - actor.rincrypt
