title: Mark-of-the-Web Bypass (WINDOWS - sysmon)
id: 18b96cdf-ad59-4551-93b8-4eea46941e4c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.005.
  Threat Actor: TA505
references:
  - https://attack.mitre.org/techniques/T1553.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\AI_STUBS\AiStubX64Elevated.exe'
      - '\AI_STUBS\AiStubX86Elevated.exe'
      - '\AI_STUBS\AiStubX64.exe'
    OriginalFileName|contains:
      - 'popupwrapper.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.005
  - actor.ta505
