title: External Remote Services - Medusa (entra_id)
id: d8fbeb50-9cf8-453e-bb48-f0e850e75348
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1133 (External Remote Services).
  Associated threat actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1133/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_ssh_connection_established_inside_a_container.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1133
  - actor.medusa
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    container.id|contains: '*'
    process.entry_leader.entry_meta.type|contains: 'sshd'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
