title: Linux Keylogging with Pam.d
id: 8e2002ff-05c1-464d-9d58-4d1315577baf
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_keylogging_with_pam_d.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_path_events:
          type: PATH
          name:
              - '/etc/pam.d/system-auth'
              - '/etc/pam.d/password-auth'
      selection_tty_events:
          type:
              - 'TTY'
              - 'USER_TTY'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
