title: Crontab Enumeration
id: 3eb80977-23d8-4861-8567-4b9222d8d9d1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1007.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1007/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crontab_enumeration.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1007
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/crontab'
          CommandLine|contains: ' -l'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
