title: Triple Cross eBPF Rootkit Install Commands
id: cead41cc-635b-433e-a39d-3023b0a13535
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1014.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1014/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_triple_cross_rootkit_install.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1014
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/sudo'
          CommandLine|contains|all:
              - ' tc '
              - ' enp0s3 '
          CommandLine|contains:
              - ' qdisc '
              - ' filter '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
