title: System Network Discovery - Linux
id: ef58e525-fb79-47ae-a74c-0a3101422cde
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1016.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1016/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_system_network_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1016
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_img:
          Image|endswith:
              - '/firewall-cmd'
              - '/ufw'
              - '/iptables'
              - '/netstat'
              - '/ss'
              - '/ip'
              - '/ifconfig'
              - '/systemd-resolve'
              - '/route'
      selection_cli:
          CommandLine|contains: '/etc/resolv.conf'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
