title: Steganography Hide Zip Information in Picture File
id: 8eef1823-ae4d-418c-8c8a-8019ae1d83a9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_hidden_zip_files_steganography.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      commands:
          type: EXECVE
          a0: cat
      a1:
          a1|endswith:
              - '.jpg'
              - '.png'
      a2:
          a2|endswith: '.zip'
      condition: commands and a1 and a2
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
