title: Decode Base64 Encoded Text
id: 3453200d-232a-43b5-b955-7cf922ef8386
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_base64_decode.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/base64'
          CommandLine|contains: '-d' # Also covers "--decode"
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
