title: Binary Padding - Linux
id: cf01b517-256e-4b65-9203-d108be2eb17c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1027.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1027/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_binary_padding.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1027.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_execve:
          type: 'EXECVE'
      keywords_truncate:
          '|all':
              - 'truncate'
              - '-s'
      keywords_dd:
          '|all':
              - 'dd'
              - 'if='
      keywords_filter:
          - 'of='
      condition: selection_execve and (keywords_truncate or (keywords_dd and not keywords_filter))
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
