title: Executable Bit Set for Potential Persistence Script
id: 2d7afa27-2c64-47ae-a0a5-01b0fa4178d0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1037.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1037/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/persistence_potential_persistence_script_executable_bit_set.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1037.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.args:
      - '+x*'
      - '7*'
      - '-m*'
      - '7*'
      - '1*'
    process.parent.executable: '/var/lib/dpkg/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
