title: Potentially Suspicious Execution From Tmp Folder
id: 1b415711-39bc-4955-86b3-93334cd6d419
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_execution_tmp_folder.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|startswith: '/tmp/'
      filter_optional_nextcloud:
          Image|endswith: '/usr/bin/nextcloud'
      condition: selection and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
