title: Chkconfig Service Add
id: d9025dca-ce6a-405a-9dbe-b758d0125949
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1037.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1037/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/persistence_chkconfig_service_add.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1037
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.executable: '/usr/sbin/chkconfig'
    process.args:
      - '--add'
      - '*chkconfig'
      - '--add'
    process.parent.args:
      - '/var/tmp/rpm*'
      - '/usr/bin/puppet*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
