title: Executable Masquerading as Kernel Process
id: a08b11f2-ed12-4a75-b3f7-8d2da33789b6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.004.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1036/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_kthreadd_masquerading.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1036.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.name:
      - 'kworker*'
      - 'kthread*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
