title: System Owner or User Discovery - Linux
id: d74c7941-e98a-413c-a183-08f640bf9c6d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1033.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1033/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_user_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1033
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'EXECVE'
          a0:
              - 'hostname'
              - 'id'
              - 'last'
              - 'uname'
              - 'users'
              - 'w'
              - 'who'
              - 'whoami'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
