title: Masquerading as Linux Crond Process
id: 9243954d-b514-40d8-9da3-06b5edf4b1c9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1036.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1036/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_masquerading_crond.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1036.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'execve'
          a0: 'cp'
          a1: '/bin/sh'
          a2|endswith: '/crond'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
