title: Split A File Into Pieces - Linux
id: a36b7f97-5977-46ff-a4ea-e605cb7ba63d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1030.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1030/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_split_file_into_pieces.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1030
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          comm: 'split'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
