title: Network Activity Detected via Kworker
id: b015b087-cbc6-410c-86d7-12119f950c27
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1041.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1041/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/command_and_control_linux_kworker_netcon.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1041
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    destination.port: '2049'
    host.os.type: 'linux'
    event.category: 'network'
    event.action: '(connection_attempted'
    process.name: 'kworker*'
    destination.ip: '('
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
