title: Data Exfiltration with Wget
id: ef2064d6-fffd-48ed-8d8a-b93daea76b6b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_data_exfil_wget.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: EXECVE
          a0: wget
          a1|startswith: '--post-file='
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
