title: Network Sniffing - Linux
id: c1a77ec6-222f-4925-a09c-5e87eb9765fb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1040.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1040/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_network_sniffing.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1040
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_1:
          type: 'execve'
          a0: 'tcpdump'
          a1: '-c'
          a3|contains: '-i'
      selection_2:
          type: 'execve'
          a0: 'tshark'
          a1: '-c'
          a3: '-i'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
