title: Linux Network Service Scanning - Auditd
id: 443e8766-21ba-4963-a33b-20654d543419
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1046.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1046/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_network_service_scanning.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1046
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          exe|endswith:
              - '/telnet'
              - '/nmap'
              - '/netcat'
              - '/nc'
              - '/ncat'
              - '/nc.openbsd'
          key: 'network_connect_4'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
