title: System Network Connections Discovery - Linux
id: fc28f447-b8bd-40b7-97bd-0fe7d8e13244
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1049.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1049/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_system_network_connections_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1049
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/who'
              - '/w'
              - '/last'
              - '/lsof'
              - '/netstat'
      filter_landscape_sysinfo:
          ParentCommandLine|contains: '/usr/bin/landscape-sysinfo'
          Image|endswith: '/who'
      condition: selection and not 1 of filter_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
