title: Data Exfiltration with Wget
id: 7c3c4d78-bd11-4783-ba64-6c2c7854c2d5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1048.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1048/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_data_exfil_wget.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1048.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: EXECVE
          a0: wget
          a1|startswith: '--post-file='
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
