title: Interactive Terminal Spawned via Python
id: 3f1f0738-83d4-4b9d-b1de-18cd5b540285
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.006.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1059/006/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/execution_python_tty_shell.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1059.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.parent.name:
      - 'python*'
      - 'python*'
    process.parent.args:
      - '*pty.spawn*'
      - '-c'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
