title: Linux Auditd At Application Execution
id: 03f79bec-03f7-43f7-a3f7-03f79bec0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1053.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_auditd_at_application_execution.yml
author: splunk (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1053.002
logsource:
  product: linux
  service: auditd
detection:
  selection:
    # Original splunk detection logic
    # `linux_auditd` type=SYSCALL comm IN ("at", "atd") OR exe IN ("/usr/bin/at","/usr/bin/atd") AND NOT (uid IN ("daemon")) 
    #   | rename host as dest 
    #   | stats count min(_time) as firstTime max(_time) as lastTime 
    #   by comm exe  syscall uid ppid pid dest 
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   | `linux_auditd_at_application_execution_filter`
  condition: selection
level: medium
