title: Suspicious Commands Linux
id: b0198942-5df3-4d31-b2a8-9de927739f1d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_susp_cmds.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      cmd1:
          type: 'EXECVE'
          a0: 'chmod'
          a1: 777
      cmd2:
          type: 'EXECVE'
          a0: 'chmod'
          a1: 'u+s'
      cmd3:
          type: 'EXECVE'
          a0: 'cp'
          a1: '/bin/ksh'
      cmd4:
          type: 'EXECVE'
          a0: 'cp'
          a1: '/bin/sh'
      condition: 1 of cmd*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
