title: System Info Discovery via Sysinfo Syscall
id: 8e283870-bcb6-41c4-85ca-ce8f8c37c197
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1057.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1057/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_susp_discovery_sysinfo_syscall.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1057
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          SYSCALL: 'sysinfo'
      filter_optional_splunk:
          exe|endswith: '/bin/splunkd'
      condition: selection and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
