title: ESXi Network Configuration Discovery Via ESXCLI
id: 9c6cbaf6-6c41-4f4d-a6da-ec29f194e85d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.012.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_esxcli_network_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059.012
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_img:
          Image|endswith: '/esxcli'
          CommandLine|contains: 'network'
      selection_cli:
          CommandLine|contains:
              - ' get'
              - ' list'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
