title: Scheduled Task/Job At
id: 2a997535-4961-405e-906a-09bc1bd8a7d7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_at_command.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/at'
              - '/atd'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
