title: Privilege Escalation via GDB CAP_SYS_PTRACE
id: 8f8f6883-6159-4ed1-96c6-4aa4ad2451b0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1055.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1055/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/privilege_escalation_gdb_sys_ptrace_elevation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1055
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.thread.capabilities.effective: 'CAP_SYS_PTRACE'
    process.thread.capabilities.permitted: 'CAP_SYS_PTRACE'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
