title: Local Groups Discovery - Linux
id: c666a744-8151-4538-9666-a82528e5d402
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1069.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1069/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_groups.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1069.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_1:
          Image|endswith: '/groups'
      selection_2:
          Image|endswith:
              - '/cat'
              - '/ed'
              - '/head'
              - '/less'
              - '/more'
              - '/nano'
              - '/tail'
              - '/vi'
              - '/vim'
          CommandLine|contains: '/etc/group'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
