title: Possible Coin Miner CPU Priority Param
id: 66c6e27a-66c6-46c6-a6c6-66c6e27a0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1068
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_coinminer.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1068
logsource:
  product: linux
  service: auditd
detection:
  selection:
    # Original sigma detection logic
    #     cmd1:
    #         a1|startswith: '--cpu-priority'
    #     cmd2:
    #         a2|startswith: '--cpu-priority'
    #     cmd3:
    #         a3|startswith: '--cpu-priority'
    #     cmd4:
    #         a4|startswith: '--cpu-priority'
    #     cmd5:
    #         a5|startswith: '--cpu-priority'
    #     cmd6:
    #         a6|startswith: '--cpu-priority'
    #     cmd7:
    #         a7|startswith: '--cpu-priority'
    #     condition: 1 of cmd*
    # 
  condition: selection
level: medium
