title: Possible Coin Miner CPU Priority Param
id: c553a54c-c747-4c9f-82d6-b69677c19383
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1068.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1068/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_coinminer.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1068
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      cmd1:
          a1|startswith: '--cpu-priority'
      cmd2:
          a2|startswith: '--cpu-priority'
      cmd3:
          a3|startswith: '--cpu-priority'
      cmd4:
          a4|startswith: '--cpu-priority'
      cmd5:
          a5|startswith: '--cpu-priority'
      cmd6:
          a6|startswith: '--cpu-priority'
      cmd7:
          a7|startswith: '--cpu-priority'
      condition: 1 of cmd*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
