title: Linux Command History Tampering
id: 07e49bdf-9a1f-431c-97fd-f5d1081e9a03
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/builtin/lnx_shell_clear_cmd_history.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      keywords:
          - 'cat /dev/null >*sh_history'
          - 'cat /dev/zero >*sh_history'
          - 'chattr +i*sh_history'
          - 'echo "" >*sh_history'
          - 'empty_bash_history'
          - 'export HISTFILESIZE=0'
          - 'history -c'
          - 'history -w'
          - 'ln -sf /dev/null *sh_history'
          - 'ln -sf /dev/zero *sh_history'
          - 'rm *sh_history'
          - 'shopt -ou history'
          - 'shopt -uo history'
          - 'shred *sh_history'
          - 'truncate -s0 *sh_history'
          # - 'unset HISTFILE'  # prone to false positives
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
