title: Clear or Disable Kernel Ring Buffer Logs via Syslog Syscall
id: f8146461-af2f-4a56-a9de-15a68ce4ab3f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_clean_disable_dmesg_logs_via_syslog.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          SYSCALL: 'syslog'
          a0:
              - 4 # SYSLOG_ACTION_READ_CLEAR : Read and clear log
              - 5 # SYSLOG_ACTION_CLEAR: Clear kernel ring buffer (without reading)
              - 6 # SYSLOG_ACTION_CONSOLE_OFF: Disable logging to console
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
