title: Suspicious C2 Activities
id: f29df27f-dd31-4c69-970e-42bdae535ddc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1071.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1071/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_susp_c2_commands.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1071
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          key: 'susp_activity'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
