title: File Time Attribute Change - Linux
id: 0a06fe3b-68b9-45d6-a2f6-170d4d9a2cbf
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1070.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1070/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_change_file_time_attr.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1070.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      execve:
          type: 'EXECVE'
      touch:
          - 'touch'
      selection2:
          - '-t'
          - '-acmr'
          - '-d'
          - '-r'
      condition: execve and touch and selection2
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
