title: System Information Discovery - Auditd
id: d9a8e69b-1ac4-4881-9edb-a2db311d31fd
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1082.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1082/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_system_info_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_1:
          type: PATH
          name:
              - /etc/lsb-release
              - /etc/redhat-release
              - /etc/issue
      selection_2:
          type: EXECVE
          a0:
              - uname
              - uptime
              - lsmod
              - hostname
              - env
      selection_3:
          type: EXECVE
          a0: grep
          a1|contains:
              - vbox
              - vm
              - xen
              - virtio
              - hv
      selection_4:
          type: EXECVE
          a0: kmod
          a1: list
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
