title: Local System Accounts Discovery - Linux
id: e832ca8f-ed8d-45a2-80ff-f3684a2817d0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1087.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_local_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1087.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_1:
          Image|endswith: '/lastlog'
      selection_2:
          CommandLine|contains: '''x:0:'''
      selection_3:
          Image|endswith:
              - '/cat'
              - '/ed'
              - '/head'
              - '/more'
              - '/nano'
              - '/tail'
              - '/vi'
              - '/vim'
              - '/less'
              - '/emacs'
              - '/sqlite3'
              - '/makemap'
          CommandLine|contains:
              - '/etc/passwd'
              - '/etc/shadow'
              - '/etc/sudoers'
              - '/etc/spwd.db'
              - '/etc/pwd.db'
              - '/etc/master.passwd'
      selection_4:
          Image|endswith: '/id'
      selection_5:
          Image|endswith: '/lsof'
          CommandLine|contains: '-u'
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
