title: Linux Auditd Possible Access Or Modification Of Sshd Config File
id: 71853c9b-7185-4185-a185-71853c9b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1098.004
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_auditd_possible_access_or_modification_of_sshd_config_file.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1098.004
logsource:
  product: linux
  service: auditd
detection:
  selection:
    # Original splunk detection logic
    # `linux_auditd`
    #   (
    #     (type=PATH nametype IN ("NORMAL", "CREATE", "DELETE"))
    #     OR
    #     type=CWD
    #   )
    #   | rex "msg=audit\([^)]*:(?<audit_id>\d+)\)"
    # 
    #   | stats
    #     values(type) as types
    #     values(name) as names
    #     values(nametype) as nametype
    #     values(cwd) as cwd_list
    #     values(_time) as event_times
    #     by audit_id, host
    # 
    #   | eval current_working_directory = coalesce(mvindex(cwd_list, 0), "N/A")
    #   | eval candidate_paths = mvmap(names, if(match(names, "^/"), names, current_working_directory + "/" + names))
    #   | eval matched_paths = mvfilter(match(candidate_paths, "/etc/ssh/ssh_config.*"))
    #   | eval match_count = mvcount(matched_paths)
    #   | eval reconstructed_path = mvindex(matched_paths, 0)
    #   | eval e_time = mvindex(event_times, 0)
    #   | where match_count > 0
    #   | rename host as dest
    # 
    #   | stats count min(e_time) as firstTime max(e_time) as lastTime
    #     values(nametype) as nametype
    #     by current_working_directory
    #        reconstructed_path
    #        match_count
    #        dest
    #        audit_id
    # 
    #   | `security_content_ctime(firstTime)`
    #   | `security_content_ctime(lastTime)`
    #   |  `linux_auditd_possible_access_or_modification_of_sshd_config_file_filter`
  condition: selection
level: medium
