title: Communication To LocaltoNet Tunneling Service Initiated - Linux
id: 91c361cd-6be9-4aae-a960-41472fbad526
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1090/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_domain_localtonet_tunnel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1090
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          DestinationHostname|endswith:
              - '.localto.net'
              - '.localtonet.com'
          Initiated: 'true'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
