title: Suspicious C2 Activities
id: 86de3e69-b793-44e0-bf9e-f5da9b918e9a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1095.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1095/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_susp_c2_commands.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1095
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          key: 'susp_activity'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
