title: Communication To LocaltoNet Tunneling Service Initiated - Linux
id: 44d2d3af-d6f6-47e6-975d-e2394de1f17d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1102.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1102/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_domain_localtonet_tunnel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1102
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          DestinationHostname|endswith:
              - '.localto.net'
              - '.localtonet.com'
          Initiated: 'true'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
