title: BPFDoor Abnormal Process ID or Lock File Accessed
id: 8efc0d8a-50ae-4f57-94d9-c667d49829cc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1106.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1106/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_bpfdoor_file_accessed.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1106
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name:
              - /var/run/haldrund.pid
              - /var/run/xinetd.lock
              - /var/run/kdevrund.pid
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
