title: Clipboard Collection with Xclip Tool - Auditd
id: a9f9ee94-dd97-4379-ab0c-73e512f7ba37
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1115.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_clipboard_collection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1115
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: EXECVE
          a0: xclip
          a1:
              - '-selection'
              - '-sel'
          a2:
              - clipboard
              - clip
          a3: '-o'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
