title: Deprecated - Potential Successful Linux FTP Brute Force Attack Detected
id: 281160e0-2811-4811-a811-281160e00000
status: stable
description: Detection rule for MITRE ATT&CK technique T1110.003
references:
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_successful_linux_ftp_bruteforce.toml
author: elastic (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1110.003
logsource:
  product: linux
  service: auditd
detection:
  selection:
    # Original elastic detection logic
    # sequence by host.id, auditd.data.addr, related.user with maxspan=5s
    #   [authentication where host.os.type == "linux" and event.action == "authenticated" and
    #    auditd.data.terminal == "ftp" and event.outcome == "failure" and auditd.data.addr != null and
    #    auditd.data.addr != "0.0.0.0" and auditd.data.addr != "::"] with runs=10
    #   [authentication where host.os.type == "linux" and event.action  == "authenticated" and
    #    auditd.data.terminal == "ftp" and event.outcome == "success" and auditd.data.addr != null and
    #    auditd.data.addr != "0.0.0.0" and auditd.data.addr != "::"] | tail 1
  condition: selection
level: medium
