title: Audio Capture
id: 7b1c6b3d-3772-4da6-b1c2-31db10d510d3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1123.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1123/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_audio_capture.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1123
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_execve:
          type: EXECVE
          a0: arecord
          a1: '-vv'
          a2: '-fdat'
      selection_syscall_memfd_create:
          type: SYSCALL
          exe|endswith: "/ecasound"
          SYSCALL: 'memfd_create'
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
