title: Linux Video Recording or Screenshot Activity Detected
id: a24023d1-3313-43a8-9860-4c54c41f3c0a
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1125.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1125/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/collection_potential_video_recording_or_screenshot_activity.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1125
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    host.os.type: 'linux'
    event.type: 'start'
    event.action: 'exec'
    process.name: 'gnome-screenshot'
    process.args: '-h'
    event.category: 'process'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
