title: Suspicious C2 Activities
id: 79924754-9a7c-4e94-beb1-c2b31ec3a220
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1132.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1132/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/lnx_auditd_susp_c2_commands.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1132
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          key: 'susp_activity'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
