title: Creation Of An User Account
id: 221a8fe6-4589-4a42-9edc-79b006e129f4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1136/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_create_account.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1136.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_syscall_record_type:
          type: 'SYSCALL'
          exe|endswith: '/useradd'
      selection_add_user_record_type:
          type: 'ADD_USER' # This is logged without having to configure audit rules on both Ubuntu and Centos
      condition: 1 of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
