title: Linux Base64 Encoded Pipe to Shell
id: 7ff9f581-735f-45a8-9250-f47e9da120f4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1140.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1140/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_base64_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1140
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_base64:
          CommandLine|contains: 'base64 '
      selection_exec:
          - CommandLine|contains:
                - '| bash '
                - '| sh '
                - '|bash '
                - '|sh '
          - CommandLine|endswith:
                - ' |sh'
                - '| bash'
                - '| sh'
                - '|bash'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
