title: Suspicious OpenSSH Daemon Error
id: 71b5dda9-53f2-48cd-ad41-d08722bac449
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1190.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1190/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/builtin/sshd/lnx_sshd_susp_ssh.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1190
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      keywords:
          - 'unexpected internal error'
          - 'unknown or unsupported key type'
          - 'invalid certificate signing key'
          - 'invalid elliptic curve value'
          - 'incorrect signature'
          - 'error in libcrypto'
          - 'unexpected bytes remain after decoding'
          - 'fatal: buffer_get_string: bad string'
          - 'Local: crc32 compensation attack'
          - 'bad client public DH value'
          - 'Corrupted MAC on input'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
