title: Suspicious Download and Execute Pattern via Curl/Wget
id: 0cbbf849-b367-4a8e-b53c-df183c52fddb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1203.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1203/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_curl_wget_exec_tmp.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1203
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_downloader:
          CommandLine|contains:
              - '/curl'
              - '/wget'
      selection_tmp:
          CommandLine|contains:
              - '/tmp/'
              - '/dev/shm/'
      selection_executor:
          CommandLine|contains: 'sh -c'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
