title: Linux Auditd Hardware Addition Swapoff
id: 796818cf-7d3f-4c35-8c0e-200b85cf3515
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1200.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1200/
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/linux_auditd_hardware_addition_swapoff.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1200
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    proctitle:
      - '*swapoff*'
      - '*-a*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
