title: System Binary Symlink to Suspicious Location
id: d4fa633e-9906-4531-89c2-aa3467b7e1fb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1202.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_symlink_binary_to_writable_dir.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1202
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    host.os.type: 'linux'
    event.category: 'process'
    event.type: 'start'
    event.action: 'exec'
    process.parent.executable: '(*'
    process.name: 'ln'
    process.args: 'ln'
    process.parent.args: '(/usr/bin/qemu-aarch64-static'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
