title: Guacamole Two Users Sharing Session Anomaly
id: c242eb0b-33d2-4494-8047-48f378f6ddb5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1212.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1212/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/builtin/guacamole/lnx_guacamole_susp_guacamole.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1212
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          - '(2 users now present)'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
