title: Potential Linux Amazon SSM Agent Hijacking
id: 0e51dfcf-3691-4ace-b6fe-e5ac8280fe34
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1219.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1219/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_ssm_agent_abuse.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1219.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/amazon-ssm-agent'
          CommandLine|contains|all:
              - '-register '
              - '-code '
              - '-id '
              - '-region '
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
