title: Proxy Shell Execution via Busybox
id: 66d03805-8361-47c6-9409-806126549c80
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1218.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1218/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_busybox_indirect_shell_spawn.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1218
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.parent.args:
      - 'crond'
      - '/var/atlassian/application-data/bamboo-agent*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
