title: Remove Immutable File Attribute - Auditd
id: 90f18971-f7e9-4507-b9d4-3c728f44e225
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1222.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1222/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_chattr_immutable_removal.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1222.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'EXECVE'
          a0|contains: 'chattr'
          a1|contains: '-i'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
