title: Overwriting the File with Dev Zero or Null
id: ec7d0f9e-e6dd-4c7a-a6b5-09ed77cf4873
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1485.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1485/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_dd_delete_file.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1485
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'EXECVE'
          a0|contains: 'dd'
          a1|contains:
              - 'if=/dev/null'
              - 'if=/dev/zero'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
