title: Potential Abuse of Linux Magic System Request Key
id: d69e8e95-72fd-467e-a4c0-dea2e2bed5eb
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1489.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1489/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_magic_system_request_key.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1489
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name|endswith:
              # Enable
              - '/sysrq'
              - '/sysctl.conf'
              # Execute
              - '/sysrq-trigger'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
