title: Potential Abuse of Linux Magic System Request Key
id: 70eec334-70ee-40ee-a0ee-70eec3340000
status: stable
description: Detection rule for MITRE ATT&CK technique T1489
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_magic_system_request_key.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1489
logsource:
  product: linux
  service: auditd
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         type: 'PATH'
    #         name|endswith:
    #             # Enable
    #             - '/sysrq'
    #             - '/sysctl.conf'
    #             # Execute
    #             - '/sysrq-trigger'
    #     condition: selection
    # 
  condition: selection
level: medium
