title: Suspicious Data Encryption via OpenSSL Utility
id: f712b78c-a53c-4a86-83a8-9f23c96dbd27
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1486.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1486/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/impact_data_encrypted_via_openssl.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1486
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.parent.name:
      - 'bash'
      - 'xargs'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
