title: Linux Crypto Mining Indicators
id: a1541f2d-4941-41da-9d87-b6b354844811
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1496.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1496/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_crypto_mining.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1496
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          CommandLine|contains:
              - ' --cpu-priority='
              - '--donate-level=0'
              - ' -o pool.'
              - ' --nicehash'
              - ' --algo=rx/0 '
              - 'stratum+tcp://'
              - 'stratum+udp://'
              # Sub process started by xmrig - the most popular Monero crypto miner - unknown if this causes any false positives
              - 'sh -c /sbin/modprobe msr allow_writes=on'
              # base64 encoded: --donate-level=
              - 'LS1kb25hdGUtbGV2ZWw9'
              - '0tZG9uYXRlLWxldmVsP'
              - 'tLWRvbmF0ZS1sZXZlbD'
              # base64 encoded: stratum+tcp:// and stratum+udp://
              - 'c3RyYXR1bSt0Y3A6Ly'
              - 'N0cmF0dW0rdGNwOi8v'
              - 'zdHJhdHVtK3RjcDovL'
              - 'c3RyYXR1bSt1ZHA6Ly'
              - 'N0cmF0dW0rdWRwOi8v'
              - 'zdHJhdHVtK3VkcDovL'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
