title: Linux Crypto Mining Pool Connections
id: 5ff0fe34-11d5-4358-80dc-c7e45d1e6311
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1496.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1496/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_crypto_mining_indicators.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1496
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          DestinationHostname:
              - 'pool.minexmr.com'
              - 'fr.minexmr.com'
              - 'de.minexmr.com'
              - 'sg.minexmr.com'
              - 'ca.minexmr.com'
              - 'us-west.minexmr.com'
              - 'pool.supportxmr.com'
              - 'mine.c3pool.com'
              - 'xmr-eu1.nanopool.org'
              - 'xmr-eu2.nanopool.org'
              - 'xmr-us-east1.nanopool.org'
              - 'xmr-us-west1.nanopool.org'
              - 'xmr-asia1.nanopool.org'
              - 'xmr-jp1.nanopool.org'
              - 'xmr-au1.nanopool.org'
              - 'xmr.2miners.com'
              - 'xmr.hashcity.org'
              - 'xmr.f2pool.com'
              - 'xmrpool.eu'
              - 'pool.hashvault.pro'
              - 'moneroocean.stream'
              - 'monerocean.stream'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
