title: Potential Abuse of Linux Magic System Request Key
id: 8a6eea52-7fcb-4f88-94a8-4ae09c21b363
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1499.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1499/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_magic_system_request_key.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1499
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name|endswith:
              # Enable
              - '/sysrq'
              - '/sysctl.conf'
              # Execute
              - '/sysrq-trigger'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
