title: Webshell Remote Command Execution
id: 8e5e05bc-bb16-4fe1-b95f-0f2665ecb224
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1505.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_web_rce.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1505.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          SYSCALL:
              - 'execve'
              - 'execveat'
          euid: 33
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
