title: Group Has Been Deleted Via Groupdel
id: a4bdbdc9-454f-4bc3-95c6-2a5e284b0d56
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1531.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1531/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_groupdel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1531
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/groupdel'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
