title: Suspicious APT Package Manager Execution
id: 90064d50-10c7-46c9-abb5-6d1454958da9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/persistence_apt_package_manager_execution.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    By: 'Packages'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
