title: Linux Capabilities Discovery
id: 6bfaa733-9271-4a71-bc44-6d6c27712e36
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_capabilities_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: EXECVE
          a0: getcap
          a1: '-r'
          a2: '/'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
