title: Executable Bit Set for Potential Persistence Script
id: 73d52461-a02d-4736-9001-f6f0cbaf6ad9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.013.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1547/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/persistence_potential_persistence_script_executable_bit_set.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1547.013
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.args:
      - '+x*'
      - '7*'
      - '-m*'
      - '7*'
      - '1*'
    process.parent.executable: '/var/lib/dpkg/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
