title: Unix Shell Configuration Modification
id: 2f9fb45d-083f-404e-a528-94161e048693
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1546/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_unix_shell_configuration_modification.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1546.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name:
              - '/etc/shells'
              - '/etc/profile'
              - '/etc/profile.d/*'
              - '/etc/bash.bashrc'
              - '/etc/bashrc'
              - '/etc/zsh/zprofile'
              - '/etc/zsh/zshrc'
              - '/etc/zsh/zlogin'
              - '/etc/zsh/zlogout'
              - '/etc/csh.cshrc'
              - '/etc/csh.login'
              - '/root/.bashrc'
              - '/root/.bash_profile'
              - '/root/.profile'
              - '/root/.zshrc'
              - '/root/.zprofile'
              - '/home/*/.bashrc'
              - '/home/*/.zshrc'
              - '/home/*/.bash_profile'
              - '/home/*/.zprofile'
              - '/home/*/.profile'
              - '/home/*/.bash_login'
              - '/home/*/.bash_logout'
              - '/home/*/.zlogin'
              - '/home/*/.zlogout'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
