title: Special File Creation via Mknod Syscall
id: 66433c27-1962-4dc5-a3d8-0c45048e87e1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1543.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1543/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_susp_special_file_creation_via_mknod_syscall.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1543.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          SYSCALL: 'mknod'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
