title: Loading of Kernel Module via Insmod
id: a5727d30-2740-445c-a78e-26d340a79967
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1547.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1547/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_load_module_insmod.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1547.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'SYSCALL'
          comm: insmod
          exe: /usr/bin/kmod
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
