title: Suspicious APT Package Manager Execution
id: c1f93886-6f21-42bf-bce0-bd934769772c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1546.016.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1546/016/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/persistence_apt_package_manager_execution.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1546.016
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    By: 'Packages'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
