title: Suspicious History File Operations - Linux
id: 95b6a26f-dab9-4745-8fee-b5cd196316fe
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_susp_histfile_operations.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      execve:
          type: EXECVE
      history:
          - '.bash_history'
          - '.zsh_history'
          - '.zhistory'
          - '.history'
          - '.sh_history'
          - 'fish_history'
      condition: execve and history
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
