title: Install Root Certificate
id: 9dfe1437-5dd4-47fe-a344-8edf22b478a9
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1553.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1553/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_install_root_certificate.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1553.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/update-ca-certificates'
              - '/update-ca-trust'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
