title: Credentials In Files - Linux
id: 365d174e-654d-45b1-95a2-9163d91f0b2e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_find_cred_in_files.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'EXECVE'
      keywords:
          '|all':
              - 'grep'
              - 'password'
      condition: selection and keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
