title: Credentials In Files - Linux
id: 8020d949-bde8-4e41-ae4c-f8c4f1494096
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_find_cred_in_files.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'EXECVE'
      keywords:
          '|all':
              - 'grep'
              - 'password'
      condition: selection and keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
