title: Linux Setgid Capability Set on a Binary via Setcap Utility
id: 267ced27-bbe7-494d-a3c0-500d55073eae
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1554.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1554/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_cap_setgid.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1554
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/setcap'
          CommandLine|contains: 'cap_setgid'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
