title: Potential OpenSSH Backdoor Logging Activity
id: 131289f3-feaf-4db3-887f-0f1909f083c7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1556/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/credential_access_ssh_backdoor_log.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1556
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    file.name:
      - '.*'
      - '*~'
      - '.cache'
      - '.git*'
    file.extension:
      - 'in'
      - '9'
    file.path:
      - '/tmp/*'
      - '/var/run/udevd.pid'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
