title: Potential THC Tool Downloaded
id: 085d904d-d989-4c3e-84f8-767e45b0b5c5
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1563.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1563/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/lateral_movement_ssh_it_worm_download.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1563.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.args:
      - 'https://github.com/hackerschoice/*'
      - 'https://gsocket.io/*'
    https: '//github.com/hackerschoice/*'
    http: '//nossl.segfault.net/*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
