title: ESXi Syslog Configuration Change Via ESXCLI
id: 56a17ecd-45c8-4f7a-b4a4-557853561102
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_esxcli_syslog_config_change.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith: '/esxcli'
          CommandLine|contains|all:
              - 'system'
              - 'syslog'
              - 'config'
          CommandLine|contains: ' set'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
