title: Auditing Configuration Changes on Linux Host
id: 536fa5be-9851-42c2-aafb-6a3bb7168eae
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_auditing_config_change.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: PATH
          name:
              - /etc/audit/*
              - /etc/libaudit.conf
              - /etc/audisp/*
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
