title: Commands to Clear or Remove the Syslog - Builtin
id: 87b6eec9-44d4-48d1-b39e-e4ec9cdfc1d2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1565.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1565/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/builtin/lnx_clear_syslog.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1565.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          - 'rm /var/log/syslog'
          - 'rm -r /var/log/syslog'
          - 'rm -f /var/log/syslog'
          - 'rm -rf /var/log/syslog'
          - 'mv /var/log/syslog'
          - ' >/var/log/syslog'
          - ' > /var/log/syslog'
      falsepositives:
          - '/syslog.'
      condition: selection and not falsepositives
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
