title: Unusual Interactive Shell Launched from System User
id: 7a6c6cba-6f6e-4fcb-bf12-f2f0c33ba8a3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1564.002.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1564/002/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_interactive_shell_from_system_user.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1564.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.parent.args: '/usr/bin/apt-key'
    process.parent.executable: '/usr/lib/polkit-1/polkitd'
    process.parent.command_line: 'runc init'
    process.executable: '/opt/gitlab/embedded/bin/bundle'
    event.category: 'process'
    host.os.type: 'linux'
    event.type: 'start'
    event.action: 'exec'
    user.name: '('
    process.interactive: 'true'
    process.parent.name: '('
    process.args: '(/etc/apt/trusted.gpg.d/*'
    process.name: '(awk'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
