title: Data Compressed
id: f2c31374-2527-4623-8791-77f3a30d79d7
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1560.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1560/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_data_compressed.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1560.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection1:
          type: 'execve'
          a0: 'zip'
      selection2:
          type: 'execve'
          a0: 'gzip'
          a1: '-k'
      selection3:
          type: 'execve'
          a0: 'tar'
          a1|contains: '-c'
      condition: 1 of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
