title: Suspicious Curl File Upload - Linux
id: 313315e0-03f0-4446-b076-9f7ed2387258
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1567.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1567/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_curl_fileupload.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1567
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_img:
          Image|endswith: '/curl'
      selection_cli:
          - CommandLine|contains:
                - ' --form' # Also covers the "--form-string"
                - ' --upload-file '
                - ' --data '
                - ' --data-' # For flags like: "--data-ascii", "--data-binary", "--data-raw", "--data-urlencode"
          - CommandLine|re: '\s-[FTd]\s' # We use regex to ensure a case sensitive argument detection
      filter_optional_localhost:
          CommandLine|contains:
              - '://localhost'
              - '://127.0.0.1'
      condition: all of selection_* and not 1 of filter_optional_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
