title: Communication To Ngrok Tunneling Service - Linux
id: 367d5f14-4481-4764-bad2-0f275a4126b4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1568.002.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1568/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_ngrok_tunnel.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1568.002
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          DestinationHostname|contains:
              - 'tunnel.us.ngrok.com'
              - 'tunnel.eu.ngrok.com'
              - 'tunnel.ap.ngrok.com'
              - 'tunnel.au.ngrok.com'
              - 'tunnel.sa.ngrok.com'
              - 'tunnel.jp.ngrok.com'
              - 'tunnel.in.ngrok.com'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
