title: Sensitive Files Compression
id: 83cc4510-55f3-472f-be21-af2b5b28c0b8
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1560.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1560/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/credential_access_collection_sensitive_files.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1560
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    event.action: 'exec'
    event.category: 'process'
    host.os.type: 'linux'
    event.type: 'start'
    process.name: '(zip'
    process.args: '('
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
