title: Potentially Suspicious Malware Callback Communication - Linux
id: 10139586-1580-4097-8296-8f056cb50060
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1571.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1571/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/network_connection/net_connection_lnx_susp_malware_callback_port.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1571
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Initiated: 'true'
          DestinationPort:
              - 888
              - 999
              - 2200
              - 2222
              - 4000
              - 4444
              - 6789
              - 8531
              - 50501
              - 51820
      filter_main_local_ranges:
          DestinationIp|cidr:
              - '127.0.0.0/8'
              - '10.0.0.0/8'
              - '172.16.0.0/12'
              - '192.168.0.0/16'
              - '169.254.0.0/16'
              - '::1/128'         # IPv6 loopback
              - 'fe80::/10'       # IPv6 link-local addresses
              - 'fc00::/7'        # IPv6 private addresses
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
