title: Dynamic Linker Creation
id: b5bd35c5-579f-43b9-9981-931f8c5ed4b4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1574/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/defense_evasion_dynamic_linker_file_creation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1574
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.executable:
      - '/nix/store/*'
      - '/usr/libexec/platform-python*'
    file.name:
      - 'sed*'
      - 'e2scrub_all.tmp*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
