title: Suspicious Kworker UID Elevation
id: fc4f0624-d614-4ba5-99d6-282518b22f22
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.013.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1574/013/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/privilege_escalation_kworker_uid_elevation.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1574.013
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    process.name: 'kworker*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
