title: Use Of Hidden Paths Or Files
id: 8aaed9d0-e26e-476f-8947-c4a5c35cc3a2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_hidden_binary_execution.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name|contains: '/.'
      filter:
          name|contains:
              - '/.cache/'
              - '/.config/'
              - '/.pyenv/'
              - '/.rustup/toolchains'
      condition: selection and not filter
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
