title: Potential Privilege Escalation via PKEXEC
id: 3c51f7ff-b090-48b4-b92c-f23d158b4c2d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.007.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1574/007/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/privilege_escalation_pkexec_envar_hijack.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1574.007
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    file.path: '/*GCONV_PATH*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
