title: Modification of ld.so.preload
id: d8497f13-20c1-4f69-aaac-6f54efc5ede3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1574.006.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1574/006/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/path/lnx_auditd_ld_so_preload_mod.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1574.006
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          type: 'PATH'
          name: '/etc/ld.so.preload'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
