title: Relevant ClamAV Message
id: 32e4f9f5-5f9a-4bf5-a158-add297c61e78
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1588.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1588/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/builtin/clamav/lnx_clamav_relevant_message.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1588.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      keywords:
          - 'Trojan*FOUND'
          - 'VirTool*FOUND'
          - 'Webshell*FOUND'
          - 'Rootkit*FOUND'
          - 'Htran*FOUND'
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
