title: Print History File Contents
id: 0ea33040-4a03-40c3-b795-4bca96784ab3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1592.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1592/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_history_recon.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1592.004
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection:
          Image|endswith:
              - '/cat'
              - '/head'
              - '/tail'
              - '/more'
      selection_history:
          - CommandLine|contains:
                - '/.bash_history'
                - '/.zsh_history'
          - CommandLine|endswith:
                - '_history'
                - '.history'
                - 'zhistory'
      condition: all of selection*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
