title: Suspicious Network Tool Launched Inside A Container
id: d5040937-82b1-4d43-b8f2-97612611c666
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1595.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1595/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/discovery_suspicious_network_tool_launched_inside_container.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1595
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    placeholder: true
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
