title: Suspicious Git Clone - Linux
id: eef7589d-cc0d-4892-8a49-15c284635a0f
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1593.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1593/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_susp_git_clone.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1593.003
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_img:
          Image|endswith: '/git'
          CommandLine|contains: ' clone '
      selection_keyword:
          CommandLine|contains:
              # Add more suspicious keywords
              - 'exploit'
              - 'Vulns'
              - 'vulnerability'
              - 'RCE'
              - 'RemoteCodeExecution'
              - 'Invoke-'
              - 'CVE-'
              - 'poc-'
              - 'ProofOfConcept'
              # Add more vuln names
              - 'proxyshell'
              - 'log4shell'
              - 'eternalblue'
              - 'eternal-blue'
              - 'MS17-'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
