title: Kernel Load or Unload via Kexec Detected
id: c54f0e3c-d184-4309-a0d8-a7e7caa1f799
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1601.001.
  Original source: elastic
references:
  - https://attack.mitre.org/techniques/T1601/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/linux/privilege_escalation_load_and_unload_of_kernel_via_kexec.toml
author: GapMATRIX (sourced from elastic)
date: 2026-01-28
tags:
  - attack.t1601.001
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    placeholder: true
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
