title: Mask System Power Settings Via Systemctl
id: 2d1057de-d802-4c7a-baa3-68b859b88d6d
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1653.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1653/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/process_creation/proc_creation_lnx_systemctl_mask_power_settings.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1653
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
      selection_systemctl:
          Image|endswith: '/systemctl'
          CommandLine|contains: ' mask'
      selection_power_options:
          CommandLine|contains:
              - 'suspend.target'
              - 'hibernate.target'
              - 'hybrid-sleep.target'
      condition: all of selection_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
