title: Application Layer Protocol (WINDOWS - defender)
id: a53aa27c-144a-4673-a512-12929497b1f1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: BQTLock
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.bqtlock
