title: 2aed01ad-3df3-4410-a8cb-11ea4ded587c (MACOS)
id: 20eb20e5-5cf3-4686-b24e-1d9518dbbd55
description: >
  Detects techniques consistent with MITRE ATT&CK technique 2aed01ad-3df3-4410-a8cb-11ea4ded587c.
references:
  - https://attack.mitre.org/techniques/2aed01ad-3df3-4410-a8cb-11ea4ded587c/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|contains: process
    CommandLine|contains: cmd
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.2aed01ad-3df3-4410-a8cb-11ea4ded587c
