title: Windows Command Shell (LINUX)
id: 2e1c3ab4-9dea-4918-ac74-acfa71511d92
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.003.
references:
  - https://attack.mitre.org/techniques/T1059.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.003
