title: Query Registry - Spectra (security)
id: 27e71e7a-37fb-48ef-8c9f-186c1dce95ce
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1012 (Query Registry).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_aadhealth_mon_agent_regkey_access.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1012
  - actor.spectra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectType|contains: 'Key'
    ObjectName|contains:
      - '\REGISTRY\MACHINE\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent'
      - 'Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe'
      - 'Microsoft.Identity.Health.Adfs.InsightsService.exe'
      - 'Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe'
      - 'Microsoft.Identity.Health.Adfs.PshSurrogate.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
