title: Automated Collection - Spectra (security)
id: 35355336-453b-4a32-9687-e48b4ab6e4c3
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1119 (Automated Collection).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1119/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_susp_automated_collection.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1119
  - actor.spectra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    OriginalFileName|contains:
      - 'FINDSTR.EXE'
      - ' /e '
      - ' /si '
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
