title: Software Extensions - Spectra (security)
id: bafaa6a7-01c7-4de6-8e6c-4ff371b99ea6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1176 (Software Extensions).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1176/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/persistence_browser_extension_install.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1176
  - actor.spectra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    event.type|contains: 'creation'
    file.name|contains: '*.crx'
    file.path|contains: '?:\\Users\\*\\AppData\\Local\\*\\*\\User Data\\Webstore Downloads\\*'
    process.name|contains: 'firefox.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
