title: Hide Artifacts - Spectra (security)
id: 5a195e36-604a-4b63-98b2-36879f7efd91
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564 (Hide Artifacts).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564/
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/o365/defense_evasion_exchange_new_inbox_rule_delete_or_move.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564
  - actor.spectra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    event.dataset|contains: 'o365.audit'
    event.action|contains: 'New-InboxRule'
    event.outcome|contains: 'success'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
