title: Hidden Files and Directories - Spectra (security)
id: bb62364b-0579-46ca-ab19-7382a413f26f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1564.001 (Hidden Files and Directories).
  Associated threat actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_adding_the_hidden_file_attribute_with_via_attribexe.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1564.001
  - actor.spectra
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains: 'attrib.exe'
    process.args|contains: '+h'
    process.parent.name|contains: 'draw.io.exe'
    process.command_line|contains:
      - '*drawio.bkp*'
      - '*drawio.dtmp*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
