title: External Remote Services (MACOS - unified_logging)
id: 2886ea8e-66c7-4e6f-a69e-d5a8395573bc
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: APT18
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/TeamViewer_Service'
    Image|endswith|contains:
      - '/TeamViewer_Desktop'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.apt18
