title: T1078 (GOOGLE - workspace)
id: 68fe9c1f-7a8a-4017-9c86-9a0e1f7b93ff
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.ransomhub
