title: T1078.003 (GOOGLE - workspace)
id: 3a2a33f3-28fb-4d0f-bbaa-5e24b3deb77b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.003.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1078.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078.003
  - actor.ransomhub
