title: T1083 (GOOGLE - workspace)
id: 102c43c0-4970-4694-aaed-06c9b78cbb00
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: RansomHub
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.ransomhub
