title: Service Execution (GOOGLE - workspace)
id: 0b26deea-1edc-4591-a7f4-00e5ad434fc2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1569.002.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1569.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    placeholder: true
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1569.002
  - actor.medusa
