title: Application Layer Protocol (MACOS - unified_logging)
id: 65d7e513-fadb-473e-aee0-e2eb057bc4ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/package_script_service'
      - '/installer'
    Image|endswith|contains:
      - '/sh'
      - '/bash'
      - '/dash'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.inc_ransom
