title: Service Stop (LINUX - auditd)
id: fd544187-3cac-482c-a7e9-ed3abe5ad29e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1489.
  Threat Actor: Medusa
references:
  - https://attack.mitre.org/techniques/T1489/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    name|endswith|contains:
      - '/sysrq'
      - '/sysctl.conf'
      - '/sysrq-trigger'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1489
  - actor.medusa
