title: Security Account Manager (WINDOWS - security)
id: 17738cf1-e488-49ca-a1c8-71e148f07eb5
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.002.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1003.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ShareName|contains:
      - '\\\\\*\\ADMIN$'
    ServiceFileName|contains|contains:
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.002
  - actor.menupass
