title: System Network Configuration Discovery (WINDOWS - security)
id: a65b015d-21d8-45a6-ba51-12ea82c05b40
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'netsh'
      - 'show '
      - 'firewall '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.menupass
