title: Code Signing (WINDOWS - security)
id: 6c346517-a5d8-4046-a952-c84eb6174c46
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1553.002.
  Threat Actor: menuPass
references:
  - https://attack.mitre.org/techniques/T1553.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectName|endswith|contains:
      - '.AAA'
      - '.ZZZ'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1553.002
  - actor.menupass
