title: System Network Connections Discovery (LINUX - auditd)
id: ec1c03c7-51b6-45f6-8f64-314209073245
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: APT41
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
    ParentCommandLine|contains|contains:
      - '/usr/bin/landscape-sysinfo'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.apt41
