title: Ingress Tool Transfer - Akira (entra_id)
id: 543e8048-7b5a-48c7-9e4c-d3af46fa6a5d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1105 (Ingress Tool Transfer).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/command_and_control_google_drive_malicious_file_download.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1105
  - actor.akira
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    process.name|contains:
      - 'Microsoft Edge'
      - 'wget.exe'
    process.command_line|contains: '*confirm=no_antivirus*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
