title: Password Spraying - Akira (entra_id)
id: d523ae11-4932-472c-8086-5aabc07b4244
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1110.003 (Password Spraying).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/credential_access_potential_linux_ssh_bruteforce_root.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1110.003
  - actor.akira
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    user.name|contains:
      - '*root*'
      - '*admin*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
