title: External Proxy - AvosLocker (security)
id: efcbe1e9-274e-4e65-95a1-7a2494e9a68e
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1090.002 (External Proxy).
  Associated threat actor: AvosLocker
references:
  - https://attack.mitre.org/techniques/T1090/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_rdp_reverse_tunnel.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1090.002
  - actor.avoslocker
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5156'
    SourcePort|contains:
      - '3389'
      - '127.*'
      - '::1'
    DestPort|contains:
      - '3389'
      - '127.*'
      - '::1'
    FilterOrigin|contains: 'AppContainer Loopback'
    filter_thor|contains:
      - '# checking BlueKeep vulnerability'
      - '\thor.exe'
      - '\thor64.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
