title: External Remote Services (MACOS - unified_logging)
id: a7e0efa6-2857-430e-8687-4e416c7d94b4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Kazu
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/TeamViewer_Service'
    Image|endswith|contains:
      - '/TeamViewer_Desktop'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.kazu
