title: Match Legitimate Resource Name or Location (WINDOWS - security)
id: bc927f1f-2b56-42b1-9f2f-5e56ed07beca
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: Blue Mockingbird
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/create'
      - '-create'
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.blue_mockingbird
