title: System Owner/User Discovery - BianLian (auditd)
id: 98f56c5b-28a3-41d7-adea-41cab3d72e60
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1033 (System Owner/User Discovery).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1033/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_user_discovery.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1033
  - actor.bianlian
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'EXECVE'
      - 'hostname'
      - 'id'
      - 'last'
      - 'uname'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
