title: File and Directory Discovery - BianLian (auditd)
id: 2e033f2c-63d1-4df2-901a-616ce8da815a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/execve/lnx_auditd_capabilities_discovery.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.bianlian
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains: 'EXECVE'
    a0|contains: 'getcap'
    a1|contains: '-r'
    a2|contains: '/'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
