title: Web Shell - BianLian (auditd)
id: f7a74ae4-8d9a-4712-8c01-8008787fdeca
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1505.003 (Web Shell).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1505/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_web_rce.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1505.003
  - actor.bianlian
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - 'execve'
      - 'execveat'
    euid|contains: '33'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
