title: Develop Capabilities - BianLian (auditd)
id: 92c80ccc-7cf4-4042-975a-b6a00656d697
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1587 (Develop Capabilities).
  Associated threat actor: BianLian
references:
  - https://attack.mitre.org/techniques/T1587/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/linux/auditd/syscall/lnx_auditd_susp_exe_folders.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1587
  - actor.bianlian
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    type|contains:
      - 'SYSCALL'
      - '/tmp/'
      - '/var/lib/pgsql/data/'
      - '/usr/local/mysql/data/'
      - '/var/lib/mysql/'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
