title: Valid Accounts - REvil (auditd)
id: 29749850-48fb-4260-8bf3-072bb57b34f9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1078 (Valid Accounts).
  Associated threat actor: REvil
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_login_failures.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1078
  - actor.revil
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    event.action|contains: 'failed-log-in-too-many-times-to'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
