title: Cached Domain Credentials (WINDOWS - sysmon)
id: ae1f827b-db12-41eb-9e6c-79b0bb314e3a
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1003.005.
  Threat Actor: MuddyWater
references:
  - https://attack.mitre.org/techniques/T1003.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' -l'
    CommandLine|contains|contains:
      - '::aadcookie'
      - '::detours'
      - '::memssp'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1003.005
  - actor.muddywater
