title: Match Legitimate Resource Name or Location (WINDOWS - sysmon)
id: 0ed3db7d-73ee-4760-8d84-80e701778d2c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.005.
  Threat Actor: MuddyWater
references:
  - https://attack.mitre.org/techniques/T1036.005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '/create'
      - '-create'
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.005
  - actor.muddywater
