title: Live Memory Dump Using Powershell
id: 4541e5ad-4541-4541-a541-4541e5ad0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_memorydump_getstoragediagnosticinfo.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1003
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains|all:
    #             - 'Get-StorageDiagnosticInfo'
    #             - '-IncludeLiveDump'
    #     condition: selection
    # 
  condition: selection
level: medium
