title: Dynamic .NET Compilation Via Csc.EXE
id: 4bb34caf-4bb3-4bb3-abb3-4bb34caf0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1027.004
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csc_susp_dynamic_compilation.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1027.004
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         Image|endswith: '\csc.exe'
    #     selection_susp_location_1:
    #         CommandLine|contains:
    #             - ':\Perflogs\'
    #             - ':\Users\Public\'
    #             - '\AppData\Local\Temp\' # User execution
    #             - '\Temporary Internet'
    #             - '\Windows\Temp\' # Admin execution
    #     selection_susp_location_2:
    #         - CommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Favorites\'
    #         - CommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Favourites\'
    #         - CommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Contacts\'
    #         - CommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Pictures\'
    #     selection_susp_location_3:
    #         CommandLine|re: '([Pp]rogram[Dd]ata|%([Ll]ocal)?[Aa]pp[Dd]ata%|\\[Aa]pp[Dd]ata\\([Ll]ocal([Ll]ow)?|[Rr]oaming))\\[^\\]{1,256}$'
    #     filter_main_programfiles:
    #         # Note: this is a generic filter. You could baseline execution in your env for a more robust rule
    #         ParentImage|startswith:
    #             - 'C:\Program Files (x86)\' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #             - 'C:\Program Files\' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #     filter_main_sdiagnhost:
    #         ParentImage: 'C:\Windows\System32\sdiagnhost.exe' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #     filter_main_w3p:
    #         ParentImage: 'C:\Windows\System32\inetsrv\w3wp.exe' # https://twitter.com/gabriele_pippi/status/1206907900268072962
    #     filter_optional_chocolatey:
    #         ParentImage: # Chocolatey https://chocolatey.org/
    #             - 'C:\ProgramData\chocolatey\choco.exe'
    #             - 'C:\ProgramData\chocolatey\tools\shimgen.exe'
    #     filter_optional_defender:
    #         ParentCommandLine|contains: '\ProgramData\Microsoft\Windows Defender Advanced Threat Protection'
    #     filter_optional_ansible:
    #         # Note: As ansible is widely used we exclude it with this generic filter.
    #         # A better opt
    # ... [truncated]
  condition: selection
level: medium
