title: Windows Binaries Write Suspicious Extensions
id: 5515067d-5515-4515-a515-5515067d0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1036
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_shell_write_susp_files_extensions.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1036
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_generic:
    #         Image|endswith:
    #             - '\csrss.exe'
    #             - '\lsass.exe'
    #             - '\RuntimeBroker.exe'
    #             - '\sihost.exe'
    #             - '\smss.exe'
    #             - '\wininit.exe'
    #             - '\winlogon.exe'
    #         TargetFilename|endswith:
    #             - '.bat'
    #             - '.dll'
    #             - '.exe'
    #             - '.hta'
    #             - '.iso'
    #             - '.ps1'
    #             - '.txt'
    #             - '.vbe'
    #             - '.vbs'
    #     selection_special:
    #         Image|endswith:
    #             - '\dllhost.exe'
    #             - '\rundll32.exe'
    #             - '\svchost.exe'
    #         TargetFilename|endswith:
    #             - '.bat'
    #             - '.hta'
    #             - '.iso'
    #             - '.ps1'
    #             - '.vbe'
    #             - '.vbs'
    #     filter_main_AppLockerPolicyTest:
    #         Image: 'C:\Windows\System32\dllhost.exe'
    #         TargetFilename|contains|all:
    #             - ':\Users\'
    #             - '\AppData\Local\Temp\__PSScriptPolicyTest_'
    #         TargetFilename|endswith: '.ps1'
    #     filter_main_script_gpo_machine:
    #         Image: 'C:\Windows\system32\svchost.exe'
    #         TargetFilename|contains|all:
    #             - 'C:\Windows\System32\GroupPolicy\DataStore\'
    #             - '\sysvol\'
    #             - '\Policies\'
    #             - '\Machine\Scripts\Startup\'
    #         TargetFilename|endswith:
    #             - '.ps1'
    #             - '.bat'
    #     filter_main_clipchamp:
    #         Image: 'C:\Windows\system32\svchost.exe'
    #         TargetFilename|contains|all:
    #             - 'C:\Program Files\WindowsApps\Clipchamp'
    #             - '.ps1'
    #     filter_main_powershell_preview:
    #         Image:
    #             - 'C:\Windows\system32\svchost.exe'
    #             - 'C:\Windows\SysWOW64\svchost.exe'
    #         TargetFilename|startswith:
    #             - 'C:\Program Files\WindowsApps\Microsoft.PowerShellPreview'
    #             - 'C:\Program Files (x86)\WindowsApps\Microsoft.PowerShellPreview'
    #         TargetFilename|endswith: '.ps1'
    #     condition: 1 of selection_* and not 1 of filter_main_*
    # 
  condition: selection
level: medium
