title: Renamed Powershell Under Powershell Channel
id: 393d9631-393d-493d-a93d-393d96310000
status: stable
description: Detection rule for MITRE ATT&CK technique T1036.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_classic/posh_pc_renamed_powershell.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1036.003
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         Data|contains: 'HostName=ConsoleHost'
    #     # Note: Powershell Logging Data is localized. Meaning that "HostApplication" field will be translated to a different field on a non english layout. This rule doesn't take this into account due to the sheer amount of possibilities. It's up to the user to add these cases.
    #     filter_main_ps:
    #         Data|contains:
    #             - 'HostApplication=powershell'
    #             - 'HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell'
    #             - 'HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell'
    #             # In some cases powershell was invoked with inverted slashes
    #             - 'HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell'
    #             - 'HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell'
    #             - 'HostApplication=C:\\\\WINDOWS\\\\system32\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe'
    #             - 'HostApplication=C:\\\\WINDOWS\\\\SysWOW64\\\\WindowsPowerShell\\\\v1.0\\\\powershell.exe'
    #     filter_main_host_application_null:
    #         # Note: Since we're using the raw data field to match. There is no easy way to filter out cases where the "HostApplication" field is null (i.e doesn't exist). We're practically forced to use a regex.
    #         # If you're already mapping and extracting the field, then obviously use that directly.
    #         Data|re: 'HostId=[a-zA-Z0-9-]{36}\s+EngineVersion='
    #     condition: selection and not 1 of filter_main_*
    # 
  condition: selection
level: medium
