title: Windows Shell/Scripting Application File Write to Suspicious Folder
id: 2303ca80-2303-4303-a303-2303ca800000
status: stable
description: Detection rule for MITRE ATT&CK technique T1059
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_event/file_event_win_shell_write_susp_directory.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1059
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_1:
    #         Image|endswith:
    #             - '\bash.exe'
    #             - '\cmd.exe'
    #             - '\cscript.exe'
    #             - '\msbuild.exe'  # https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml
    #             - '\powershell.exe'
    #             - '\pwsh.exe'
    #             - '\sh.exe'
    #             - '\wscript.exe'
    #         TargetFilename|startswith:
    #             - 'C:\PerfLogs\'
    #             - 'C:\Users\Public\'
    #     selection_2:
    #         Image|endswith:
    #             - '\certutil.exe'
    #             - '\forfiles.exe'
    #             - '\mshta.exe'
    #             # - '\rundll32.exe' # Potential FP
    #             - '\schtasks.exe'
    #             - '\scriptrunner.exe'
    #             - '\wmic.exe'  # https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
    #         TargetFilename|contains:
    #             - 'C:\PerfLogs\'
    #             - 'C:\Users\Public\'
    #             - 'C:\Windows\Temp\'
    #     condition: 1 of selection_*
    # 
  condition: selection
level: medium
