title: Registry Modification Attempt Via VBScript - PowerShell
id: 39e6cd82-39e6-49e6-a9e6-39e6cd820000
status: stable
description: Detection rule for MITRE ATT&CK technique T1059.005
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_vbscript_registry_modification.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1059.005
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains|all:
    #             - 'CreateObject'
    #             - 'Wscript.shell'
    #             - '.RegWrite'
    #     condition: selection
    # 
  condition: selection
level: medium
