title: Exchange PowerShell Cmdlet History Deleted
id: 0d59a8ed-0d59-4d59-ad59-0d59a8ed0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1070
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file/file_delete/file_delete_win_delete_exchange_powershell_logs.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1070
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         TargetFilename|startswith: '\Logging\CmdletInfra\LocalPowerShell\Cmdlet\'
    #         TargetFilename|contains: '_Cmdlet_'
    #     condition: selection
    # 
  condition: selection
level: medium
