title: Windows PowerView AD Access Control List Enumeration
id: 2d31990b-2d31-4d31-ad31-2d31990b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1078.002
references:
  - https://github.com/splunk/security_content/blob/develop/detections/endpoint/windows_powerview_ad_access_control_list_enumeration.yml
author: splunk (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1078.002
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original splunk detection logic
    # `powershell` EventCode=4104  (ScriptBlockText=*get-objectacl* OR ScriptBlockText=*Get-DomainObjectAcl*)
    #   | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by dest
    #   signature signature_id user_id vendor_product EventID Guid Opcode Name Path ProcessID
    #   ScriptBlockId ScriptBlockText | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
    #   | `windows_powerview_ad_access_control_list_enumeration_filter`
  condition: selection
level: medium
