title: System Information Discovery via Registry Queries
id: 68a78498-68a7-48a7-a8a7-68a784980000
status: stable
description: Detection rule for MITRE ATT&CK technique T1082
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_discovery_via_reg_queries.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1082
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_cmd_reg:
    #         Image|endswith: '\reg.exe'
    #         CommandLine|contains: 'query'
    #         CommandLine|contains|windash: '-v'
    #     selection_cmd_powershell:
    #         Image|endswith:
    #             - '\powershell.exe'
    #             - '\pwsh.exe'
    #         CommandLine|contains:
    #             - 'Get-ItemPropertyValue'
    #             - 'gpv'
    #     selection_keys:
    #         CommandLine|contains:
    #             - '\SOFTWARE\Microsoft\Windows Defender' # Details about defender state
    #             - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion' # Provides details about the OS
    #             - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall' # Lists installed programs
    #             - '\SYSTEM\CurrentControlSet\Control\TimeZoneInformation' # Contains time zone details
    #             - '\SYSTEM\CurrentControlSet\Services' # Details about existing services
    #     condition: 1 of selection_cmd_* and selection_keys
    # 
  condition: selection
level: medium
