title: Powershell Local Email Collection
id: 12737f13-1273-4273-a273-12737f130000
status: stable
description: Detection rule for MITRE ATT&CK technique T1114.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_susp_mail_acces.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1114.001
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains:
    #             - 'Get-Inbox.ps1'
    #             - 'Microsoft.Office.Interop.Outlook'
    #             - 'Microsoft.Office.Interop.Outlook.olDefaultFolders'
    #             - '-comobject outlook.application'
    #     condition: selection
    # 
  condition: selection
level: medium
