title: PowerShell Create Local User
id: 018a0064-018a-418a-a18a-018a00640000
status: stable
description: Detection rule for MITRE ATT&CK technique T1136.001
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_create_local_user.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1136.001
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains: 'New-LocalUser'
    #     condition: selection
    # 
  condition: selection
level: medium
