title: New BITS Job Created Via PowerShell
id: 06c809bb-06c8-46c8-a6c8-06c809bb0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1197
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/bits_client/win_bits_client_new_job_via_powershell.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1197
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         EventID: 3
    #         processPath|endswith:
    #             - '\powershell.exe'
    #             - '\pwsh.exe'
    #     condition: selection
    # 
  condition: selection
level: medium
