title: Suspicious Outlook Child Process
id: 1c9f15b3-1c9f-4c9f-ac9f-1c9f15b30000
status: stable
description: Detection rule for MITRE ATT&CK technique T1204.002
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_office_outlook_susp_child_processes.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1204.002
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ParentImage|endswith: '\OUTLOOK.EXE'
    #         Image|endswith:
    #             - '\AppVLP.exe'
    #             - '\bash.exe'
    #             - '\cmd.exe'
    #             - '\cscript.exe'
    #             - '\forfiles.exe'
    #             - '\hh.exe'
    #             - '\mftrace.exe'
    #             - '\msbuild.exe'        # https://github.com/elastic/detection-rules/blob/c76a39796972ecde44cb1da6df47f1b6562c9770/rules/windows/defense_evasion_execution_msbuild_started_by_office_app.toml
    #             - '\msdt.exe'           # CVE-2022-30190
    #             - '\mshta.exe'
    #             - '\msiexec.exe'
    #             - '\powershell.exe'
    #             - '\pwsh.exe'
    #             - '\regsvr32.exe'
    #             - '\schtasks.exe'
    #             - '\scrcons.exe'
    #             - '\scriptrunner.exe'
    #             - '\sh.exe'
    #             - '\svchost.exe'        # https://www.vmray.com/analyses/2d2fa29185ad/report/overview.html
    #             - '\wmic.exe'           # https://app.any.run/tasks/c903e9c8-0350-440c-8688-3881b556b8e0/
    #             - '\wscript.exe'
    #             # Several FPs with rundll32.exe
    #             # We started excluding specific use cases and ended up commenting out the rundll32.exe sub processes completely
    #             # - '\rundll32.exe'
    #             # filter_outlook_photoviewer:  # https://twitter.com/Luke_Hamp/status/1495919717760237568
    #             #   ParentImage|endswith: '\OUTLOOK.EXE'
    #             #   Image|endswith: '\rundll32.exe'
    #             #   CommandLine|contains: '\PhotoViewer.dll'
    #             # filter_outlook_printattachments:  # https://twitter.com/KickaKamil/status/1496238278659485696
    #             #   ParentImage|endswith: '\OUTLOOK.EXE'
    #             #   Image|endswith: '\rundll32.exe'
    #             #   CommandLine|contains|all:
    #             #     - 'shell32.dll,Control_RunDLL'
    #             #     - '\SYSTEM32\SPOOL\DRIVERS\'
    #     condition: selection # and not 1 of filter*
    # 
  condition: selection
level: medium
