title: Csc.EXE Execution Form Potentially Suspicious Parent
id: 42ad09f5-42ad-42ad-a2ad-42ad09f50000
status: stable
description: Detection rule for MITRE ATT&CK technique T1218.005
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creation_win_csc_susp_parent.yml
author: sigma (via IncidentBuddy)
date: 2026-02-08
tags:
  - attack.t1218.005
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_img:
    #         - Image|endswith: '\csc.exe'
    #         - OriginalFileName: 'csc.exe'
    #     selection_parent_generic:
    #         ParentImage|endswith:
    #             - '\cscript.exe'
    #             - '\excel.exe'
    #             - '\mshta.exe'
    #             - '\onenote.exe'
    #             - '\outlook.exe'
    #             - '\powerpnt.exe'
    #             - '\winword.exe'
    #             - '\wscript.exe'
    #     selection_parent_powershell:
    #         ParentImage|endswith:
    #             - '\powershell.exe'
    #             - '\pwsh.exe'
    #         ParentCommandLine|contains:
    #             - '-Encoded '
    #             - 'FromBase64String'
    #     selection_parent_susp_location:
    #         - ParentCommandLine|re: '([Pp]rogram[Dd]ata|%([Ll]ocal)?[Aa]pp[Dd]ata%|\\[Aa]pp[Dd]ata\\([Ll]ocal([Ll]ow)?|[Rr]oaming))\\[^\\]{1,256}$'
    #         - ParentCommandLine|contains:
    #               - ':\PerfLogs\'
    #               - ':\Users\Public\'
    #               - ':\Windows\Temp\'
    #               - '\Temporary Internet'
    #         - ParentCommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Favorites\'
    #         - ParentCommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Favourites\'
    #         - ParentCommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Contacts\'
    #         - ParentCommandLine|contains|all:
    #               - ':\Users\'
    #               - '\Pictures\'
    #     filter_main_programfiles:
    #         # Note: this is a generic filter. You could baseline execution in your env for a more robust rule
    #         ParentImage|startswith:
    #             - 'C:\Program Files (x86)\' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #             - 'C:\Program Files\' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #     filter_main_sdiagnhost:
    #         ParentImage: 'C:\Windows\System32\sdiagnhost.exe' # https://twitter.com/gN3mes1s/status/1206874118282448897
    #     filter_main_w3p:
    #         ParentImage: 'C:\Windows\System32\inetsrv\w3wp.exe' # https://twitter.com/gabriele_pippi/status/1206907900268072962
    #     f
    # ... [truncated]
  condition: selection
level: medium
