title: Powershell WMI Persistence
id: 0f766037-0f76-4f76-af76-0f7660370000
status: stable
description: Detection rule for MITRE ATT&CK technique T1546.003
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_wmi_persistence.yml
author: sigma (via IncidentBuddy)
date: 2026-01-28
tags:
  - attack.t1546.003
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection_ioc:
    #         - ScriptBlockText|contains|all:
    #               - 'New-CimInstance '
    #               - '-Namespace root/subscription '
    #               - '-ClassName __EventFilter '
    #               - '-Property ' # is a variable name
    #         - ScriptBlockText|contains|all:
    #               - 'New-CimInstance '
    #               - '-Namespace root/subscription '
    #               - '-ClassName CommandLineEventConsumer '
    #               - '-Property ' # is a variable name
    #     condition: selection_ioc
    # 
  condition: selection
level: medium
