title: Powershell Add Name Resolution Policy Table Rule
id: 4521091b-4521-4521-a521-4521091b0000
status: stable
description: Detection rule for MITRE ATT&CK technique T1565
references:
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/posh_ps_add_dnsclient_rule.yml
author: sigma (via IncidentBuddy)
date: 2026-02-01
tags:
  - attack.t1565
logsource:
  product: windows
  service: powershell
detection:
  selection:
    # Original sigma detection logic
    #     selection:
    #         ScriptBlockText|contains|all:
    #             - 'Add-DnsClientNrptRule'
    #             - '-Namesp'
    #             - '-NameSe'
    #     condition: selection
    # 
  condition: selection
level: medium
