title: Indirect Command Execution - Shinra (sysmon)
id: ffe5e3b4-bf51-411b-b085-6c2a0fce92bf
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1202 (Indirect Command Execution).
  Associated threat actor: Shinra
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_indirect_exec_conhost.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1202
  - actor.shinra
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    process.name|contains: 'conhost.exe'
    process.args|contains: '--headless'
    process.command_line|contains:
      - '*powershell*'
      - '*mhsta*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
