title: Drive-by Compromise - Hive (unified_logging)
id: 32d22048-7f61-478d-bc5c-cdf8867002a2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1189 (Drive-by Compromise).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1189/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/initial_access_cross_site_scripting.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1189
  - actor.hive
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    url.fragment|contains:
      - '<iframe*'
      - '*onmouseover=*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
