title: NTDS - SafePay (security)
id: d3b786f6-94e6-4d54-853f-0db5daa6e3fe
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.003 (NTDS).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1003/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_impacket_secretdump.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.003
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5145'
    ShareName|contains:
      - '\\\\\*\\ADMIN$'  # looking for the string  \\*\ADMIN$'
      - 'SYSTEM32\'
      - '.tmp'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
