title: Visual Basic - SafePay (security)
id: 451e6d16-64eb-4a1c-87c6-571e81fa6e5a
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1059.005 (Visual Basic).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1059/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_remote_file_copy_scripts.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1059.005
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'wscript.exe'
      - 'cscript.exe'
    network.direction|contains:
      - 'outgoing'
      - 'egress'
    file.extension|contains:
      - 'exe'
      - 'dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
