title: Parent PID Spoofing - SafePay (security)
id: d9cb4d9a-79f9-49d9-8437-d34649b4e5dd
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1134.004 (Parent PID Spoofing).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1134/004/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/defense_evasion_parent_process_pid_spoofing.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1134.004
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.pe.original_file_name|contains:
      - 'winword.exe'
      - 'msxsl.exe'
    process.executable|contains:
      - '?:\\Windows\\System32\\WerFaultSecure.exe'
      - '?:\\Windows\\SysWOW64\\WerFault.exe'
    process.code_signature.status|contains: 'errorBadDigest'
    process.name|contains: 'msedge.exe'
    process.parent.name|contains: 'sihost.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
