title: Remote Desktop Software - SafePay (security)
id: 9426d8d3-76b6-428d-93d8-c603513ace6c
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1219.002 (Remote Desktop Software).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1219/002/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/application/msiinstaller/win_software_atera_rmm_agent_install.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1219.002
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '1033'
    Provider_Name|contains: 'MsiInstaller'
    Message|contains: 'AteraAgent'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
