title: MMC - SafePay (security)
id: 45a21e20-1146-4a39-9bb9-194ff7abebf4
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.014 (MMC).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1218/014/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/execution_via_mmc_console_file_unusual_path.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.014
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    process.executable|contains: '?:\\Windows\\System32\\mmc.exe'
    process.args|contains:
      - '?:\\Windows\\System32\\*.msc'
      - '?:\\Windows\\ADFS\\Microsoft.IdentityServer.msc'
    process.command_line|contains:
      - 'C:\\Windows\\system32\\mmc.exe eventvwr.msc /s'
      - '\'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
