title: Windows Management Instrumentation Event Subscription - SafePay (security)
id: c64a0f3e-0636-45f9-8607-b8581a968846
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1546.003 (Windows Management Instrumentation Event Subscription).
  Associated threat actor: SafePay
references:
  - https://attack.mitre.org/techniques/T1546/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_wmi_persistence.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1546.003
  - actor.safepay
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '4662'
    ObjectType|contains: 'WMI Namespace'
    ObjectName|contains: 'subscription'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
