title: Cached Domain Credentials - Lynx (security)
id: a6ef85f3-1fd0-42b3-a42a-85751da57cb2
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003.005 (Cached Domain Credentials).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1003/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_creddumper.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003.005
  - actor.lynx
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains:
      - '4697'
      - 'cachedump'
      - 'dumpsvc'
      - 'fgexec'
      - 'gsecdump'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
