title: OS Credential Dumping - Lynx (security)
id: 4a544e5e-9477-45ae-b9bd-20e8fbc69d13
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_mal_wceaux_dll.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.lynx
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectName|contains: '\wceaux.dll'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
