title: Keylogging - Lynx (security)
id: 07690e0b-1096-4b75-b4b5-e03f0060a0ab
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1056.001 (Keylogging).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1056/001/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_keylogger.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1056.001
  - actor.lynx
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
    powershell.file.script_block_text|contains: 'sentinelbreakpoints'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
