title: Clipboard Data - Lynx (security)
id: 05fa8b86-5cd7-4da7-90e2-33b17a517c99
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1115 (Clipboard Data).
  Associated threat actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1115/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_clipboard_capture.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1115
  - actor.lynx
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    powershell.file.script_block_text|contains: 'Set-Alias -Name \'
    user.id|contains: 'S-1-5-18'
    file.name|contains: 'Convert-ExcelRangeToImage.ps1'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
