title: Masquerade Task or Service (WINDOWS - security)
id: b95ddc4a-5e20-47e0-92d3-95084c0ada6c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: FIN6
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.fin6
