title: Domain Account (WINDOWS - security)
id: a381d27c-6c5c-486b-9231-fef35364a9cd
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1087.002.
  Threat Actor: FIN6
references:
  - https://attack.mitre.org/techniques/T1087.002/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    ObjectType|contains:
      - 'SAM_USER'
      - 'SAM_GROUP'
    ObjectType|contains|contains:
      - 'bf967aba-0de6-11d0-a285-00aa003049e2'
    AccessMask|contains:
      - '0x2d'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1087.002
  - actor.fin6
