title: Protocol Tunneling (WINDOWS - security)
id: 59cd1210-ec3f-4b99-9f96-440c1c71826c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1572.
  Threat Actor: FIN6
references:
  - https://attack.mitre.org/techniques/T1572/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - ' tunnel '
      - ' run '
    CommandLine|contains|contains:
      - ' -R '
    Description|contains:
      - 'Command-line SSH, Telnet, and Rlogin client'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1572
  - actor.fin6
