title: Steal Application Access Token (WINDOWS - sysmon)
id: 0ab270ea-9fbf-4a9b-b59e-ac0153101264
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1528.
  Threat Actor: APT29
references:
  - https://attack.mitre.org/techniques/T1528/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    OriginalFileName|contains:
      - 'BrowserCore.exe'
    Image|endswith|contains:
      - '\Microsoft\Teams\current\Teams.exe'
    CommandLine|contains|contains:
      - '\Microsoft\Teams\Cookies'
      - '\Microsoft\Teams\Local Storage\leveldb'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1528
  - actor.apt29
