title: Data from Local System (WINDOWS - security)
id: f9a9c1d9-92fe-464f-9ed9-397be65b5cf2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1005.
  Threat Actor: HAFNIUM
references:
  - https://attack.mitre.org/techniques/T1005/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - '-r'
    Image|endswith|contains:
      - '\sqlcmd.exe'
    CommandLine|contains|all|contains:
      - 'SELECT'
      - 'TOP'
      - '[VeeamBackup].[dbo].[Credentials]'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1005
  - actor.hafnium
