title: SSH (WINDOWS - security)
id: d9625bc1-f9e5-4460-9df3-9d5777421790
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1021.004.
  Threat Actor: FIN7
references:
  - https://attack.mitre.org/techniques/T1021.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\ssh.exe'
    CommandLine|contains|windash|contains:
      - ' -R '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1021.004
  - actor.fin7
