title: Remote Access Tools (WINDOWS - defender)
id: e76692d5-6383-433f-9b19-f04fab3d382e
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1219.
  Threat Actor: Cobalt Group
references:
  - https://attack.mitre.org/techniques/T1219/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|contains|contains:
      - '\TacticalAgent\tacticalrmm.exe'
    CommandLine|contains|all|contains:
      - '.exe tunnel'
      - '--accept-server-license-terms'
    ParentImage|endswith|contains:
      - '\Velociraptor.exe'
    CommandLine|endswith|contains:
      - '.exe tunnel'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1219
  - actor.cobalt_group
