title: Masquerading - ALPHV-BlackCat (defender)
id: 217b869d-6f6b-4d3c-86cb-1af437db08ac
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1036 (Masquerading).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1036/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_potential_processherpaderping.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1036
  - actor.alphv-blackcat
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    process.parent.executable|contains:
      - '?:\\Windows\\SoftwareDistribution\\*.exe'
      - '?:\\Program Files (x86)\\Trend Micro\\*.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
