title: Modify Registry - ALPHV-BlackCat (defender)
id: f71dfa7d-8ea7-44ef-9279-915b981c3f9d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1112 (Modify Registry).
  Associated threat actor: ALPHV-BlackCat
references:
  - https://attack.mitre.org/techniques/T1112/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_port_forwarding_added_registry.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1112
  - actor.alphv-blackcat
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    registry.path|contains: '*\\SYSTEM\\*ControlSet*\\Services\\PortProxy\\v4tov4\\*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
