title: Valid Accounts (WINDOWS - security)
id: 5cb8780f-4beb-4c54-ba32-900a9db5fa46
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1078.
  Threat Actor: UNC2165
references:
  - https://attack.mitre.org/techniques/T1078/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1078
  - actor.unc2165
