title: Query Registry - Cl0p (workspace)
id: 9859b665-4ab2-4008-abb1-bdced7a49897
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1012 (Query Registry).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1012/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_query_registry_via_reg.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1012
  - actor.cl0p
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains: 'reg.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
