title: File and Directory Discovery - Cl0p (workspace)
id: d6e2d77a-c759-40ea-bb1c-dd495c89053f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1083 (File and Directory Discovery).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1083/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/discovery_file_dir_discovery.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1083
  - actor.cl0p
logsource:
  product: google
  service: workspace
  category: admin_activity
detection:
  selection:
    process.name|contains: 'tree.com'
    process.args|contains: 'dir'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
