title: OS Credential Dumping - Akira (unified_logging)
id: 2cfd1033-98a7-4363-b593-1a3d3681927d
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1003 (OS Credential Dumping).
  Associated threat actor: Akira
references:
  - https://attack.mitre.org/techniques/T1003/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/credential_access_gitleaks_execution.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1003
  - actor.akira
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'gitleaks.exe'
      - 'gitleaks'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
