title: System Network Configuration Discovery (MACOS - unified_logging)
id: da897eae-ee3b-4239-9462-d01264bb1cd2
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1016.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1016/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/arp'
      - '/ifconfig'
      - '/netstat'
    Image|contains:
      - '/usr/bin/defaults'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1016
  - actor.akira
