title: Local Groups (MACOS - unified_logging)
id: 27e229ef-6c0d-4ec8-8689-381502901179
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1069.001.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1069.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/dscacheutil'
    CommandLine|contains|all|contains:
      - '-q'
      - 'group'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1069.001
  - actor.akira
