title: Phishing (MACOS - unified_logging)
id: b8d6ac9e-8013-4e92-8d4f-6702f1d2a675
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.
  Threat Actor: Akira
references:
  - https://attack.mitre.org/techniques/T1566/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    ParentImage|endswith|contains:
      - '/Script Editor'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566
  - actor.akira
