title: Software Deployment Tools (WINDOWS - security)
id: 2c99e8a2-92b8-487b-9548-15a4c730ab22
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1072.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1072/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Company|contains:
      - 'Microsoft Corporation'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1072
  - actor.sandworm_team
