title: External Remote Services (WINDOWS - security)
id: 5ba3a63f-f8b0-444b-a5a3-e58fb50a07e9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1133.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1133/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    IpAddress|contains|contains:
      - '-'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1133
  - actor.sandworm_team
