title: Credentials from Web Browsers (WINDOWS - security)
id: 746c2e7e-8d77-47af-afc2-563c51964012
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.003.
  Threat Actor: Sandworm Team
references:
  - https://attack.mitre.org/techniques/T1555.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - '\User Data\'
      - '\Opera Software\'
      - '\ChromiumViewer\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555.003
  - actor.sandworm_team
