title: Network Service Discovery (LINUX - auditd)
id: 65d3db6f-075e-4e56-9f57-be2fd0a3fa1c
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1046.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1046/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'SYSCALL'
    exe|endswith|contains:
      - '/telnet'
      - '/nmap'
      - '/netcat'
    CommandLine|re|contains:
      - '-(W|R)\s?(\s|"|')([0-9a-fA-F]{2}\s?){2,20}(\s|"|')'
    Image|endswith|contains:
      - '/autorecon'
      - '/hping'
      - '/hping2'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1046
  - actor.vect_raas
