title: Unix Shell (LINUX - auditd)
id: a44e1986-f78f-4917-8d14-792784540455
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.004.
  Threat Actor: Vect RaaS
references:
  - https://attack.mitre.org/techniques/T1059.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: linux
  service: auditd
  category: process_creation

detection:
  selection:
    type|contains:
      - 'PATH'
    a0|contains:
      - 'chmod'
    name|endswith|contains:
      - '/sysrq'
      - '/sysctl.conf'
      - '/sysrq-trigger'
    Image|endswith|contains:
      - 'bpftrace'
    CommandLine|contains|contains:
      - '--unsafe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.004
  - actor.vect_raas
