title: Azure Kubernetes CronJob
id: c6b978d7-7b2d-404c-8d75-bb6146f1ac06
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1053.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1053/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_kubernetes_cronjob.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1053.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          operationName|startswith:
              - 'MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/BATCH'
              - 'MICROSOFT.CONTAINERSERVICE/MANAGEDCLUSTERS/BATCH'
          operationName|endswith:
              - '/CRONJOBS/WRITE'
              - '/JOBS/WRITE'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
