title: Azure New CloudShell Created
id: e3b7f445-d59f-42bb-af94-58e9b04580a0
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1059.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1059/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_new_cloudshell_created.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1059
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          operationName: MICROSOFT.PORTAL/CONSOLES/WRITE
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
