title: User Added to an Administrator
id: 10783b22-1d21-4e01-813a-5dee5c1b79df
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_ad_user_added_to_admin_role.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          Operation: 'Add member to role.'
          Workload: 'AzureActiveDirectory'
          ModifiedProperties{}.NewValue|endswith:
              - 'Admins'
              - 'Administrator'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
