title: Azure Login Bypassing Conditional Access Policies
id: b1ba3351-573a-40c5-adf4-6bfcb7b91991
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1078.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1078/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/audit/microsoft365_bypass_conditional_access.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1078
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          Operation: 'UserLoggedIn'
          ApplicationId: '9ba1a5c7-f17a-4de9-a1f1-6178c8d51223'
          ResultStatus: 'Success'
          RequestType: 'Cmsi:Cmsi'
      filter_main_bjectid:
          ObjectId: '0000000a-0000-0000-c000-000000000000' # Microsoft Intune seen when mobile devices are enrolled
      condition: selection and not 1 of filter_main_*
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
