title: Malicious IP Address Sign-In Failure Rate
id: 4b0ee408-4a1b-484a-ae05-281550ea749c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1090.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1090/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_malicious_ip_address.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1090
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          riskEventType: 'maliciousIPAddress'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
