title: Added Credentials to Existing Application
id: 0d946692-a5e3-4897-8236-f111b4d81bcc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.001.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_app_credential_added.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098.001
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          properties.message:
              - Update application – Certificates and secrets management
              - Update Service principal/Update Application
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
