title: Windows LAPS Credential Dump From Entra ID
id: a4230841-a815-4295-a9d2-a21679a0d9b3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.005.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/005/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_auditlogs_laps_credential_dumping.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098.005
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          category: 'Device'
          activityType|contains: 'Recover device local administrator password'
          additionalDetails.additionalInfo|contains: 'Successfully recovered local credential by device id'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
