title: Number Of Resource Creation Or Deployment Activities
id: b291267a-e807-4ec0-9c42-8fe8f2948eb2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1098/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_creating_number_of_resources_detection.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1098
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      keywords:
          - Microsoft.Compute/virtualMachines/write
          - Microsoft.Resources/deployments/write
      condition: keywords
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
