title: Azure AD FullAccessAsApp Permission Assigned
id: 016e2d30-776b-4662-8631-bfae15d01307
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1098.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1098/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_fullaccessasapp_permission_assigned.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1098.002
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    category: 'AuditLogs'
    operationName: '\'
    newvalue: 'mvindex('
    input: 'newvalue'
    Permissions: '{}.RequiredAppPermissions{}.EntitlementId'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
