title: Microsoft Intune Device Health Scripts
id: 38e2146a-1def-431c-abc2-f9b17a48a8da
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1105.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1105
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    operationName: '*DeviceHealthScript*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
