title: Azure AD High Number Of Failed Authentications For User
id: 10a7826b-7a3f-4d0a-8217-0fbc216190e4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.001.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/001/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_high_number_of_failed_authentications_for_user.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.001
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    category: 'SignInLogs'
    errorCode: '50126'
    succeeded: 'false'
    span: '10m'
    value: 'null'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
