title: O365 Elevated Mailbox Permission Assigned
id: 0d6aec50-1b28-41bf-9c09-0d2cdf02e1e1
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1114/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/o365_elevated_mailbox_permission_assigned.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1114.002
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    Workload: 'Exchange'
    Operation: 'Add-MailboxPermission'
    AccessRights:
      - 'FullAccess'
      - 'ChangePermission'
      - 'ChangeOwner)'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
