title: Detect Distributed Password Spray Attempts
id: fd6e4c44-202f-4054-a992-ba273582a407
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1110/003/
  - https://github.com/splunk/security_content/blob/develop/detections/application/detect_distributed_password_spray_attempts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1110.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    datamodel: 'Authentication.Authentication'
    action: 'failure'
    user_agent: '*'
    span:
      - '10m'
      - '10m'
    limit: '0'
    value: '0'
    counter:
      - 'sourcetype+'
      - 'coalesce(counter,fnscounter)'
    upperBoundUser: '(comp_avg_user+comp_std_user*3),'
    upperBoundsrc: '(comp_avg_src+comp_std_src*3)'
    isOutlier:
      - 'if((unique_accounts'
      - '1'
    date_wday: 'strftime(_time,'
    date_hour: 'strftime(_time,'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
