title: PST Export Alert Using eDiscovery Alert
id: 69e8f38e-754c-402a-a793-f30ebbf79189
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1114/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_management/microsoft365_pst_export_alert.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1114
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: SecurityComplianceCenter
          eventName: 'eDiscovery search started or exported'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
