title: Suspicious Inbox Forwarding Identity Protection
id: dd1ee2d9-edfe-49e5-93ca-ff45eb5ab5a2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1114.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1114/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_inbox_forwarding_rule.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1114.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          riskEventType: 'suspiciousInboxForwarding'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
