title: Password Spray Activity
id: 07ee1f91-5d9b-424c-94ea-6415df5dae35
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1110.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1110/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_password_spray.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1110
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          riskEventType: 'passwordSpray'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
