title: New Federated Domain Added - Exchange
id: a8f8102e-4c37-4b8e-b08d-45530c38575b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1136.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1136/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/exchange/microsoft365_new_federated_domain_added_exchange.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1136.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: Exchange
          eventName: 'Add-FederatedDomain'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
