title: Suspicious Inbox Manipulation Rules
id: 9eed7a4c-7cc9-4b01-bf46-c86417411edc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1140.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1140/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_inbox_manipulation.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1140
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          riskEventType: 'mcasSuspiciousInboxManipulationRules'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
