title: Microsoft 365 - User Restricted from Sending Email
id: 88dbe9dc-1fcf-4d5e-9002-7233fa2a4212
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1199.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1199/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_management/microsoft365_user_restricted_from_sending_email.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1199
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: SecurityComplianceCenter
          eventName: 'User restricted from sending email'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
