title: Microsoft Intune Device Health Scripts
id: 5354527c-fcdb-4d11-a552-825a993d34e2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1202.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1202/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_device_health_scripts.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1202
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    operationName: '*DeviceHealthScript*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
