title: Azure Application Deleted
id: 99de5e5b-2874-4e40-a8e7-d1b1f1cddff4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1489.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1489/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_application_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1489
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          properties.message:
              - Delete application
              - Hard Delete application
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
