title: Changes to Device Registration Policy
id: 26893aa3-832e-4069-80d3-ca57a27b3150
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1484.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1484/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_ad_device_registration_policy_changes.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1484
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          Category: 'Policy'
          ActivityDisplayName: 'Set device registration policies'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
