title: Microsoft Intune Manual Device Management
id: 694f0822-ae48-4ece-ae87-aa7ee7104854
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1529.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1529/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/microsoft_intune_manual_device_management.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1529
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    operationName: '*ManagedDevice*'
    field: 'operationName'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
