title: Discovery Using AzureHound
id: 25656e34-f354-4bfe-b2e6-428a997986fc
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1526.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1526/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/signin_logs/azure_ad_azurehound_discovery.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1526
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          userAgent|contains: 'azurehound'
          ResultType: 0
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
