title: Delegated Permissions Granted For All Users
id: c2a332ce-467d-48b4-92a5-769b0c5b54c6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1528.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1528/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_app_delegated_permissions_all_users.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1528
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          properties.message: Add delegated permission grant
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
