title: Data Exfiltration to Unsanctioned Apps
id: 25e91758-3ab3-4d53-9289-dc3d44c77eb3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1537.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1537/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_management/microsoft365_data_exfiltration_to_unsanctioned_app.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1537
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: SecurityComplianceCenter
          eventName: 'Data exfiltration to unsanctioned apps'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
