title: CA Policy Removed by Non Approved Actor
id: 835ca714-4a43-426b-a56f-1dce8101ad7c
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1548.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1548/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/audit_logs/azure_aad_secops_ca_policy_removedby_bad_actor.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1548
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          properties.message: Delete conditional access policy
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
