title: Disabled MFA to Bypass Authentication Mechanisms
id: 482efc78-5ad9-4168-bce3-e6e04a8d654e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1556.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1556/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_mfa_disabled.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1556
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: AzureActiveDirectory
          eventName: 'Disable Strong Authentication.'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
