title: Azure Keyvault Key Modified or Deleted
id: f4939801-4d91-4ce6-bf8c-d21b18693f88
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1552.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1552/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_keyvault_key_modified_or_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1552
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          operationName:
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/UPDATE/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/CREATE
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/CREATE/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/IMPORT/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/RECOVER/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/RESTORE/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/DELETE
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/BACKUP/ACTION
              - MICROSOFT.KEYVAULT/VAULTS/KEYS/PURGE/ACTION
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
