title: Azure Firewall Modified or Deleted
id: e22c7fbf-4d08-4e7b-ae4e-92ba25a3a9a3
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.004.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/004/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_firewall_modified_or_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562.004
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          operationName:
              - MICROSOFT.NETWORK/AZUREFIREWALLS/WRITE
              - MICROSOFT.NETWORK/AZUREFIREWALLS/DELETE
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
