title: Azure AD Device Code Authentication
id: 558ef0af-aa20-4c64-bffc-528fca0b8ba6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1566.002.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1566/002/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_ad_device_code_authentication.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1566.002
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    category: 'SignInLogs'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
