title: Azure Kubernetes Events Deleted
id: 85aca362-73e8-4699-b233-e2a7be8ce26e
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1562.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1562/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_kubernetes_events_deleted.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1562
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          operationName: MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/EVENTS.K8S.IO/EVENTS/DELETE
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
