title: Azure Active Directory Hybrid Health AD FS Service Delete
id: a68ef891-9ffd-4fd5-9741-c3a5de7ada23
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1578.003.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1578/003/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_aadhybridhealth_adfs_service_delete.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1578.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          CategoryValue: 'Administrative'
          ResourceProviderValue: 'Microsoft.ADHybridHealthService'
          ResourceId|contains: 'AdFederationService'
          OperationNameValue: 'Microsoft.ADHybridHealthService/services/delete'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
