title: Activity from Suspicious IP Addresses
id: af92440e-ca66-4bbc-a288-06ff28dfcb5b
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1573.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_detection/microsoft365_from_susp_ip_addresses.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1573
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: SecurityComplianceCenter
          eventName: 'Activity from suspicious IP addresses'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
