title: Activity from Suspicious IP Addresses
id: 17ba336e-85a9-478d-b48b-d0de33bb3ae2
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1573.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/m365/threat_detection/microsoft365_from_susp_ip_addresses.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1573
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          eventSource: SecurityComplianceCenter
          eventName: 'Activity from suspicious IP addresses'
          status: success
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
