title: Azure Active Directory Hybrid Health AD FS New Server
id: b8498d37-265e-49da-80f0-aef461378fd4
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1578.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1578/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/activity_logs/azure_aadhybridhealth_adfs_new_server.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1578
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          CategoryValue: 'Administrative'
          ResourceProviderValue: 'Microsoft.ADHybridHealthService'
          ResourceId|contains: 'AdFederationService'
          OperationNameValue: 'Microsoft.ADHybridHealthService/services/servicemembers/action'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
