title: Azure AD Account Credential Leaked
id: 707acb5f-b3b7-46a7-8d9f-8e687db027a6
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1589.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1589/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/identity_protection/azure_identity_protection_leaked_credentials.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1589
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          riskEventType: 'leakedCredentials'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
