title: Azure Active Directory High Risk Sign-in
id: 0353d42e-e27a-4573-b3a7-ad39519cb3ab
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1586.003.
  Original source: splunk
references:
  - https://attack.mitre.org/techniques/T1586/003/
  - https://github.com/splunk/security_content/blob/develop/detections/cloud/azure_active_directory_high_risk_sign_in.yml
author: GapMATRIX (sourced from splunk)
date: 2026-01-28
tags:
  - attack.t1586.003
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
  selection:
    category: 'UserRiskEvents'
    riskLevel: 'high'
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
