title: Multifactor Authentication Denied
id: 5f96c196-e766-4e52-a53c-36dd4da5ca79
status: experimental
description: |
  Detection for MITRE ATT&CK technique T1621.
  Original source: sigma
references:
  - https://attack.mitre.org/techniques/T1621/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/signin_logs/azure_mfa_denies.yml
author: GapMATRIX (sourced from sigma)
date: 2026-01-28
tags:
  - attack.t1621
logsource:
  product: m365
  service: entra_id
  category: authentication
detection:
      selection:
          AuthenticationRequirement: 'multiFactorAuthentication'
          Status|contains: 'MFA Denied'
      condition: selection
  
  condition: selection
falsepositives:
  - Legitimate administrative activity
level: medium
