title: Query Registry (WINDOWS - defender)
id: 40f8837f-06e6-4aee-9342-85d266795054
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1012.
  Threat Actor: Yashma-Ator-Vietnamita
references:
  - https://attack.mitre.org/techniques/T1012/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\PCHunter64.exe'
      - '\PCHunter32.exe'
    CommandLine|contains|contains:
      - 'query'
    CommandLine|contains|windash|contains:
      - ' -E '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1012
  - actor.yashma-ator-vietnamita
