title: Steganography (WINDOWS - sysmon)
id: 99f0ebce-14c8-46bf-b0f7-a0562a1d7350
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1027.003.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1027.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - '.lnk'
      - '.lnk"'
      - '.lnk''
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1027.003
  - actor.lynx
