title: Python (WINDOWS - sysmon)
id: d6a075ae-bea8-4be9-8275-70fe2ab99de1
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1059.006.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1059.006/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Description|contains:
      - '\?'
    FileVersion|contains:
      - '\?'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1059.006
  - actor.lynx
