title: File and Directory Discovery (WINDOWS - sysmon)
id: 6d2ca469-b032-4cb0-a60b-b1c27311a653
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1083.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1083/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\notepad.exe'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1083
  - actor.lynx
