title: Security Software Discovery (WINDOWS - sysmon)
id: 8e345549-c128-4e52-a7e8-a5e4dfd02b1b
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1518.001.
  Threat Actor: Lynx
references:
  - https://attack.mitre.org/techniques/T1518.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|endswith|contains:
      - ' avira'
      - ' avira"'
      - ' cb'
    CommandLine|contains|contains:
      - ' 385201'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1518.001
  - actor.lynx
