title: Credentials from Password Stores (WINDOWS)
id: 0a4d9771-fc28-4f72-9f0b-19fba15f31da
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1555.
references:
  - https://attack.mitre.org/techniques/T1555/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    Image|endswith:
      - 'lsass.exe'
      - 'mimikatz.exe'
    CommandLine|contains:
      - 'sekurlsa'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1555
