title: Ingress Tool Transfer - INC Ransom (unified_logging)
id: 1cc48665-a202-4830-b089-0fe1da484712
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1105 (Ingress Tool Transfer).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1105/
  - https://github.com/elastic/detection-rules/blob/main/rules/cross-platform/command_and_control_google_drive_malicious_file_download.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1105
  - actor.inc_ransom
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains:
      - 'Microsoft Edge'
      - 'wget.exe'
    process.command_line|contains: '*confirm=no_antivirus*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
