title: Screen Capture - INC Ransom (unified_logging)
id: 93ba69d7-444a-4be6-879b-56c5f8f2d1eb
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1113 (Screen Capture).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1113/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_screencapture.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1113
  - actor.inc_ransom
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    Image|contains: '/usr/sbin/screencapture'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
