title: Malicious Link - INC Ransom (unified_logging)
id: 72c4d5cf-b8cc-46d0-b3a3-775fc28e6653
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1204.001 (Malicious Link).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1204/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/macos/process_creation/proc_creation_macos_susp_execution_macos_script_editor.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1204.001
  - actor.inc_ransom
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    ParentImage|contains:
      - '/Script Editor'
      - 'Image|endswith:'
      - '/curl'
      - '/bash'
      - '/sh'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
