title: Mshta - INC Ransom (unified_logging)
id: 7412a113-2f2b-46d0-b613-5eccb6f35f0f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218.005 (Mshta).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1218/005/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_mshta_making_network_connections.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218.005
  - actor.inc_ransom
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains: 'mshta.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
