title: Credentials from Web Browsers - INC Ransom (unified_logging)
id: 86c3fd89-d03c-4919-a6af-6e40f6edda1f
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1555.003 (Credentials from Web Browsers).
  Associated threat actor: INC Ransom
references:
  - https://attack.mitre.org/techniques/T1555/003/
  - https://github.com/elastic/detection-rules/blob/main/rules/macos/credential_access_keychain_pwd_retrieval_security_cmd.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1555.003
  - actor.inc_ransom
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.command_line|contains:
      - '*Chrome*'
      - '*Firefox*'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
