title: Registry Run Keys / Startup Folder (WINDOWS - defender)
id: 7eb62435-9dd3-4d41-b83f-8e541bde5ad9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1547.001.
  Threat Actor: Magaskosh
references:
  - https://attack.mitre.org/techniques/T1547.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'reg'
      - ' add '
    Image|endswith|contains:
      - '\reg.exe'
    CommandLine|contains|contains:
      - 'add'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1547.001
  - actor.magaskosh
