title: T1080 (GOOGLE - workspace)
id: 7ee41849-03ce-44c3-b4da-46596ca69705
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1080.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1080/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    Image|contains: process
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1080
  - actor.qilin
