title: Windows Service (GOOGLE - workspace)
id: d57d46f1-819b-4ced-86f0-baf3f1fe8ac9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1543.003.
  Threat Actor: Qilin
references:
  - https://attack.mitre.org/techniques/T1543.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: google
  service: workspace
  category: admin_activity

detection:
  selection:
    actor.email: admin@example.com
    events.type: admin_role_assigned
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1543.003
  - actor.qilin
