title: Query Registry - Cl0p (security)
id: 31ba8b5f-cb2c-4a54-a170-2f9283b669f9
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1012 (Query Registry).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1012/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_aadhealth_mon_agent_regkey_access.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1012
  - actor.cl0p
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    ObjectType|contains: 'Key'
    ObjectName|contains:
      - '\REGISTRY\MACHINE\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent'
      - 'Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe'
      - 'Microsoft.Identity.Health.Adfs.InsightsService.exe'
      - 'Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe'
      - 'Microsoft.Identity.Health.Adfs.PshSurrogate.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
