title: Group Policy Modification - Cl0p (security)
id: 97b86331-d80c-4453-8aa7-3f8ec034e4e6
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1484.001 (Group Policy Modification).
  Associated threat actor: Cl0p
references:
  - https://attack.mitre.org/techniques/T1484/001/
  - https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/security/win_security_default_domain_gpo_modification.yml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1484.001
  - actor.cl0p
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    EventID|contains: '5136'
    ObjectClass|contains: 'groupPolicyContainer'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
