title: Masquerade Task or Service (WINDOWS - defender)
id: 025b838e-9ee9-4fa1-9145-21569ba7f3a4
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1036.004.
  Threat Actor: Higaisa
references:
  - https://attack.mitre.org/techniques/T1036.004/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: defender
  category: process_creation

detection:
  selection:
    CommandLine|contains|windash|contains:
      - ' /create '
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1036.004
  - actor.higaisa
