title: System Network Connections Discovery (MACOS - unified_logging)
id: 5757f154-5d97-4a79-93e4-0ef9b9062623
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1049.
  Threat Actor: Ke3chang
references:
  - https://attack.mitre.org/techniques/T1049/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/who'
      - '/w'
      - '/last'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1049
  - actor.ke3chang
