title: Spearphishing Attachment (M365)
id: 4efdaf26-f633-47ee-9af8-16b0f02c299f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1566.001.
references:
  - https://attack.mitre.org/techniques/T1566.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    AttachmentExtension|in:
      - 'exe'
      - 'dll'
      - 'zip'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1566.001
