title: Debugger Evasion (M365 - entra_id)
id: fce41f1c-fe3f-40b5-9a90-beab392502ee
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1622.
  Threat Actor: BlackBasta
references:
  - https://attack.mitre.org/techniques/T1622/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: m365
  service: entra_id
  category: authentication

detection:
  selection:
    userPrincipalName: user@domain.com
    ipAddress|startswith:
      - '192.168'
      - '10.0'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1622
  - actor.blackbasta
