title: Input Capture - Hive (defender)
id: d7f23379-061b-44ec-9759-ce754ca6ed02
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1056 (Input Capture).
  Associated threat actor: Hive
references:
  - https://attack.mitre.org/techniques/T1056/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/collection_posh_keylogger.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1056
  - actor.hive
logsource:
  product: windows
  service: defender
  category: process_creation
detection:
  selection:
    user.id|contains: 'S-1-5-18'
    powershell.file.script_block_text|contains: 'sentinelbreakpoints'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
