title: Token Impersonation/Theft (WINDOWS - sysmon)
id: f45e8026-0fba-4ef5-ae5f-69792c8ac8d9
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1134.001.
  Threat Actor: FIN8
references:
  - https://attack.mitre.org/techniques/T1134.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - ' backupkey '
      - ' blob '
      - ' certificates '
    ParentImage|endswith|contains:
      - '\services.exe'
    CommandLine|contains|all|contains:
      - '/c'
      - 'echo'
      - '\pipe\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1134.001
  - actor.fin8
