title: Application Layer Protocol (WINDOWS - sysmon)
id: aa126b55-0827-4b04-9334-a8c70d0ad278
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1071.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1071/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    CommandLine|contains|contains:
      - 'spawnclient'
    Description|contains|contains:
      - 'st2stager'
    ParentImage|endswith|contains:
      - '\explorer.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1071
  - actor.spectra
