title: Hide Artifacts (WINDOWS - sysmon)
id: eee77010-5a70-4e80-8302-05b2183ee1cf
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1564.
  Threat Actor: Spectra
references:
  - https://attack.mitre.org/techniques/T1564/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:
  selection:
    ParentImage|contains|contains:
      - ':\Users\Public\'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1564
  - actor.spectra
