title: System Owner/User Discovery (WINDOWS - security)
id: a337e630-29ed-483c-bb87-113b0658be46
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1033.
  Threat Actor: APT3
references:
  - https://attack.mitre.org/techniques/T1033/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '\SharpLdapWhoami.exe'
    CommandLine|contains|all|contains:
      - 'Get-ADComputer '
      - ' -Filter \*'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1033
  - actor.apt3
