title: Local Account (WINDOWS - security)
id: 35dfe04b-a6cd-4f95-b1d2-cd49c4a3d75f
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1136.001.
  Threat Actor: APT3
references:
  - https://attack.mitre.org/techniques/T1136.001/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    TargetUserName|endswith|contains:
      - '$'
    SamAccountName|contains|all|contains:
      - 'ANONYMOUS'
      - 'LOGON'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1136.001
  - actor.apt3
