title: Accessibility Features (WINDOWS - security)
id: 0364223b-80c8-4852-97b2-34f990d830b3
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1546.008.
  Threat Actor: APT3
references:
  - https://attack.mitre.org/techniques/T1546.008/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection:
    CommandLine|contains|all|contains:
      - 'copy '
      - '/y '
    ParentImage|endswith|contains:
      - '\winlogon.exe'
    Image|endswith|contains:
      - '\cmd.exe'
      - '\cscript.exe'
      - '\mshta.exe'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1546.008
  - actor.apt3
