title: Encrypted Channel - COOSEA (security)
id: 1591699a-00d5-44f5-9870-063fb4580304
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1573 (Encrypted Channel).
  Associated threat actor: COOSEA
references:
  - https://attack.mitre.org/techniques/T1573/
  - https://github.com/elastic/detection-rules/blob/main/rules/windows/command_and_control_encrypted_channel_freesslcert.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1573
  - actor.coosea
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    dns.question.name|contains:
      - '*letsencrypt.org'
      - '*.freessl.org'
    process.executable|contains:
      - 'C:\\Windows\\System32\\*.exe'
      - 'C:\\Windows\\notepad.exe'
    process.name|contains:
      - 'svchost.exe'
      - 'msedge.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
