title: System Binary Proxy Execution - Nitrogen (unified_logging)
id: 7efc4877-bc45-4d4a-94ef-5607c1d2b308
status: experimental
description: |
  Detects activity consistent with MITRE ATT&CK technique T1218 (System Binary Proxy Execution).
  Associated threat actor: Nitrogen
references:
  - https://attack.mitre.org/techniques/T1218/
  - https://github.com/elastic/detection-rules/blob/main/rules/_deprecated/defense_evasion_mshta_making_network_connections.toml
author: GapMATRIX Sigma Generator
date: 2026-01-28
tags:
  - attack.t1218
  - actor.nitrogen
logsource:
  product: macos
  service: unified_logging
  category: process_creation
detection:
  selection:
    process.name|contains: 'mshta.exe'
  condition: selection
falsepositives:
  - Legitimate administrative activity
  - Authorised security testing
level: medium
