title: Cron (MACOS - unified_logging)
id: 5d344f2f-05c7-4945-9311-34d6435f2b16
description: >
  Detects techniques consistent with MITRE ATT&CK technique T1053.003.
  Threat Actor: APT38
references:
  - https://attack.mitre.org/techniques/T1053.003/
author: GapMATRIX Intelligent Sigma Generator
date: 2026-01-28
status: experimental
severity: medium

logsource:
  product: macos
  service: unified_logging
  category: process_creation

detection:
  selection:
    Image|endswith|contains:
      - '/crontab'
    CommandLine|contains|contains:
      - '/tmp/'
  condition: selection

falsepositives:
  - Legitimate system administration activity
  - Authorized security testing

tags:
  - attack.T1053.003
  - actor.apt38
